window.Names = {
    "quickLookup": [
        "Абзал",
        "Абигейл",
        "Абрам",
        "Абу",
        "Абулхаир",
        "Август",
        "Авдотья",
        "Авелина",
        "Авивент",
        "Авраам",
        "Аврелия",
        "Аврора",
        "Агата",
        "Агафия",
        "Агафья",
        "Агжан",
        "Аглая",
        "Агнеса",
        "Агнесса",
        "Агния",
        "Ада",
        "Адам",
        "Аделаида",
        "Аделия",
        "Аделла",
        "Адель",
        "Аделя",
        "Адема",
        "Адиль",
        "Адиля",
        "Адима",
        "Адина",
        "Адия",
        "Адриан",
        "Адриана",
        "Адьян",
        "Ажара",
        "Азалия",
        "Азамат",
        "Азат",
        "Азель",
        "Азиз",
        "Азиза",
        "Азира",
        "Аида",
        "Аидана",
        "Аима",
        "Аина",
        "Аиса",
        "Аиша",
        "Айару",
        "Айбаршын",
        "Айганым",
        "Айгерим",
        "Айгул",
        "Айгуль",
        "Айгуля",
        "Айдай",
        "Айдан",
        "Айдана",
        "Айдар",
        "Айдима",
        "Айдын",
        "Айдыс",
        "Айжамалик",
        "Айжан",
        "Айзада",
        "Айзере",
        "Айзяра",
        "Айида",
        "Айко",
        "Айлана",
        "Айлин",
        "Айман",
        "Аймейра",
        "Айнагул",
        "Айнагуль",
        "Айназ",
        "Айнара",
        "Айнаш",
        "Айно",
        "Айнур",
        "Айнура",
        "Айнурлы",
        "Айпери",
        "Айрат",
        "Айрис",
        "Айсауле",
        "Айсель",
        "Айсине",
        "Айслу",
        "Айсу",
        "Айсултан",
        "Айсулу",
        "Айтадж",
        "Айтак",
        "Айтач",
        "Айтен",
        "Айткуль",
        "Айтурсын",
        "Айтханым",
        "Айханум",
        "Айша",
        "Айшана",
        "Айшат",
        "Айшок",
        "Айым",
        "Айымжан",
        "Акбар",
        "Акбаян",
        "Акбота",
        "Акгуль",
        "Акзия",
        "Аким",
        "Аклима",
        "Акмарал",
        "Акниет",
        "Акнур",
        "Акоп",
        "Аксана",
        "Аксинья",
        "Акслу",
        "Актеме",
        "Актолкын",
        "Актоты",
        "Алан",
        "Алана",
        "Алания",
        "Алара",
        "Аларика",
        "Алдар",
        "Алдияр",
        "Алевтина",
        "Алекс",
        "Александер",
        "Александр",
        "Александра",
        "Александрина",
        "Алессандро",
        "Алеся",
        "Алета",
        "Алефтина",
        "Али",
        "Алие",
        "Алик",
        "Алика",
        "Алим",
        "Алима",
        "Алимпия",
        "Алина",
        "Алинда",
        "Алинур",
        "Алиса",
        "Алисия",
        "Алихан",
        "Алиция",
        "Алишер",
        "Алия",
        "Алла",
        "Алма",
        "Алмаз",
        "Алсу",
        "Алтын",
        "Алтынай",
        "Алуа",
        "Альберт",
        "Альбина",
        "Альвина",
        "Альмира",
        "Альп",
        "Альпаслан",
        "Альтея",
        "Альфина",
        "Альфия",
        "Альфред",
        "Альюна",
        "Алёна",
        "Амалик",
        "Амалия",
        "Амелия",
        "Амиде",
        "Амилия",
        "Амиль",
        "Амин",
        "Амина",
        "Аминат",
        "Амир",
        "Амира",
        "Амирхан",
        "Ана",
        "Анаит",
        "Анар",
        "Анара",
        "Анастасия",
        "Анашым",
        "Анвар",
        "Ангела",
        "Ангелина",
        "Андраник",
        "Андрей",
        "Андрес",
        "Андриан",
        "Андриана",
        "Анелия",
        "Анель",
        "Анжела",
        "Анжелика",
        "Анжелина",
        "Ани",
        "Аниель",
        "Аникай",
        "Аникам",
        "Анис",
        "Аниса",
        "Анисим",
        "Анисия",
        "Анита",
        "Ания",
        "Анна",
        "Анна-Мария",
        "Аннели",
        "Анрета",
        "Ансаган",
        "Ансар",
        "Антон",
        "Антонида",
        "Антонина",
        "Ануш",
        "Анфиса",
        "Аня",
        "Апам",
        "Аполлинария",
        "Апполинарий",
        "Арай",
        "Арайка",
        "Арайлым",
        "Аракся",
        "Арам",
        "Ардана",
        "Аревик",
        "Арен",
        "Арзу",
        "Ариадна",
        "Ариана",
        "Арианна",
        "Арина",
        "Арифметикон",
        "Ариэла",
        "Ариэль",
        "Ария",
        "Аркадий",
        "Арлан",
        "Арман",
        "Армен",
        "Арменуи",
        "Арминэ",
        "Арнольд",
        "Арон",
        "Арсен",
        "Арсений",
        "Арсения",
        "Арслан",
        "Артемий",
        "Артур",
        "Артём",
        "Аружан",
        "Архип",
        "Арыймаа",
        "Арюна",
        "Асаль",
        "Асель",
        "Асем",
        "Асия",
        "Аскар",
        "Аскольд",
        "Аслан",
        "Ассель",
        "Ассима",
        "Аста",
        "Ася",
        "Атиркуль",
        "Аурелия",
        "Аурика",
        "Аушра",
        "Афак",
        "Афанасий",
        "Афанасия",
        "Афина",
        "Ахмад",
        "Ахмед",
        "Ашот",
        "Ашхен",
        "Аэлита",
        "Аюка",
        "Ая",
        "Аягоз",
        "Аягуль",
        "Аяна",
        "Аяулым",
        "Аячонам",
        "Бабушка",
        "Багила",
        "Баглан",
        "Бадри",
        "Бажена",
        "Баирма",
        "Байсари",
        "Бактыгуль",
        "Бакыт",
        "Балдай",
        "Балзила",
        "Балнур",
        "Барби",
        "Барно",
        "Басти",
        "Батыр",
        "Бахар",
        "Бахиткуль",
        "Бахора",
        "Бахыт",
        "Баян",
        "Беата",
        "Беатриса",
        "Бегимай",
        "Бейнегуль",
        "Бекзада",
        "Бекзат",
        "Бекзод",
        "Бекки",
        "Бела",
        "Белла",
        "Бикатайка",
        "Билл",
        "Богатоз",
        "Богдан",
        "Богдана",
        "Божена",
        "Борислав",
        "Борислава",
        "Боря",
        "Бота",
        "Ботагез",
        "Ботагоз",
        "Ботакез",
        "Булат",
        "Бэла",
        "Бэлигма",
        "Бэлла",
        "Бэтти",
        "Бягуль",
        "Вадим",
        "Вазген",
        "Валентин",
        "Валентина",
        "Валерий",
        "Валерия",
        "Валида",
        "Ванда",
        "Ваня",
        "Варвара",
        "Варя",
        "Василина",
        "Василиса",
        "Василя",
        "Васса",
        "Вася",
        "Вацлав",
        "Велизар",
        "Велина",
        "Венера",
        "Вениамин",
        "Вера",
        "Веред",
        "Вероника",
        "Веселина",
        "Веска",
        "Весма",
        "Веста",
        "Вета",
        "Ветта",
        "Виалина",
        "Вивея",
        "Вивиана",
        "Вида",
        "Вика",
        "Виктория",
        "Вилена",
        "Вильгельм",
        "Вильям",
        "Виола",
        "Виолетта",
        "Виолика",
        "Виолина",
        "Виорика",
        "Вирга",
        "Вирта",
        "Виссарион",
        "Вита",
        "Виталий",
        "Виталина",
        "Витя",
        "Влад",
        "Влада",
        "Владислав",
        "Владислава",
        "Владлена",
        "Вова",
        "Вольдемар",
        "Всеволод",
        "Вячеслав",
        "Вячеслава",
        "Габи",
        "Габриела",
        "Габриэль",
        "Гавриил",
        "Гадиля",
        "Газиза",
        "Галина",
        "Галия",
        "Гамзат",
        "Гамид",
        "Гамида",
        "Гамлет",
        "Гасэм",
        "Гаухар",
        "Гая",
        "Гаяна",
        "Гаянэ",
        "Геворг",
        "Гезель",
        "Гектор",
        "Гелена",
        "Гелиана",
        "Гелюса",
        "Гена",
        "Генриетта",
        "Генрих",
        "Генута",
        "Гео",
        "Георгий",
        "Гера",
        "Герасим",
        "Герман",
        "Герта",
        "Гизела",
        "Гильда",
        "Глафира",
        "Глеб",
        "Глория",
        "Гоги",
        "Гозель",
        "Гордей",
        "Горислав",
        "Гохар",
        "Гохарик",
        "Гочи",
        "Гоша",
        "Граня",
        "Гретта",
        "Грита",
        "Гриша",
        "Гузалия",
        "Гузаль",
        "Гузель",
        "Гузеля",
        "Гулафруз",
        "Гулбария",
        "Гулдана",
        "Гулжазира",
        "Гулжайна",
        "Гулжан",
        "Гулжанар",
        "Гулжанат",
        "Гулзада",
        "Гулзат",
        "Гулзира",
        "Гулим",
        "Гулия",
        "Гулнар",
        "Гулнара",
        "Гулноза",
        "Гулнора",
        "Гулнур",
        "Гулпери",
        "Гулсара",
        "Гулсим",
        "Гулчехра",
        "Гульайна",
        "Гульбану",
        "Гульдана",
        "Гульдар",
        "Гульден",
        "Гульдераим",
        "Гульжазира",
        "Гульжан",
        "Гульжана",
        "Гульжанат",
        "Гульжихан",
        "Гульзада",
        "Гульзара",
        "Гульзат",
        "Гульзина",
        "Гульзира",
        "Гулькей",
        "Гульназ",
        "Гульназира",
        "Гульнар",
        "Гульнара",
        "Гульнасып",
        "Гульниза",
        "Гульнур",
        "Гульнура",
        "Гульсая",
        "Гульсим",
        "Гульсина",
        "Гульфира",
        "Гульфия",
        "Гульхан",
        "Гульчачак",
        "Гульчехра",
        "Гульшан",
        "Гульшат",
        "Гульюзем",
        "Гуля",
        "Гунда",
        "Гуцула",
        "Гюзель",
        "Гюли",
        "Гюльварт",
        "Гюльзар",
        "Гюльзарият",
        "Гюльназ",
        "Гюльнара",
        "Гяваз",
        "Давид",
        "Дагмара",
        "Дайана",
        "Дайганат",
        "Далия",
        "Даля",
        "Дамиан",
        "Дамир",
        "Дамира",
        "Дана",
        "Данагул",
        "Данагуль",
        "Данара",
        "Данель",
        "Даниел",
        "Даниела",
        "Даниелла",
        "Даниил",
        "Данил",
        "Данила",
        "Данира",
        "Данис",
        "Даниэл",
        "Даниэла",
        "Даниэлла",
        "Даниэль",
        "Даниял",
        "Данияр",
        "Данна",
        "Дара",
        "Даре",
        "Дари",
        "Дариан",
        "Дарима",
        "Дарина",
        "Дариуш",
        "Дариха",
        "Дария",
        "Дарияга",
        "Дарьдана",
        "Дарья",
        "Дарьяна",
        "Даулет",
        "Даурия",
        "Даша",
        "Дая",
        "Даян",
        "Даяна",
        "Дельгр",
        "Дементий",
        "Демид",
        "Демир",
        "Демьян",
        "Дениз",
        "Денис",
        "Джамал",
        "Джамилия",
        "Джамиль",
        "Джамиля",
        "Джана",
        "Джасмин",
        "Джейн",
        "Джемма",
        "Джемме",
        "Джен",
        "Дженифер",
        "Дженнет",
        "Джентик",
        "Джесика",
        "Джессика",
        "Джихан",
        "Джолин",
        "Джордж",
        "Джулианна",
        "Джулия",
        "Джульетта",
        "Дзера",
        "Дзерасса",
        "Диана",
        "Дианара",
        "Диас",
        "Дилавер",
        "Дилара",
        "Дилбар",
        "Дилором",
        "Дилрабо",
        "Дилфуза",
        "Дильназ",
        "Дильфуза",
        "Дильшат",
        "Диля",
        "Диляра",
        "Диляфрус",
        "Дима",
        "Дина",
        "Динар",
        "Динара",
        "Динкабай",
        "Дисана",
        "Добромир",
        "Добрыня",
        "Доля",
        "Доминик",
        "Доминика",
        "Донатас",
        "Дониер",
        "Дора",
        "Дора-Антония",
        "Дориан",
        "Дорина",
        "Доро",
        "Дорофей",
        "Дурдона",
        "Дуся",
        "Дэвид",
        "Дэни",
        "Дэниэл",
        "Дэниэль",
        "Дэсислава",
        "Дюльбер",
        "Ева",
        "Евангелина",
        "Евгений",
        "Евгения",
        "Евдокия",
        "Евпраксия",
        "Егана",
        "Егор",
        "Езги",
        "Екатерина",
        "Елена",
        "Елизавета",
        "Елисавета",
        "Елисей",
        "Ельзада",
        "Емельян",
        "Емеля",
        "Ерасыл",
        "Еремей",
        "Ержан",
        "Ерке",
        "Еркежан",
        "Ерофей",
        "Есения",
        "Ефим",
        "Ефимия",
        "Ефросиния",
        "Жадыра",
        "Жазгул",
        "Жазира",
        "Жайна",
        "Жакуляй",
        "Жамиля",
        "Жан",
        "Жанагул",
        "Жанар",
        "Жанаргуль",
        "Жанат",
        "Жанбота",
        "Жангуль",
        "Жанека",
        "Жанель",
        "Жания",
        "Жанкабай",
        "Жанна",
        "Жансауле",
        "Жансая",
        "Жансулу",
        "Жанукем",
        "Жаныл",
        "Жаным",
        "Жасмин",
        "Жасмина",
        "Жаухар",
        "Ждан",
        "Жибек",
        "Живиле",
        "Жони",
        "Жора",
        "Жулдуз",
        "Жулдыз",
        "Жулдызай",
        "Жумабай",
        "Жумагул",
        "Жумакуль",
        "Жупар",
        "Забира",
        "Забират",
        "Загра",
        "Заида",
        "Заира",
        "Зайнаб",
        "Зайнап",
        "Зайнаш",
        "Зайрагул",
        "Заки",
        "Закира",
        "Залина",
        "Залия",
        "Замбиля",
        "Замзагуль",
        "Замира",
        "Зара",
        "Зарема",
        "Зарима",
        "Зарина",
        "Зарминахон",
        "Зарнигор",
        "Заррина",
        "Заур",
        "Зауре",
        "Зауреш",
        "Захар",
        "Зденка",
        "Зебо",
        "Зейнаб",
        "Зеккие",
        "Земфира",
        "Зенфира",
        "Зера",
        "Зере",
        "Зефира",
        "Зефиркам",
        "Зимфира",
        "Зина",
        "Зинаида",
        "Зита",
        "Зифа",
        "Злата",
        "Златан",
        "Зои",
        "Зока",
        "Золия",
        "Зоран",
        "Зорница",
        "Зося",
        "Зохра",
        "Зоя",
        "Зубаржат",
        "Зулейха",
        "Зулпа",
        "Зульманат",
        "Зульфира",
        "Зульфия",
        "Зума",
        "Зумруд",
        "Зура",
        "Зухра",
        "Иаков",
        "Ибрагим",
        "Ива",
        "Иван",
        "Ивана",
        "Иванна",
        "Иветта",
        "Ивона",
        "Ивэйн",
        "Игнат",
        "Игнатий",
        "Игорь",
        "Ида",
        "Изабелла",
        "Изольда",
        "Израиль",
        "Изя",
        "Изяслав",
        "Иисус",
        "Илария",
        "Илиан",
        "Илиана",
        "Илиза",
        "Илия",
        "Илларион",
        "Иллона",
        "Илона",
        "Илфира",
        "Ильвира",
        "Ильгена",
        "Ильгиза",
        "Ильгизя",
        "Ильдар",
        "Ильза",
        "Ильзира",
        "Ильмира",
        "Ильназ",
        "Ильнар",
        "Ильнара",
        "Ильнур",
        "Ильсия",
        "Илья",
        "Ильяс",
        "Илюза",
        "Иляна",
        "Иман",
        "Имран",
        "Имрана",
        "Инга",
        "Ингрид",
        "Индира",
        "Инеза",
        "Инесса",
        "Инжу",
        "Инна",
        "Иннесса",
        "Иннокентий",
        "Инсар",
        "Инсаф",
        "Инэсса",
        "Иоанн",
        "Иоанна",
        "Иоланта",
        "Ионна",
        "Иосиф",
        "Ира",
        "Ирада",
        "Ираида",
        "Ираклий",
        "Ирена",
        "Ирина",
        "Ирма",
        "Ирода",
        "Ирэн",
        "Ирэна",
        "Исидора",
        "Искандер",
        "Искра",
        "Ислам",
        "Исмаил",
        "Ифа",
        "Ия",
        "Каан-Даниэль",
        "Кабира",
        "Кадерлем",
        "Кадрия",
        "Казимир",
        "Кайни",
        "Кайрат",
        "Каламкас",
        "Калерия",
        "Калипа",
        "Камал",
        "Камил",
        "Камила",
        "Камилла",
        "Камиль",
        "Камиля",
        "Камола",
        "Камшат",
        "Канат",
        "Каныш",
        "Каракыз",
        "Карен",
        "Кареша",
        "Карида",
        "Карим",
        "Карина",
        "Каринэ",
        "Карлыгаш",
        "Каролина",
        "Касиет",
        "Каталея",
        "Каталина",
        "Катарина",
        "Катидже",
        "Катя",
        "Каусар",
        "Каусария",
        "Кая",
        "Кеворк",
        "Кен",
        "Кенжегулге",
        "Кенжегуль",
        "Керен",
        "Кетино",
        "Кимберли",
        "Кир",
        "Кира",
        "Кирилл",
        "Клава",
        "Клавдия",
        "Клара",
        "Клена",
        "Клим",
        "Клэр",
        "Коля",
        "Корина",
        "Кормак",
        "Костя",
        "Кремена",
        "Крис",
        "Кристиан",
        "Кристина",
        "Кристофер",
        "Ксения",
        "Ксюша",
        "Кудрят",
        "Кузьма",
        "Куляим",
        "Кулян",
        "Кумар",
        "Кундуз",
        "Кундыз",
        "Куралай",
        "Кыздар",
        "Кэтрин",
        "Лавиника",
        "Лавр",
        "Лаврентий",
        "Лада",
        "Лайля",
        "Лайне",
        "Лала",
        "Лалена",
        "Лалина",
        "Лана",
        "Лара",
        "Лариса",
        "Лаура",
        "Лаша",
        "Леброн",
        "Лев",
        "Левон",
        "Лейла",
        "Лейсан",
        "Лейсана",
        "Лела",
        "Леля",
        "Лен",
        "Лена",
        "Ленара",
        "Лениана",
        "Лениара",
        "Лениза",
        "Лео",
        "Леон",
        "Леона",
        "Леонард",
        "Леонид",
        "Леонида",
        "Леонэль",
        "Леопольд",
        "Лера",
        "Леся",
        "Лея",
        "Лиам",
        "Лиана",
        "Либи",
        "Лида",
        "Лидия",
        "Лиза",
        "Лили",
        "Лилиана",
        "Лилианна",
        "Лилико",
        "Лилит",
        "Лилия",
        "Лилу",
        "Лиля",
        "Лина",
        "Линара",
        "Линда",
        "Лиор",
        "Лира",
        "Лиса",
        "Лиэль",
        "Лия",
        "Лола",
        "Лолита",
        "Лора",
        "Лоретта",
        "Луиза",
        "Луис",
        "Лука",
        "Лукас",
        "Лукерия",
        "Лукьян",
        "Лунара",
        "Лура",
        "Лусине",
        "Лутфулло",
        "Лучик",
        "Лучия",
        "Люба",
        "Любовь",
        "Люда",
        "Людмила",
        "Люзия",
        "Люси",
        "Люсинэ",
        "Люция",
        "Лязат",
        "Ляззат",
        "Ляиза",
        "Ляйля",
        "Ляйсан",
        "Ляля",
        "Ляман",
        "Ляна",
        "Лёша",
        "Мавлюда",
        "Магамед",
        "Магдалена",
        "Магдалина",
        "Магинора",
        "Магомед",
        "Мадина",
        "Мадинна",
        "Мадлен",
        "Мажена",
        "Маик",
        "Маиса",
        "Майгуль",
        "Майкл",
        "Майра",
        "Майрамгул",
        "Майя",
        "Макар",
        "Макия",
        "Макка",
        "Макка-Мадина",
        "Маккахан",
        "Макпал",
        "Максим",
        "Максимильян",
        "Максуда",
        "Максут",
        "Мактина",
        "Малик",
        "Малика",
        "Малохат",
        "Мама",
        "Мамура",
        "Манана",
        "Манзура",
        "Манижа",
        "Мансур",
        "Маншук",
        "Мара",
        "Марал",
        "Марат",
        "Маргарита",
        "Марго",
        "Марета",
        "Маржан",
        "Маржана",
        "Марзи",
        "Мариам",
        "Марианна",
        "Марика",
        "Марина",
        "Маричель",
        "Мариэта",
        "Мариэтта",
        "Мария",
        "Мариям",
        "Марк",
        "Марсель",
        "Марта",
        "Мартин",
        "Мартина",
        "Маруся",
        "Марфа",
        "Марья",
        "Марьям",
        "Марьяна",
        "Матвей",
        "Матильда",
        "Матлюба",
        "Матрена",
        "Матэ",
        "Мауриза",
        "Махабат",
        "Махаббат",
        "Махмуд",
        "Маша",
        "Мая",
        "Мевагул",
        "Медина",
        "Мейрамгул",
        "Мелания",
        "Мелек",
        "Мелисса",
        "Мендигуль",
        "Мерджен",
        "Мерей",
        "Мереке",
        "Мери",
        "Мериван",
        "Мерседес",
        "Меруерт",
        "Мехрангез",
        "Мехрнигор",
        "Миа",
        "Мигель",
        "Мидина",
        "Микаэл",
        "Микаэла",
        "Микаэль",
        "Микая",
        "Мила",
        "Милада",
        "Милан",
        "Милана",
        "Милена",
        "Милиса",
        "Миллана",
        "Милослава",
        "Минара",
        "Миндания",
        "Миннира",
        "Минслу",
        "Мира",
        "Мирай",
        "Мирам",
        "Мирана",
        "Мирас",
        "Мири",
        "Мириам",
        "Мирон",
        "Мирослав",
        "Мирослава",
        "Мирра",
        "Мирсини",
        "Мирслу",
        "Митрофан",
        "Митя",
        "Михаель",
        "Михей",
        "Миша",
        "Мишель",
        "Мия",
        "Моисей",
        "Молдин",
        "Молдир",
        "Мона",
        "Моника",
        "Мохигулхон",
        "Мохинур",
        "Мохира",
        "Мстислав",
        "Мстислава",
        "Мугминат",
        "Муза",
        "Музлифат",
        "Мукаддас",
        "Мулаим",
        "Мунир",
        "Мунира",
        "Мурад",
        "Мурат",
        "Мусалия",
        "Муслим",
        "Муслима",
        "Мустафа",
        "Мухаммед",
        "Мухаммед Али",
        "Мухаммед Эмир",
        "Мухиба",
        "Мухибахон",
        "Мухлиса",
        "Мухтар",
        "Мэри",
        "Мээрим",
        "Нагима",
        "Нагмид",
        "Надежда",
        "Наджие",
        "Наджия",
        "Надиля",
        "Надин",
        "Надире",
        "Надя",
        "Нажия",
        "Назар",
        "Назгул",
        "Назгуль",
        "Назерке",
        "Назик",
        "Назика",
        "Назиля",
        "Назипа",
        "Назирочка",
        "Назия",
        "Назлыгуль",
        "Назмира",
        "Назым",
        "Наида",
        "Наила",
        "Наиль",
        "Наиля",
        "Наина",
        "Наира",
        "Наируи",
        "Найа",
        "Найля",
        "Накия",
        "Намжилма",
        "Нана",
        "Нани",
        "Нанули",
        "Написат",
        "Нараяна",
        "Наргиза",
        "Наргис",
        "Нарго",
        "Наргул",
        "Нарек",
        "Нарине",
        "Наркес",
        "Нармин",
        "Нармина",
        "Нарт",
        "Нарыйа",
        "Насиба",
        "Настя",
        "Наталия",
        "Наталья",
        "Натан",
        "Натаниэль",
        "Наташа",
        "Натела",
        "Нателла",
        "Наум",
        "Нафиза",
        "Нафиса",
        "Нева",
        "Нелли",
        "Нелля",
        "Неля",
        "Неонила",
        "Неонилла",
        "Нестор",
        "Нефизе",
        "Нехама",
        "Ниа",
        "Нигар",
        "Нигина",
        "Нигора",
        "Нигяр",
        "Ника",
        "Никанор",
        "Никита",
        "Николь",
        "Николя",
        "Нил",
        "Нильс",
        "Нилюфер",
        "Нина",
        "Нинель",
        "Нино",
        "Ноа",
        "Нозима",
        "Нона",
        "Нонна",
        "Нора",
        "Нуашка",
        "Нуашка ",
        "Нурадил",
        "Нурана",
        "Нуране",
        "Нурания",
        "Нурбакыт",
        "Нурбану",
        "Нургул",
        "Нуржамал",
        "Нуржемал",
        "Нурзада",
        "Нурик",
        "Нурлан",
        "Нурсауле",
        "Нурсиля",
        "Нурсият",
        "Нурсулу",
        "Нуфуза",
        "Нэлли",
        "Нэлля",
        "Нэля",
        "Нюргуяна",
        "Нюрзият",
        "Ованес",
        "Овсанна",
        "Оксана",
        "Октябрина",
        "Олаф",
        "Олег",
        "Олеся",
        "Оливия",
        "Олимпиада",
        "Олоф",
        "Ольга",
        "Оля",
        "Омар",
        "Омирхан",
        "Оравхан",
        "Оразгул",
        "Орнелла",
        "Орхан",
        "Осип",
        "Оскар",
        "Осман",
        "Оснат",
        "Офелия",
        "Оюна",
        "Оя",
        "Павла",
        "Павлина",
        "Пантелеймон",
        "Парфен",
        "Патима",
        "Патимат",
        "Патрисия",
        "Пахом",
        "Паша",
        "Пелагея",
        "Перизат",
        "Петра",
        "Петя",
        "Пикрия",
        "Пламен",
        "Платон",
        "Поликсена",
        "Полина",
        "Прасковья",
        "Праскофья",
        "Прохор",
        "Рабига",
        "Рабиля",
        "Равиль",
        "Равиля",
        "Равия",
        "Рада",
        "Радель",
        "Радим",
        "Радимир",
        "Радион",
        "Радмила",
        "Радмир",
        "Радмира",
        "Разиля",
        "Разима",
        "Разият",
        "Раиса",
        "Райана",
        "Райвис",
        "Райганат",
        "Райгардас",
        "Райен",
        "Райля",
        "Райхан",
        "Райхана",
        "Ракия",
        "Раксана",
        "Ралина",
        "Рамазан",
        "Рамелла",
        "Рамзия",
        "Рами",
        "Рамида",
        "Рамиль",
        "Рамина",
        "Рания",
        "Рано",
        "Рапсиме",
        "Расим ",
        "Расима",
        "Расул",
        "Ратмир",
        "Ратха",
        "Рауфа",
        "Раушан",
        "Раушания",
        "Рафа",
        "Рафаэль",
        "Рахила",
        "Рахим",
        "Рахымжан",
        "Рашид",
        "Рая",
        "Раяна",
        "Реваль",
        "Регина",
        "Резеда",
        "Резида",
        "Резо",
        "Ремзия",
        "Рена",
        "Ренат",
        "Рената",
        "Риана",
        "Рианна",
        "Рида",
        "Риза",
        "Ризида",
        "Рима",
        "Римма",
        "Рина",
        "Ринат",
        "Рината",
        "Рита",
        "Ричард",
        "Роберт",
        "Родион",
        "Роза",
        "Розита",
        "Роксана",
        "Ролан",
        "Роланд",
        "Рома",
        "Рони",
        "Ростислав",
        "Ростислава",
        "Рошни",
        "Рубен",
        "Рубина",
        "Рузалия",
        "Рузана",
        "Рузанна",
        "Рузида",
        "Рузиля",
        "Румада",
        "Румия",
        "Русалина",
        "Руслан",
        "Руслана",
        "Рустам",
        "Руфат",
        "Руфина",
        "Руфия",
        "Рухсанам",
        "Рушана",
        "Рушания",
        "Рэм",
        "Сабина",
        "Сабира",
        "Сабрина",
        "Сабуха",
        "Савва",
        "Савелий",
        "Савия",
        "Сагдиана",
        "Саги",
        "Сагират",
        "Саид",
        "Саида",
        "Саира",
        "Сайдам",
        "Сакинат",
        "Салават",
        "Салим",
        "Салима",
        "Саломия",
        "Салтанат",
        "Сальвадор",
        "Саля",
        "Самал",
        "Самат",
        "Самина",
        "Самир",
        "Самира",
        "Самсон",
        "Самуил",
        "Самуэль",
        "Санал",
        "Санам",
        "Санда",
        "Санди",
        "Сандра",
        "Сандро",
        "Сандугаш",
        "Санжар",
        "Сания",
        "Санталят",
        "Саодат",
        "Сапият",
        "Сара",
        "Саргылана",
        "Сардана",
        "Саркис",
        "Сармат",
        "Сатеник",
        "Сати",
        "Сатори",
        "Саулеш",
        "Сафи",
        "Сафина",
        "Сафия",
        "Саяжан",
        "Саян",
        "Саяна",
        "Света",
        "Светара",
        "Светлана",
        "Святослав",
        "Сеадет",
        "Себастьян",
        "Сева",
        "Севара",
        "Севастиан",
        "Севастьян",
        "Севда",
        "Северин",
        "Северина",
        "Севиль",
        "Севиндж",
        "Седа",
        "Седагет",
        "Сезим",
        "Селевна",
        "Селена",
        "Семён",
        "Серафим",
        "Серафима",
        "Сергей",
        "Сержан",
        "Сиадат",
        "Силвия",
        "Сильва",
        "Сильвия",
        "Симон",
        "Симона",
        "Сирамарг",
        "Слава",
        "Смадар",
        "Снежана",
        "Снежанна",
        "Собира",
        "Согдиана",
        "Солмаз",
        "Соломон",
        "Сона",
        "Сония",
        "Сонун",
        "Соня",
        "Софико",
        "София",
        "София-Изабель",
        "Софья",
        "Спиридон",
        "Станислава",
        "Стас",
        "Стелла",
        "Стефан",
        "Стефани",
        "Стефания",
        "Стэлла",
        "Стёпа",
        "Суджана",
        "Сузанна",
        "Сулейман",
        "Султан",
        "Сулхия",
        "Сурен",
        "Суркура",
        "Сурэна",
        "Сусанна",
        "Сымбат",
        "Сынару",
        "Сюзанна",
        "Сюмбель",
        "Тагир",
        "Таир",
        "Таисия",
        "Таита",
        "Таифа",
        "Тай",
        "Талиб",
        "Талия",
        "Тамара",
        "Тамерлан",
        "Тамерлана",
        "Тамила",
        "Тамилла",
        "Тамир",
        "Тамо",
        "Тамука",
        "Танзиля",
        "Танхылу",
        "Таня",
        "Тара",
        "Тарас",
        "Тариэл",
        "Тариэль",
        "Таслима",
        "Тася",
        "Татевик",
        "Татьяна",
        "Тахир",
        "Тахмина",
        "Таша",
        "Тая",
        "Теа",
        "Теймур",
        "Темирлан",
        "Теодора",
        "Теона",
        "Тереза",
        "Тея",
        "Тигран",
        "Тимофей",
        "Тимур",
        "Тина",
        "Тихон",
        "Тишкен",
        "Товшан",
        "Тогжан",
        "Токжан",
        "Толганай",
        "Толкун",
        "Толя",
        "Тома",
        "Томас",
        "Томилана",
        "Томирис",
        "Трофим",
        "Туйгууна",
        "Туяна",
        "Тэрри",
        "Узишка",
        "Улжан",
        "Улпан",
        "Ульяна",
        "Ума",
        "Умар",
        "Умеда",
        "Умит",
        "Устина",
        "Уюта",
        "Фагиля",
        "Фаддей",
        "Фадей",
        "Фазолат",
        "Фаина",
        "Файха",
        "Фанзиля",
        "Фанзия",
        "Фаниса",
        "Фания",
        "Фарда",
        "Фарзона",
        "Фарид",
        "Фарида",
        "Фариза",
        "Фархат",
        "Фатима",
        "Фахд",
        "Февзие",
        "Федора",
        "Федя",
        "Феликс",
        "Фелина",
        "Феодосия",
        "Феония",
        "Феофания",
        "Фергане",
        "Фердос",
        "Феруза",
        "Физа",
        "Филипп",
        "Филлипид",
        "Фируза",
        "Фирюза",
        "Флера",
        "Флида",
        "Флора",
        "Флорида",
        "Флюра",
        "Фома",
        "Франческа",
        "Фэрис",
        "Хабиба",
        "Хадижа",
        "Хадижат",
        "Хазал",
        "Хайни",
        "Хаким",
        "Халжат",
        "Халид",
        "Халида",
        "Халима",
        "Халимат",
        "Халиса",
        "Халися",
        "Хамза",
        "Хамсият",
        "Хамшут",
        "Хана",
        "Хания",
        "Ханна",
        "Ханум",
        "Харитон",
        "Хатира",
        "Хеда",
        "Хидая",
        "Хилола",
        "Хорагай",
        "Христина",
        "Хумора",
        "Хусноро",
        "Цвитана",
        "Цезарь",
        "Цыцыгма",
        "Чарли",
        "Чесик",
        "Чимита",
        "Чинара",
        "Чинчи",
        "Чичак",
        "Чолпон",
        "Чолпонай",
        "Чулпан",
        "Шабнам",
        "Шазие",
        "Шаира",
        "Шайыргул",
        "Шамиль",
        "Шамсет",
        "Шария",
        "Шафика",
        "Шахинура",
        "Шахиста",
        "Шахло",
        "Шахноза",
        "Шахруза",
        "Шергазы",
        "Шеризат",
        "Шимон",
        "Ширин",
        "Шолпан",
        "Шон",
        "Шончалай",
        "Шохина",
        "Шушан",
        "Шушанна",
        "Шынара",
        "Эвелина",
        "Эвридика",
        "Эдгар",
        "Эдем",
        "Эдита",
        "Эдуард",
        "Элана",
        "Элен",
        "Элена",
        "Элеонора",
        "Элефтереос ",
        "Элиаз",
        "Элиза",
        "Элизабетт",
        "Элина",
        "Элисия",
        "Элита",
        "Элиф",
        "Элияна",
        "Элла",
        "Эллеонора",
        "Элли",
        "Эллина",
        "Эллис",
        "Элля",
        "Элмира",
        "Элона",
        "Эльбрус",
        "Эльвиза",
        "Эльвина",
        "Эльвира",
        "Эльдар",
        "Эльза",
        "Эльзина",
        "Эльмас",
        "Эльмир",
        "Эльмира",
        "Эльнара",
        "Эмили",
        "Эмилия",
        "Эмиль",
        "Эмин",
        "Эмине",
        "Эмир",
        "Эмма",
        "Эммануил",
        "Эммануэлла",
        "Эмран",
        "Эндже",
        "Эндимион",
        "Эра",
        "Эрдэм",
        "Эренест",
        "Эржебет",
        "Эрик",
        "Эрика",
        "Эрмине",
        "Эрна",
        "Эрнест",
        "Эрнст",
        "Эсма",
        "Эсмеральда",
        "Эсмира",
        "Эстель",
        "Эстер",
        "Юдит",
        "Юлиана",
        "Юлиса",
        "Юлия",
        "Юля",
        "Юна",
        "Юнис",
        "Юния",
        "Юнна",
        "Юнона",
        "Юра",
        "Юсак",
        "Юсуф",
        "Ягут",
        "Ядвига",
        "Яков",
        "Ян",
        "Яна",
        "Янина",
        "Янис",
        "Януш",
        "Ярмила",
        "Яромир",
        "Ярослав",
        "Ярослава",
        "Ярославна",
        "Ясин",
        "Ясира",
        "Ясмин",
        "Ясмина",
        "Яссер",
        "Яцек",
        "Яша",
        "Яэль"
    ],
    "Абзал": {
        "translit": "abzal",
        "gender": "f",
        "genitive": "Абзал",
        "variants": [
            "абзал"
        ]
    },
    "Абигейл": {
        "translit": "abigeil",
        "gender": "m",
        "genitive": "Абигейла",
        "variants": [
            "абигейл"
        ]
    },
    "Абрам": {
        "translit": "abram",
        "gender": "m",
        "genitive": "Абрама",
        "variants": [
            "абрам",
            "абрамушка",
            "абрамчик"
        ]
    },
    "Абу": {
        "translit": "abu",
        "gender": "m",
        "genitive": "Абу",
        "variants": [
            "абу"
        ]
    },
    "Абулхаир": {
        "translit": "abulhair",
        "gender": "m",
        "genitive": "Абулхаира",
        "variants": [
            "абулхаир"
        ]
    },
    "Август": {
        "translit": "avgust",
        "gender": "m",
        "genitive": "Августа",
        "variants": [
            "август",
            "августик",
            "августинчик"
        ]
    },
    "Авдотья": {
        "translit": "avdotya",
        "gender": "f",
        "genitive": "Авдотьи",
        "variants": [
            "авдотья",
            "авдотушка",
            "доня",
            "дуня",
            "дуся"
        ]
    },
    "Авелина": {
        "translit": "avelina",
        "gender": "f",
        "genitive": "Авелины",
        "variants": [
            "авелина"
        ]
    },
    "Авивент": {
        "translit": "avivent",
        "gender": "f",
        "genitive": "Авивент",
        "variants": [
            "авивент"
        ]
    },
    "Авраам": {
        "translit": "avraam",
        "gender": "m",
        "genitive": "Авраама",
        "variants": [
            "авраам",
            "аврамушка",
            "аврамчик"
        ]
    },
    "Аврелия": {
        "translit": "avreliya",
        "gender": "f",
        "genitive": "Аврелии",
        "variants": [
            "аврелия"
        ]
    },
    "Аврора": {
        "translit": "avrora",
        "gender": "f",
        "genitive": "Авроры",
        "variants": [
            "аврора",
            "ава",
            "аврорушка"
        ]
    },
    "Агата": {
        "translit": "agata",
        "gender": "f",
        "genitive": "Агаты",
        "variants": [
            "агата",
            "агатушка",
            "гата",
            "гаточка"
        ]
    },
    "Агафия": {
        "translit": "agafiya",
        "gender": "f",
        "genitive": "Агафии",
        "variants": [
            "агафия",
            "аганя"
        ]
    },
    "Агафья": {
        "translit": "agafya",
        "gender": "f",
        "genitive": "Агафьи",
        "variants": [
            "агафья",
            "аганя"
        ]
    },
    "Агжан": {
        "translit": "agzhan",
        "gender": "f",
        "genitive": "Агжан",
        "variants": [
            "агжан"
        ]
    },
    "Аглая": {
        "translit": "aglaya",
        "gender": "f",
        "genitive": "Аглаи",
        "variants": [
            "аглая",
            "аглаечка"
        ]
    },
    "Агнеса": {
        "translit": "agnesa",
        "gender": "f",
        "genitive": "Агнесы",
        "variants": [
            "агнеса",
            "агнесочка"
        ]
    },
    "Агнесса": {
        "translit": "agnessa",
        "gender": "f",
        "genitive": "Агнессы",
        "variants": [
            "агнесса",
            "агнессочка"
        ]
    },
    "Агния": {
        "translit": "agniya",
        "gender": "f",
        "genitive": "Агнии",
        "variants": [
            "агния",
            "агнаточка"
        ]
    },
    "Ада": {
        "translit": "ada",
        "gender": "f",
        "genitive": "Ады",
        "variants": [
            "ада",
            "аделинка",
            "адочка",
            "адуля",
            "адюня"
        ]
    },
    "Адам": {
        "translit": "adam",
        "gender": "m",
        "genitive": "Адама",
        "variants": [
            "адам",
            "адамушка",
            "адамчик"
        ]
    },
    "Аделаида": {
        "translit": "adelaida",
        "gender": "f",
        "genitive": "Аделаиды",
        "variants": [
            "аделаида"
        ]
    },
    "Аделия": {
        "translit": "adeliya",
        "gender": "f",
        "genitive": "Аделии",
        "variants": [
            "аделия",
            "аделичка"
        ]
    },
    "Аделла": {
        "translit": "adella",
        "gender": "f",
        "genitive": "Аделлы",
        "variants": [
            "аделла"
        ]
    },
    "Адель": {
        "translit": "adel",
        "gender": "f",
        "genitive": "Адели",
        "variants": [
            "адель",
            "аделечка",
            "аделя"
        ]
    },
    "Аделя": {
        "translit": "adelya",
        "gender": "f",
        "genitive": "Адели",
        "variants": [
            "аделя"
        ]
    },
    "Адема": {
        "translit": "adema",
        "gender": "f",
        "genitive": "Адемы",
        "variants": [
            "адема"
        ]
    },
    "Адиль": {
        "translit": "adil",
        "gender": "m",
        "genitive": "Адиля",
        "variants": [
            "адиль"
        ]
    },
    "Адиля": {
        "translit": "adily",
        "gender": "f",
        "genitive": "Адили",
        "variants": [
            "адиля"
        ]
    },
    "Адима": {
        "translit": "adima",
        "gender": "f",
        "genitive": "Адимы",
        "variants": [
            "адима"
        ]
    },
    "Адина": {
        "translit": "adina",
        "gender": "f",
        "genitive": "Адины",
        "variants": [
            "адина"
        ]
    },
    "Адия": {
        "translit": "adiya",
        "gender": "f",
        "genitive": "Адии",
        "variants": [
            "адия"
        ]
    },
    "Адриан": {
        "translit": "adrian",
        "gender": "m",
        "genitive": "Адриана",
        "variants": [
            "адриан"
        ]
    },
    "Адриана": {
        "translit": "adriana",
        "gender": "f",
        "genitive": "Адрианы",
        "variants": [
            "адриана"
        ]
    },
    "Адьян": {
        "translit": "adjyan",
        "gender": "m",
        "genitive": "Адьяна",
        "variants": [
            "адьян"
        ]
    },
    "Ажара": {
        "translit": "azhara",
        "gender": "f",
        "genitive": "Ажары",
        "variants": [
            "ажара"
        ]
    },
    "Азалия": {
        "translit": "azaliya",
        "gender": "f",
        "genitive": "Азалии",
        "variants": [
            "азалия",
            "аза"
        ]
    },
    "Азамат": {
        "translit": "azamat",
        "gender": "m",
        "genitive": "Азамата",
        "variants": [
            "азамат"
        ]
    },
    "Азат": {
        "translit": "azat",
        "gender": "m",
        "genitive": "Азата",
        "variants": [
            "азат"
        ]
    },
    "Азель": {
        "translit": "azel",
        "gender": "f",
        "genitive": "Азель",
        "variants": [
            "азель"
        ]
    },
    "Азиз": {
        "translit": "aziz",
        "gender": "m",
        "genitive": "Азиза",
        "variants": [
            "азиз"
        ]
    },
    "Азиза": {
        "translit": "aziza",
        "gender": "f",
        "genitive": "Азизы",
        "variants": [
            "азиза"
        ]
    },
    "Азира": {
        "translit": "azira",
        "gender": "f",
        "genitive": "Азиры",
        "variants": [
            "азира"
        ]
    },
    "Аида": {
        "translit": "aida",
        "gender": "f",
        "genitive": "Аиды",
        "variants": [
            "аида",
            "аидочка",
            "ида"
        ]
    },
    "Аидана": {
        "translit": "aidana",
        "gender": "f",
        "genitive": "Аиданы",
        "variants": [
            "аидана"
        ]
    },
    "Аима": {
        "translit": "aima",
        "gender": "f",
        "genitive": "Аимы",
        "variants": [
            "аима"
        ]
    },
    "Аина": {
        "translit": "aina",
        "gender": "f",
        "genitive": "Аимы",
        "variants": [
            "аина"
        ]
    },
    "Аиса": {
        "translit": "aisa",
        "gender": "f",
        "genitive": "Аисы",
        "variants": [
            "аиса"
        ]
    },
    "Аиша": {
        "translit": "aisha",
        "gender": "f",
        "genitive": "Аиши",
        "variants": [
            "аиша"
        ]
    },
    "Айару": {
        "translit": "ayaru",
        "gender": "f",
        "genitive": "Айару",
        "variants": [
            "айару"
        ]
    },
    "Айбаршын": {
        "translit": "ajbarshyn",
        "gender": "f",
        "genitive": "Айбаршын",
        "variants": [
            "айбаршын"
        ]
    },
    "Айганым": {
        "translit": "ajganym",
        "gender": "f",
        "genitive": "Айганым",
        "variants": [
            "айганым"
        ]
    },
    "Айгерим": {
        "translit": "aygerim",
        "gender": "f",
        "genitive": "Айгерим",
        "variants": [
            "айгерим"
        ]
    },
    "Айгул": {
        "translit": "ajygul",
        "gender": "f",
        "genitive": "Айгул",
        "variants": [
            "айгул"
        ]
    },
    "Айгуль": {
        "translit": "ajgul",
        "gender": "f",
        "genitive": "Айгуль",
        "variants": [
            "айгуль",
            "айгуленька"
        ]
    },
    "Айгуля": {
        "translit": "ajgulya",
        "gender": "f",
        "genitive": "Айгули",
        "variants": [
            "айгуля"
        ]
    },
    "Айдай": {
        "translit": "ajdaj",
        "gender": "f",
        "genitive": "Айдай",
        "variants": [
            "айдай"
        ]
    },
    "Айдан": {
        "translit": "ajdan",
        "gender": "f",
        "genitive": "Айдан",
        "variants": [
            "айдан"
        ]
    },
    "Айдана": {
        "translit": "ajdana",
        "gender": "f",
        "genitive": "Айданы",
        "variants": [
            "айдана"
        ]
    },
    "Айдар": {
        "translit": "ajdar",
        "gender": "m",
        "genitive": "Айдара",
        "variants": [
            "айдар"
        ]
    },
    "Айдима": {
        "translit": "ajdima",
        "gender": "f",
        "genitive": "Айдимы",
        "variants": [
            "айдима"
        ]
    },
    "Айдын": {
        "translit": "ajdyn",
        "gender": "f",
        "genitive": "Айдын",
        "variants": [
            "айдын"
        ]
    },
    "Айдыс": {
        "translit": "ajdys",
        "gender": "f",
        "genitive": "Айдыс",
        "variants": [
            "айдыс"
        ]
    },
    "Айжамалик": {
        "translit": "ajzhamalik",
        "gender": "f",
        "genitive": "Айжамалик",
        "variants": [
            "айжамалик"
        ]
    },
    "Айжан": {
        "translit": "ajzhan",
        "gender": "f",
        "genitive": "Айжан",
        "variants": [
            "айжан"
        ]
    },
    "Айзада": {
        "translit": "ajzada",
        "gender": "f",
        "genitive": "Айзады",
        "variants": [
            "айзада"
        ]
    },
    "Айзере": {
        "translit": "ajzere",
        "gender": "f",
        "genitive": "Айзере",
        "variants": [
            "айзере"
        ]
    },
    "Айзяра": {
        "translit": "ajzyara",
        "gender": "f",
        "genitive": "Айзяры",
        "variants": [
            "айзяра"
        ]
    },
    "Айида": {
        "translit": "ajida",
        "gender": "f",
        "genitive": "Айиды",
        "variants": [
            "айида"
        ]
    },
    "Айко": {
        "translit": "ajko",
        "gender": "f",
        "genitive": "Айко",
        "variants": [
            "айко"
        ]
    },
    "Айлана": {
        "translit": "aylana",
        "gender": "f",
        "genitive": "Айланы",
        "variants": [
            "айлана"
        ]
    },
    "Айлин": {
        "translit": "ajlin",
        "gender": "f",
        "genitive": "Айлин",
        "variants": [
            "айлин",
            "айлиночка"
        ]
    },
    "Айман": {
        "translit": "ajman",
        "gender": "f",
        "genitive": "Айман",
        "variants": [
            "айман"
        ]
    },
    "Аймейра": {
        "translit": "ajmejra",
        "gender": "f",
        "genitive": "Аймейры",
        "variants": [
            "аймейра"
        ]
    },
    "Айнагул": {
        "translit": "ajnagul",
        "gender": "f",
        "genitive": "Айнагул",
        "variants": [
            "айнагул"
        ]
    },
    "Айнагуль": {
        "translit": "ajnagull",
        "gender": "f",
        "genitive": "Айнагуль",
        "variants": [
            "айнагуль"
        ]
    },
    "Айназ": {
        "translit": "ajnaz",
        "gender": "f",
        "genitive": "Айназ",
        "variants": [
            "айназ"
        ]
    },
    "Айнара": {
        "translit": "ajnara",
        "gender": "f",
        "genitive": "Айнары",
        "variants": [
            "айнара"
        ]
    },
    "Айнаш": {
        "translit": "ajnash",
        "gender": "f",
        "genitive": "Айнаш",
        "variants": [
            "айнаш"
        ]
    },
    "Айно": {
        "translit": "ajno",
        "gender": "f",
        "genitive": "Айно",
        "variants": [
            "айно"
        ]
    },
    "Айнур": {
        "translit": "ainur",
        "gender": "m",
        "genitive": "Айнура",
        "variants": [
            "айнур"
        ]
    },
    "Айнура": {
        "translit": "ajnura",
        "gender": "f",
        "genitive": "Айнуры",
        "variants": [
            "айнура"
        ]
    },
    "Айнурлы": {
        "translit": "ajnurly",
        "gender": "f",
        "genitive": "Айнурлы",
        "variants": [
            "айнурлы"
        ]
    },
    "Айпери": {
        "translit": "ajperi",
        "gender": "f",
        "genitive": "Айпери",
        "variants": [
            "айпери"
        ]
    },
    "Айрат": {
        "translit": "ajrat",
        "gender": "m",
        "genitive": "Айрата",
        "variants": [
            "айрат"
        ]
    },
    "Айрис": {
        "translit": "ayris",
        "gender": "m",
        "genitive": "Айриса",
        "variants": [
            "айрис"
        ]
    },
    "Айсауле": {
        "translit": "ajsaule",
        "gender": "f",
        "genitive": "Айсаулы",
        "variants": [
            "айсауле"
        ]
    },
    "Айсель": {
        "translit": "ajsel",
        "gender": "f",
        "genitive": "Айсель",
        "variants": [
            "айсель"
        ]
    },
    "Айсине": {
        "translit": "ajsine",
        "gender": "f",
        "genitive": "Айсины",
        "variants": [
            "айсине"
        ]
    },
    "Айслу": {
        "translit": "ajslu",
        "gender": "f",
        "genitive": "Айслу",
        "variants": [
            "айслу"
        ]
    },
    "Айсу": {
        "translit": "aysu",
        "gender": "f",
        "genitive": "Айсу",
        "variants": [
            "айсу"
        ]
    },
    "Айсултан": {
        "translit": "aysultan",
        "gender": "m",
        "genitive": "Айсултана",
        "variants": [
            "айсултан"
        ]
    },
    "Айсулу": {
        "translit": "ajsulu",
        "gender": "f",
        "genitive": "Айсулы",
        "variants": [
            "айсулу"
        ]
    },
    "Айтадж": {
        "translit": "ajtadzh",
        "gender": "f",
        "genitive": "Айтадж",
        "variants": [
            "айтадж"
        ]
    },
    "Айтак": {
        "translit": "ajtak",
        "gender": "f",
        "genitive": "Айтак",
        "variants": [
            "айтак"
        ]
    },
    "Айтач": {
        "translit": "ajtach",
        "gender": "f",
        "genitive": "Айтач",
        "variants": [
            "айтач"
        ]
    },
    "Айтен": {
        "translit": "ajten",
        "gender": "f",
        "genitive": "Айтен",
        "variants": [
            "айтен"
        ]
    },
    "Айткуль": {
        "translit": "ajtkul",
        "gender": "f",
        "genitive": "Айткули",
        "variants": [
            "айткуль"
        ]
    },
    "Айтурсын": {
        "translit": "ajtursyn",
        "gender": "f",
        "genitive": "Айтурсын",
        "variants": [
            "айтурсын"
        ]
    },
    "Айтханым": {
        "translit": "ajthanym",
        "gender": "f",
        "genitive": "Айтханым",
        "variants": [
            "айтханым"
        ]
    },
    "Айханум": {
        "translit": "ajhanum",
        "gender": "f",
        "genitive": "Айханум",
        "variants": [
            "айханум"
        ]
    },
    "Айша": {
        "translit": "aysha",
        "gender": "f",
        "genitive": "Айши",
        "variants": [
            "айша"
        ]
    },
    "Айшана": {
        "translit": "ajshana",
        "gender": "f",
        "genitive": "Айшаны",
        "variants": [
            "айшана"
        ]
    },
    "Айшат": {
        "translit": "ajshat",
        "gender": "f",
        "genitive": "Айшат",
        "variants": [
            "айшат"
        ]
    },
    "Айшок": {
        "translit": "ajshok",
        "gender": "f",
        "genitive": "Айшок",
        "variants": [
            "айшок"
        ]
    },
    "Айым": {
        "translit": "ajym",
        "gender": "f",
        "genitive": "Айым",
        "variants": [
            "айым"
        ]
    },
    "Айымжан": {
        "translit": "ajymzhan",
        "gender": "f",
        "genitive": "Айымжан",
        "variants": [
            "айымжан"
        ]
    },
    "Акбар": {
        "translit": "akbar",
        "gender": "m",
        "genitive": "Акбара",
        "variants": [
            "акбар",
            "акбарушка",
            "акбарчик"
        ]
    },
    "Акбаян": {
        "translit": "akbayan",
        "gender": "f",
        "genitive": "Акбаян",
        "variants": [
            "акбаян"
        ]
    },
    "Акбота": {
        "translit": "akbota",
        "gender": "f",
        "genitive": "Акботы",
        "variants": [
            "акбота"
        ]
    },
    "Акгуль": {
        "translit": "akgul",
        "gender": "f",
        "genitive": "Акгуль",
        "variants": [
            "акгуль"
        ]
    },
    "Акзия": {
        "translit": "akziya",
        "gender": "f",
        "genitive": "Акзии",
        "variants": [
            "акзия"
        ]
    },
    "Аким": {
        "translit": "akim",
        "gender": "m",
        "genitive": "Акима",
        "variants": [
            "аким",
            "акимушка",
            "акимчик",
            "акиша"
        ]
    },
    "Аклима": {
        "translit": "aklima",
        "gender": "f",
        "genitive": "Аклимы",
        "variants": [
            "аклима"
        ]
    },
    "Акмарал": {
        "translit": "akmaral",
        "gender": "f",
        "genitive": "Акмарал",
        "variants": [
            "акмарал"
        ]
    },
    "Акниет": {
        "translit": "akniet",
        "gender": "f",
        "genitive": "Акниет",
        "variants": [
            "акниет"
        ]
    },
    "Акнур": {
        "translit": "aknur",
        "gender": "f",
        "genitive": "Акнуры",
        "variants": [
            "акнур"
        ]
    },
    "Акоп": {
        "translit": "akop",
        "gender": "m",
        "genitive": "Акопа",
        "variants": [
            "акоп"
        ]
    },
    "Аксана": {
        "translit": "aksana",
        "gender": "f",
        "genitive": "Аксаны",
        "variants": [
            "аксана"
        ]
    },
    "Аксинья": {
        "translit": "aksinya",
        "gender": "f",
        "genitive": "Аксиньи",
        "variants": [
            "аксинья",
            "аксиньечка"
        ]
    },
    "Акслу": {
        "translit": "akslu",
        "gender": "f",
        "genitive": "Акслу",
        "variants": [
            "акслу"
        ]
    },
    "Актеме": {
        "translit": "akteme",
        "gender": "f",
        "genitive": "Актеме",
        "variants": [
            "актеме"
        ]
    },
    "Актолкын": {
        "translit": "aktolkyn",
        "gender": "f",
        "genitive": "Актолкын",
        "variants": [
            "актолкын"
        ]
    },
    "Актоты": {
        "translit": "aktoty",
        "gender": "f",
        "genitive": "Актоты",
        "variants": [
            "актоты"
        ]
    },
    "Алан": {
        "translit": "alan",
        "gender": "m",
        "genitive": "Алана",
        "variants": [
            "алан"
        ]
    },
    "Алана": {
        "translit": "alana",
        "gender": "f",
        "genitive": "Аланы",
        "variants": [
            "алана",
            "Аланочка"
        ]
    },
    "Алания": {
        "translit": "alania",
        "gender": "f",
        "genitive": "Алании",
        "variants": [
            "алания"
        ]
    },
    "Алара": {
        "translit": "alara",
        "gender": "f",
        "genitive": "Алары",
        "variants": [
            "алара"
        ]
    },
    "Аларика": {
        "translit": "alarika",
        "gender": "f",
        "genitive": "Аларики",
        "variants": [
            "аларика"
        ]
    },
    "Алдар": {
        "translit": "ardar",
        "gender": "m",
        "genitive": "Алдара",
        "variants": [
            "алдар"
        ]
    },
    "Алдияр": {
        "translit": "aldiyar",
        "gender": "m",
        "genitive": "Алдияр",
        "variants": [
            "алдияр"
        ]
    },
    "Алевтина": {
        "translit": "alevtina",
        "gender": "f",
        "genitive": "Алевтины",
        "variants": [
            "алевтина",
            "алевтиночка"
        ]
    },
    "Алекс": {
        "translit": "aleks",
        "gender": "m",
        "genitive": "Алекса",
        "variants": [
            "алекс"
        ]
    },
    "Александер": {
        "translit": "aleksander",
        "gender": "m",
        "genitive": "Александера",
        "variants": [
            "александер"
        ]
    },
    "Александр": {
        "translit": "aleksandr",
        "gender": "m",
        "genitive": "Саши",
        "variants": [
            "александр",
            "саня",
            "саша",
            "сашенька",
            "сашуля"
        ]
    },
    "Александра": {
        "translit": "aleksandra",
        "gender": "f",
        "genitive": "Саши",
        "variants": [
            "александра",
            "саня",
            "саша",
            "сашенька",
            "сашуля",
            "сашута",
            "шура"
        ]
    },
    "Александрина": {
        "translit": "alexandrina",
        "gender": "f",
        "genitive": "Александрины",
        "variants": [
            "александрина"
        ]
    },
    "Алессандро": {
        "translit": "alessandro",
        "gender": "m",
        "genitive": "Аллесандро",
        "variants": [
            "алессандро"
        ]
    },
    "Алеся": {
        "translit": "alesya",
        "gender": "f",
        "genitive": "Алеси",
        "variants": [
            "алеся"
        ]
    },
    "Алета": {
        "translit": "aleta",
        "gender": "f",
        "genitive": "Алеты",
        "variants": [
            "алета"
        ]
    },
    "Алефтина": {
        "translit": "aleftina",
        "gender": "f",
        "genitive": "Алефтины",
        "variants": [
            "алефтина"
        ]
    },
    "Али": {
        "translit": "ali",
        "gender": "m",
        "genitive": "Али",
        "variants": [
            "али"
        ]
    },
    "Алие": {
        "translit": "alie",
        "gender": "f",
        "genitive": "Алии",
        "variants": [
            "алие"
        ]
    },
    "Алик": {
        "translit": "alik",
        "gender": "m",
        "genitive": "Алика",
        "variants": [
            "алик"
        ]
    },
    "Алика": {
        "translit": "alika",
        "gender": "f",
        "genitive": "Алики",
        "variants": [
            "алика"
        ]
    },
    "Алим": {
        "translit": "alim",
        "gender": "m",
        "genitive": "Алима",
        "variants": [
            "алим"
        ]
    },
    "Алима": {
        "translit": "alima",
        "gender": "f",
        "genitive": "Алимы",
        "variants": [
            "алима"
        ]
    },
    "Алимпия": {
        "translit": "alimpiya",
        "gender": "f",
        "genitive": "Алимпии",
        "variants": [
            "алимпия"
        ]
    },
    "Алина": {
        "translit": "alina",
        "gender": "f",
        "genitive": "Алины",
        "variants": [
            "алина",
            "алиночка",
            "алиша"
        ]
    },
    "Алинда": {
        "translit": "alinda",
        "gender": "f",
        "genitive": "Алинды",
        "variants": [
            "алинда"
        ]
    },
    "Алинур": {
        "translit": "alinur",
        "gender": "m",
        "genitive": "Алинура",
        "variants": [
            "алинур"
        ]
    },
    "Алиса": {
        "translit": "alisa",
        "gender": "f",
        "genitive": "Алисы",
        "variants": [
            "алиса",
            "алечка",
            "алисанька",
            "алисонька",
            "алисочка",
            "лисена"
        ]
    },
    "Алисия": {
        "translit": "alisiya",
        "gender": "f",
        "genitive": "Алисии",
        "variants": [
            "алисия"
        ]
    },
    "Алихан": {
        "translit": "alihan",
        "gender": "m",
        "genitive": "Алихана",
        "variants": [
            "алихан"
        ]
    },
    "Алиция": {
        "translit": "aliciya",
        "gender": "f",
        "genitive": "Алиции",
        "variants": [
            "алиция"
        ]
    },
    "Алишер": {
        "translit": "alisher",
        "gender": "m",
        "genitive": "Алишера",
        "variants": [
            "алишер"
        ]
    },
    "Алия": {
        "translit": "aliya",
        "gender": "f",
        "genitive": "Алии",
        "variants": [
            "алия"
        ]
    },
    "Алла": {
        "translit": "alla",
        "gender": "f",
        "genitive": "Аллы",
        "variants": [
            "алла",
            "аленка",
            "аллочка",
            "аля"
        ]
    },
    "Алма": {
        "translit": "alma",
        "gender": "f",
        "genitive": "Алмы",
        "variants": [
            "алма"
        ]
    },
    "Алмаз": {
        "translit": "almaz",
        "gender": "m",
        "genitive": "Алмаза",
        "variants": [
            "алмаз"
        ]
    },
    "Алсу": {
        "translit": "alsu",
        "gender": "f",
        "genitive": "Алсу",
        "variants": [
            "алсу"
        ]
    },
    "Алтын": {
        "translit": "altyn",
        "gender": "f",
        "genitive": "Алтын",
        "variants": [
            "алтын"
        ]
    },
    "Алтынай": {
        "translit": "altynaj",
        "gender": "f",
        "genitive": "Алтынай",
        "variants": [
            "алтынай"
        ]
    },
    "Алуа": {
        "translit": "alua",
        "gender": "f",
        "genitive": "Алуа",
        "variants": [
            "алуа"
        ]
    },
    "Альберт": {
        "translit": "albert",
        "gender": "m",
        "genitive": "Альберта",
        "variants": [
            "альберт",
            "алик",
            "альбертик",
            "альбертушка"
        ]
    },
    "Альбина": {
        "translit": "albina",
        "gender": "f",
        "genitive": "Альбины",
        "variants": [
            "альбина",
            "альбиночка"
        ]
    },
    "Альвина": {
        "translit": "alvina",
        "gender": "f",
        "genitive": "Альвины",
        "variants": [
            "альвина"
        ]
    },
    "Альмира": {
        "translit": "almira",
        "gender": "f",
        "genitive": "Альмиры",
        "variants": [
            "альмира"
        ]
    },
    "Альп": {
        "translit": "alp",
        "gender": "m",
        "genitive": "Альпа",
        "variants": [
            "альп"
        ]
    },
    "Альпаслан": {
        "translit": "alpaslan",
        "gender": "m",
        "genitive": "Альпаслана",
        "variants": [
            "альпаслан"
        ]
    },
    "Альтея": {
        "translit": "alteya",
        "gender": "f",
        "genitive": "Альтеи",
        "variants": [
            "альтея"
        ]
    },
    "Альфина": {
        "translit": "alfina",
        "gender": "f",
        "genitive": "Альфины",
        "variants": [
            "альфина"
        ]
    },
    "Альфия": {
        "translit": "alfiya",
        "gender": "f",
        "genitive": "Альфии",
        "variants": [
            "альфия"
        ]
    },
    "Альфред": {
        "translit": "alfred",
        "gender": "m",
        "genitive": "Альфреда",
        "variants": [
            "альфред"
        ]
    },
    "Альюна": {
        "translit": "alyuna",
        "gender": "f",
        "genitive": "Альюны",
        "variants": [
            "альюна"
        ]
    },
    "Алёна": {
        "translit": "alyona",
        "gender": "f",
        "genitive": "Алёны",
        "variants": [
            "алёна",
            "аленка",
            "аленочка",
            "аленушка",
            "алечка",
            "алиша",
            "оля"
        ]
    },
    "Амалик": {
        "translit": "amalik",
        "gender": "f",
        "genitive": "Амалик",
        "variants": [
            "амалик"
        ]
    },
    "Амалия": {
        "translit": "amaliya",
        "gender": "f",
        "genitive": "Амалии",
        "variants": [
            "амалия"
        ]
    },
    "Амелия": {
        "translit": "ameliya",
        "gender": "f",
        "genitive": "Амелии",
        "variants": [
            "амелия"
        ]
    },
    "Амиде": {
        "translit": "amide",
        "gender": "f",
        "genitive": "Амиды",
        "variants": [
            "амиде"
        ]
    },
    "Амилия": {
        "translit": "amiliya",
        "gender": "f",
        "genitive": "Амилии",
        "variants": [
            "амилия"
        ]
    },
    "Амиль": {
        "translit": "amil",
        "gender": "m",
        "genitive": "Амиля",
        "variants": [
            "амиль"
        ]
    },
    "Амин": {
        "translit": "amin",
        "gender": "m",
        "genitive": "Амина",
        "variants": [
            "амин"
        ]
    },
    "Амина": {
        "translit": "amina",
        "gender": "f",
        "genitive": "Амины",
        "variants": [
            "амина",
            "аминка",
            "аминочка",
            "амиша"
        ]
    },
    "Аминат": {
        "translit": "aminat",
        "gender": "f",
        "genitive": "Аминат",
        "variants": [
            "аминат"
        ]
    },
    "Амир": {
        "translit": "amir",
        "gender": "m",
        "genitive": "Амира",
        "variants": [
            "амир"
        ]
    },
    "Амира": {
        "translit": "amira",
        "gender": "f",
        "genitive": "Амиры",
        "variants": [
            "амира",
            "амирочка"
        ]
    },
    "Амирхан": {
        "translit": "amirhan",
        "gender": "m",
        "genitive": "Амирхана",
        "variants": [
            "амирхан"
        ]
    },
    "Ана": {
        "translit": "ana",
        "gender": "f",
        "genitive": "Аны",
        "variants": [
            "ана"
        ]
    },
    "Анаит": {
        "translit": "anait",
        "gender": "f",
        "genitive": "Анаит",
        "variants": [
            "анаит"
        ]
    },
    "Анар": {
        "translit": "anar",
        "gender": "m",
        "genitive": "Анар",
        "variants": [
            "анар"
        ]
    },
    "Анара": {
        "translit": "anara",
        "gender": "f",
        "genitive": "Анары",
        "variants": [
            "анара"
        ]
    },
    "Анастасия": {
        "translit": "anastasiya",
        "gender": "f",
        "genitive": "Анастасии",
        "variants": [
            "анастасия"
        ]
    },
    "Анашым": {
        "translit": "anashym",
        "gender": "f",
        "genitive": "Анашым",
        "variants": [
            "анашым"
        ]
    },
    "Анвар": {
        "translit": "anvar",
        "gender": "m",
        "genitive": "Анвара",
        "variants": [
            "анвар"
        ]
    },
    "Ангела": {
        "translit": "angela",
        "gender": "f",
        "genitive": "Ангелы",
        "variants": [
            "ангела"
        ]
    },
    "Ангелина": {
        "translit": "angelina",
        "gender": "f",
        "genitive": "Ангелины",
        "variants": [
            "ангелина",
            "ангелиночка",
            "геля"
        ]
    },
    "Андраник": {
        "translit": "andranik",
        "gender": "m",
        "genitive": "Андраника",
        "variants": [
            "андраник"
        ]
    },
    "Андрей": {
        "translit": "andrej",
        "gender": "m",
        "genitive": "Андрея",
        "variants": [
            "андрей",
            "андрюша",
            "андрюшенька"
        ]
    },
    "Андрес": {
        "translit": "andres",
        "gender": "m",
        "genitive": "Андреса",
        "variants": [
            "андрес"
        ]
    },
    "Андриан": {
        "translit": "andrian",
        "gender": "m",
        "genitive": "Андриана",
        "variants": [
            "андриан"
        ]
    },
    "Андриана": {
        "translit": "andriana",
        "gender": "f",
        "genitive": "Андрианы",
        "variants": [
            "андриана",
            "андрианочка"
        ]
    },
    "Анелия": {
        "translit": "aneliya",
        "gender": "f",
        "genitive": "Анелии",
        "variants": [
            "анелия"
        ]
    },
    "Анель": {
        "translit": "anel",
        "gender": "f",
        "genitive": "Анель",
        "variants": [
            "анель"
        ]
    },
    "Анжела": {
        "translit": "anzhela",
        "gender": "f",
        "genitive": "Анжелы",
        "variants": [
            "анжела",
            "анжелочка"
        ]
    },
    "Анжелика": {
        "translit": "anzhelika",
        "gender": "f",
        "genitive": "Анжелики",
        "variants": [
            "анжелика"
        ]
    },
    "Анжелина": {
        "translit": "anzhelina",
        "gender": "f",
        "genitive": "Анжелины",
        "variants": [
            "анжелина"
        ]
    },
    "Ани": {
        "translit": "ani",
        "gender": "f",
        "genitive": "Ани",
        "variants": [
            "ани"
        ]
    },
    "Аниель": {
        "translit": "aniel",
        "gender": "f",
        "genitive": "Аниель",
        "variants": [
            "аниель"
        ]
    },
    "Аникай": {
        "translit": "anikaj",
        "gender": "f",
        "genitive": "Аникай",
        "variants": [
            "аникай"
        ]
    },
    "Аникам": {
        "translit": "anikam",
        "gender": "f",
        "genitive": "Аникам",
        "variants": [
            "аникам"
        ]
    },
    "Анис": {
        "translit": "anis",
        "gender": "m",
        "genitive": "Аниса",
        "variants": [
            "анис"
        ]
    },
    "Аниса": {
        "translit": "anisa",
        "gender": "f",
        "genitive": "Анисы",
        "variants": [
            "аниса"
        ]
    },
    "Анисим": {
        "translit": "anisim",
        "gender": "m",
        "genitive": "Анисима",
        "variants": [
            "анисим",
            "анисимушка",
            "анисимчик"
        ]
    },
    "Анисия": {
        "translit": "anisiya",
        "gender": "f",
        "genitive": "Анисии",
        "variants": [
            "анисия"
        ]
    },
    "Анита": {
        "translit": "anita",
        "gender": "f",
        "genitive": "Аниты",
        "variants": [
            "анита",
            "аниточка"
        ]
    },
    "Ания": {
        "translit": "aniya",
        "gender": "f",
        "genitive": "Ании",
        "variants": [
            "ания"
        ]
    },
    "Анна": {
        "translit": "anna",
        "gender": "f",
        "genitive": "Анны",
        "variants": [
            "анна"
        ]
    },
    "Анна-Мария": {
        "translit": "anna-mariya",
        "gender": "f",
        "genitive": "Анны-Марии",
        "variants": [
            "анна-мария"
        ]
    },
    "Аннели": {
        "translit": "anneli",
        "gender": "f",
        "genitive": "Аннели",
        "variants": [
            "аннели"
        ]
    },
    "Анрета": {
        "translit": "anreta",
        "gender": "f",
        "genitive": "Анреты",
        "variants": [
            "анрета"
        ]
    },
    "Ансаган": {
        "translit": "ansagan",
        "gender": "f",
        "genitive": "Ансаган",
        "variants": [
            "ансаган"
        ]
    },
    "Ансар": {
        "translit": "ansar",
        "gender": "m",
        "genitive": "Ансара",
        "variants": [
            "ансар"
        ]
    },
    "Антон": {
        "translit": "anton",
        "gender": "m",
        "genitive": "Антона",
        "variants": [
            "антон",
            "антоша",
            "антошенька",
            "антошка",
            "тоха",
            "тоша",
            "тошенька"
        ]
    },
    "Антонида": {
        "translit": "antonida",
        "gender": "f",
        "genitive": "Антониды",
        "variants": [
            "антонида"
        ]
    },
    "Антонина": {
        "translit": "antonina",
        "gender": "f",
        "genitive": "Антонины",
        "variants": [
            "антонина",
            "антониночка",
            "тоня"
        ]
    },
    "Ануш": {
        "translit": "anush",
        "gender": "f",
        "genitive": "Ануш",
        "variants": [
            "ануш"
        ]
    },
    "Анфиса": {
        "translit": "anfisa",
        "gender": "f",
        "genitive": "Анфисы",
        "variants": [
            "анфиса",
            "анфисочка"
        ]
    },
    "Аня": {
        "translit": "anya",
        "gender": "f",
        "genitive": "Ани",
        "variants": [
            "аня",
            "анечка",
            "анна",
            "анюта"
        ]
    },
    "Апам": {
        "translit": "apam",
        "gender": "f",
        "genitive": "Апам",
        "variants": [
            "апам"
        ]
    },
    "Аполлинария": {
        "translit": "apollinariya",
        "gender": "f",
        "genitive": "Аполлинарии",
        "variants": [
            "аполлинария",
            "полина"
        ]
    },
    "Апполинарий": {
        "translit": "appolinarij",
        "gender": "m",
        "genitive": "Апполинария",
        "variants": [
            "апполинарий"
        ]
    },
    "Арай": {
        "translit": "araj",
        "gender": "f",
        "genitive": "Арай",
        "variants": [
            "арай"
        ]
    },
    "Арайка": {
        "translit": "arajka",
        "gender": "f",
        "genitive": "Арайки",
        "variants": [
            "арайка"
        ]
    },
    "Арайлым": {
        "translit": "arajlym",
        "gender": "f",
        "genitive": "Арайлым",
        "variants": [
            "арайлым"
        ]
    },
    "Аракся": {
        "translit": "araksya",
        "gender": "f",
        "genitive": "Араксы",
        "variants": [
            "аракся"
        ]
    },
    "Арам": {
        "translit": "aram",
        "gender": "m",
        "genitive": "Арама",
        "variants": [
            "арам"
        ]
    },
    "Ардана": {
        "translit": "ardana",
        "gender": "f",
        "genitive": "Арданы",
        "variants": [
            "ардана"
        ]
    },
    "Аревик": {
        "translit": "arevik",
        "gender": "f",
        "genitive": "Аревик",
        "variants": [
            "аревик"
        ]
    },
    "Арен": {
        "translit": "aren",
        "gender": "m",
        "genitive": "Арена",
        "variants": [
            "арен"
        ]
    },
    "Арзу": {
        "translit": "arzy",
        "gender": "f",
        "genitive": "Арзу",
        "variants": [
            "арзу"
        ]
    },
    "Ариадна": {
        "translit": "ariadna",
        "gender": "f",
        "genitive": "Ариадны",
        "variants": [
            "ариадна"
        ]
    },
    "Ариана": {
        "translit": "ariana",
        "gender": "f",
        "genitive": "Арианы",
        "variants": [
            "ариана",
            "арианочка"
        ]
    },
    "Арианна": {
        "translit": "arianna",
        "gender": "f",
        "genitive": "Арианны",
        "variants": [
            "арианна",
            "Арианочка"
        ]
    },
    "Арина": {
        "translit": "arina",
        "gender": "f",
        "genitive": "Арины",
        "variants": [
            "арина",
            "ариночка",
            "ариша"
        ]
    },
    "Арифметикон": {
        "translit": "arifmetikon",
        "gender": "m",
        "genitive": "Арифметикона",
        "variants": [
            "арифметикон"
        ]
    },
    "Ариэла": {
        "translit": "ariela",
        "gender": "f",
        "genitive": "Ариэлы",
        "variants": [
            "ариэла"
        ]
    },
    "Ариэль": {
        "translit": "ariel",
        "gender": "f",
        "genitive": "Ариэль",
        "variants": [
            "ариэль"
        ]
    },
    "Ария": {
        "translit": "ariya",
        "gender": "f",
        "genitive": "Арии",
        "variants": [
            "ария"
        ]
    },
    "Аркадий": {
        "translit": "arkadij",
        "gender": "m",
        "genitive": "Аркадия",
        "variants": [
            "аркадий",
            "аркаша",
            "аркашенька"
        ]
    },
    "Арлан": {
        "translit": "arlan",
        "gender": "m",
        "genitive": "Арлана",
        "variants": [
            "арлан"
        ]
    },
    "Арман": {
        "translit": "arman",
        "gender": "m",
        "genitive": "Армана",
        "variants": [
            "арман"
        ]
    },
    "Армен": {
        "translit": "armen",
        "gender": "m",
        "genitive": "Армена",
        "variants": [
            "армен",
            "арменушка",
            "арменчик"
        ]
    },
    "Арменуи": {
        "translit": "armenui",
        "gender": "f",
        "genitive": "Арменуи",
        "variants": [
            "арменуи"
        ]
    },
    "Арминэ": {
        "translit": "armine",
        "gender": "f",
        "genitive": "Арминэ",
        "variants": [
            "арминэ"
        ]
    },
    "Арнольд": {
        "translit": "arnold",
        "gender": "m",
        "genitive": "Арнольда",
        "variants": [
            "арнольд",
            "арнольдик",
            "арнольдушка"
        ]
    },
    "Арон": {
        "translit": "aron",
        "gender": "m",
        "genitive": "Арона",
        "variants": [
            "арон"
        ]
    },
    "Арсен": {
        "translit": "arsen",
        "gender": "m",
        "genitive": "Арсена",
        "variants": [
            "арсен",
            "арсенчик",
            "арсик"
        ]
    },
    "Арсений": {
        "translit": "arsenij",
        "gender": "m",
        "genitive": "Арсения",
        "variants": [
            "арсений",
            "арсеньчик",
            "арсенюшка",
            "арсюша",
            "сенечка",
            "сеня"
        ]
    },
    "Арсения": {
        "translit": "arseniya",
        "gender": "f",
        "genitive": "Арсении",
        "variants": [
            "арсения"
        ]
    },
    "Арслан": {
        "translit": "arslan",
        "gender": "m",
        "genitive": "Арслана",
        "variants": [
            "арслан"
        ]
    },
    "Артемий": {
        "translit": "artemij",
        "gender": "m",
        "genitive": "Артемия",
        "variants": [
            "артемий"
        ]
    },
    "Артур": {
        "translit": "artur",
        "gender": "m",
        "genitive": "Артура",
        "variants": [
            "артур",
            "артурка",
            "артурчик",
            "артюшенька"
        ]
    },
    "Артём": {
        "translit": "artyom",
        "gender": "m",
        "genitive": "Артёма",
        "variants": [
            "артём",
            "артемий",
            "артемка",
            "артемушка",
            "артемчик"
        ]
    },
    "Аружан": {
        "translit": "aruzhan",
        "gender": "f",
        "genitive": "Аружан",
        "variants": [
            "аружан"
        ]
    },
    "Архип": {
        "translit": "arhip",
        "gender": "m",
        "genitive": "Архипа",
        "variants": [
            "архип",
            "архипка",
            "архипушка",
            "архипчик"
        ]
    },
    "Арыймаа": {
        "translit": "aryjmaa",
        "gender": "f",
        "genitive": "Арыймаа",
        "variants": [
            "арыймаа"
        ]
    },
    "Арюна": {
        "translit": "aryuna",
        "gender": "f",
        "genitive": "Арюны",
        "variants": [
            "арюна"
        ]
    },
    "Асаль": {
        "translit": "asal",
        "gender": "f",
        "genitive": "Асаль",
        "variants": [
            "асаль"
        ]
    },
    "Асель": {
        "translit": "asel",
        "gender": "f",
        "genitive": "Асель",
        "variants": [
            "асель"
        ]
    },
    "Асем": {
        "translit": "asem",
        "gender": "f",
        "genitive": "Асем",
        "variants": [
            "асем"
        ]
    },
    "Асия": {
        "translit": "asia",
        "gender": "f",
        "genitive": "Асии",
        "variants": [
            "асия"
        ]
    },
    "Аскар": {
        "translit": "askar",
        "gender": "m",
        "genitive": "Аскара",
        "variants": [
            "аскар"
        ]
    },
    "Аскольд": {
        "translit": "askold",
        "gender": "m",
        "genitive": "Аскольда",
        "variants": [
            "аскольд",
            "аскольдик",
            "аскольдушка"
        ]
    },
    "Аслан": {
        "translit": "aslan",
        "gender": "m",
        "genitive": "Аслана",
        "variants": [
            "аслан",
            "асланушка",
            "асланчик"
        ]
    },
    "Ассель": {
        "translit": "assel",
        "gender": "f",
        "genitive": "Ассель",
        "variants": [
            "ассель"
        ]
    },
    "Ассима": {
        "translit": "assima",
        "gender": "f",
        "genitive": "Ассимы",
        "variants": [
            "ассима"
        ]
    },
    "Аста": {
        "translit": "asta",
        "gender": "f",
        "genitive": "Аста",
        "variants": [
            "аста"
        ]
    },
    "Ася": {
        "translit": "asya",
        "gender": "f",
        "genitive": "Аси",
        "variants": [
            "ася",
            "асечка"
        ]
    },
    "Атиркуль": {
        "translit": "atirkul",
        "gender": "f",
        "genitive": "Атиркуль",
        "variants": [
            "атиркуль"
        ]
    },
    "Аурелия": {
        "translit": "aureliya",
        "gender": "f",
        "genitive": "Аурелии",
        "variants": [
            "аурелия"
        ]
    },
    "Аурика": {
        "translit": "aurika",
        "gender": "f",
        "genitive": "Аурики",
        "variants": [
            "аурика"
        ]
    },
    "Аушра": {
        "translit": "aushra",
        "gender": "f",
        "genitive": "Аушры",
        "variants": [
            "аушра"
        ]
    },
    "Афак": {
        "translit": "afak",
        "gender": "f",
        "genitive": "Афак",
        "variants": [
            "афак"
        ]
    },
    "Афанасий": {
        "translit": "afanasij",
        "gender": "m",
        "genitive": "Афанасия",
        "variants": [
            "афанасий",
            "афанасьюшка",
            "афанася",
            "фаня"
        ]
    },
    "Афанасия": {
        "translit": "afanasiya",
        "gender": "f",
        "genitive": "Афанасии",
        "variants": [
            "афанасия",
            "анфисочка",
            "афоня"
        ]
    },
    "Афина": {
        "translit": "afina",
        "gender": "f",
        "genitive": "Афины",
        "variants": [
            "афина"
        ]
    },
    "Ахмад": {
        "translit": "ahmad",
        "gender": "m",
        "genitive": "Ахмеда",
        "variants": [
            "ахмад",
            "ахмадик",
            "ахмадушка"
        ]
    },
    "Ахмед": {
        "translit": "akhmed",
        "gender": "m",
        "genitive": "Ахмеда",
        "variants": [
            "ахмед"
        ]
    },
    "Ашот": {
        "translit": "ashot",
        "gender": "m",
        "genitive": "Ашота",
        "variants": [
            "ашот",
            "ашотик",
            "ашотушка"
        ]
    },
    "Ашхен": {
        "translit": "ashhen",
        "gender": "m",
        "genitive": "Ашхена",
        "variants": [
            "ашхен"
        ]
    },
    "Аэлита": {
        "translit": "aelita",
        "gender": "f",
        "genitive": "Аэлиты",
        "variants": [
            "аэлита"
        ]
    },
    "Аюка": {
        "translit": "ayuka",
        "gender": "m",
        "genitive": "Аюки",
        "variants": [
            "аюка"
        ]
    },
    "Ая": {
        "translit": "aya",
        "gender": "f",
        "genitive": "Аи",
        "variants": [
            "ая"
        ]
    },
    "Аягоз": {
        "translit": "ayagoz",
        "gender": "f",
        "genitive": "Аягоз",
        "variants": [
            "аягоз"
        ]
    },
    "Аягуль": {
        "translit": "ayagul",
        "gender": "f",
        "genitive": "Аягуль",
        "variants": [
            "аягуль"
        ]
    },
    "Аяна": {
        "translit": "ayana",
        "gender": "f",
        "genitive": "Аяны",
        "variants": [
            "аяна"
        ]
    },
    "Аяулым": {
        "translit": "ayaulym",
        "gender": "f",
        "genitive": "Аяулым",
        "variants": [
            "аяулым"
        ]
    },
    "Аячонам": {
        "translit": "ayachonam",
        "gender": "f",
        "genitive": "Аячонам",
        "variants": [
            "аячонам"
        ]
    },
    "Бабушка": {
        "translit": "babushka",
        "gender": "f",
        "genitive": "Бабушки",
        "variants": [
            "бабушка"
        ]
    },
    "Багила": {
        "translit": "bagila",
        "gender": "f",
        "genitive": "Багилы",
        "variants": [
            "багила"
        ]
    },
    "Баглан": {
        "translit": "baglan",
        "gender": "f",
        "genitive": "Багланы",
        "variants": [
            "баглан"
        ]
    },
    "Бадри": {
        "translit": "badri",
        "gender": "m",
        "genitive": "Бадри",
        "variants": [
            "бадри"
        ]
    },
    "Бажена": {
        "translit": "bazhena",
        "gender": "f",
        "genitive": "Бажены",
        "variants": [
            "бажена",
            "боженочка"
        ]
    },
    "Баирма": {
        "translit": "bairma",
        "gender": "f",
        "genitive": "Баирмы",
        "variants": [
            "баирма"
        ]
    },
    "Байсари": {
        "translit": "bajsari",
        "gender": "f",
        "genitive": "Байсари",
        "variants": [
            "байсари"
        ]
    },
    "Бактыгуль": {
        "translit": "baktygul",
        "gender": "f",
        "genitive": "Бактыгуль",
        "variants": [
            "бактыгуль"
        ]
    },
    "Бакыт": {
        "translit": "bakyt",
        "gender": "f",
        "genitive": "Бакыт",
        "variants": [
            "бакыт"
        ]
    },
    "Балдай": {
        "translit": "baldaj",
        "gender": "f",
        "genitive": "Балдай",
        "variants": [
            "балдай"
        ]
    },
    "Балзила": {
        "translit": "balzila",
        "gender": "f",
        "genitive": "Балзилы",
        "variants": [
            "балзила"
        ]
    },
    "Балнур": {
        "translit": "balnur",
        "gender": "f",
        "genitive": "Балнур",
        "variants": [
            "балнур"
        ]
    },
    "Барби": {
        "translit": "barbi",
        "gender": "f",
        "genitive": "Барби",
        "variants": [
            "барби"
        ]
    },
    "Барно": {
        "translit": "barno",
        "gender": "f",
        "genitive": "Барно",
        "variants": [
            "барно"
        ]
    },
    "Басти": {
        "translit": "basti",
        "gender": "f",
        "genitive": "Басти",
        "variants": [
            "басти"
        ]
    },
    "Батыр": {
        "translit": "batyr",
        "gender": "m",
        "genitive": "Батыра",
        "variants": [
            "батыр",
            "батырбек",
            "батырушка",
            "батырхан"
        ]
    },
    "Бахар": {
        "translit": "bahar",
        "gender": "f",
        "genitive": "Бахар",
        "variants": [
            "бахар"
        ]
    },
    "Бахиткуль": {
        "translit": "bahitkul",
        "gender": "f",
        "genitive": "Бахиткуль",
        "variants": [
            "бахиткуль"
        ]
    },
    "Бахора": {
        "translit": "bahora",
        "gender": "f",
        "genitive": "Бахоры",
        "variants": [
            "бахора"
        ]
    },
    "Бахыт": {
        "translit": "bahyt",
        "gender": "f",
        "genitive": "Бахыт",
        "variants": [
            "бахыт"
        ]
    },
    "Баян": {
        "translit": "bayan",
        "gender": "f",
        "genitive": "Баян",
        "variants": [
            "баян"
        ]
    },
    "Беата": {
        "translit": "beata",
        "gender": "f",
        "genitive": "Беаты",
        "variants": [
            "беата",
            "беаточка"
        ]
    },
    "Беатриса": {
        "translit": "beatrisa",
        "gender": "f",
        "genitive": "Беатрисы",
        "variants": [
            "беатриса",
            "беатрисочка"
        ]
    },
    "Бегимай": {
        "translit": "begimaj",
        "gender": "f",
        "genitive": "Бегимай",
        "variants": [
            "бегимай"
        ]
    },
    "Бейнегуль": {
        "translit": "bejnegul",
        "gender": "f",
        "genitive": "Бейнегуль",
        "variants": [
            "бейнегуль"
        ]
    },
    "Бекзада": {
        "translit": "bekzada",
        "gender": "f",
        "genitive": "Бекзады",
        "variants": [
            "бекзада"
        ]
    },
    "Бекзат": {
        "translit": "bekzat",
        "gender": "f",
        "genitive": "Бекзат",
        "variants": [
            "бекзат"
        ]
    },
    "Бекзод": {
        "translit": "bekzod",
        "gender": "m",
        "genitive": "Бекзода",
        "variants": [
            "бекзод"
        ]
    },
    "Бекки": {
        "translit": "bekki",
        "gender": "f",
        "genitive": "Бекки",
        "variants": [
            "бекки",
            "Беки"
        ]
    },
    "Бела": {
        "translit": "beela",
        "gender": "f",
        "genitive": "Белы",
        "variants": [
            "бела",
            "белочка"
        ]
    },
    "Белла": {
        "translit": "bellka",
        "gender": "f",
        "genitive": "Беллы",
        "variants": [
            "белла"
        ]
    },
    "Бикатайка": {
        "translit": "bikatajka",
        "gender": "f",
        "genitive": "Бикатайки",
        "variants": [
            "бикатайка"
        ]
    },
    "Билл": {
        "translit": "bill",
        "gender": "m",
        "genitive": "Билла",
        "variants": [
            "билл"
        ]
    },
    "Богатоз": {
        "translit": "bogatoz",
        "gender": "f",
        "genitive": "Богатоз",
        "variants": [
            "богатоз"
        ]
    },
    "Богдан": {
        "translit": "bogdan",
        "gender": "m",
        "genitive": "Богдана",
        "variants": [
            "богдан",
            "богданчик",
            "богдаша"
        ]
    },
    "Богдана": {
        "translit": "bogdana",
        "gender": "f",
        "genitive": "Богданы",
        "variants": [
            "богдана",
            "богданочка"
        ]
    },
    "Божена": {
        "translit": "bozhena",
        "gender": "f",
        "genitive": "Божены",
        "variants": [
            "божена"
        ]
    },
    "Борислав": {
        "translit": "borislav",
        "gender": "m",
        "genitive": "Борислава",
        "variants": [
            "борислав",
            "бориславушка",
            "бориславчик"
        ]
    },
    "Борислава": {
        "translit": "borislava",
        "gender": "f",
        "genitive": "Бориславы",
        "variants": [
            "борислава"
        ]
    },
    "Боря": {
        "translit": "borya",
        "gender": "m",
        "genitive": "Бори",
        "variants": [
            "боря",
            "боренька",
            "боречка",
            "борис",
            "бориска",
            "борюня",
            "борюшка"
        ]
    },
    "Бота": {
        "translit": "bota",
        "gender": "f",
        "genitive": "Боты",
        "variants": [
            "бота"
        ]
    },
    "Ботагез": {
        "translit": "botagez",
        "gender": "f",
        "genitive": "Ботагез",
        "variants": [
            "ботагез"
        ]
    },
    "Ботагоз": {
        "translit": "botagoz",
        "gender": "f",
        "genitive": "Ботагоз",
        "variants": [
            "ботагоз"
        ]
    },
    "Ботакез": {
        "translit": "botakez",
        "gender": "f",
        "genitive": "Ботакез",
        "variants": [
            "ботакез"
        ]
    },
    "Булат": {
        "translit": "bulat",
        "gender": "m",
        "genitive": "Булата",
        "variants": [
            "булат"
        ]
    },
    "Бэла": {
        "translit": "bela",
        "gender": "f",
        "genitive": "Бэлы",
        "variants": [
            "бэла"
        ]
    },
    "Бэлигма": {
        "translit": "beligma",
        "gender": "f",
        "genitive": "Бэлигмы",
        "variants": [
            "бэлигма"
        ]
    },
    "Бэлла": {
        "translit": "bella",
        "gender": "f",
        "genitive": "Бэллы",
        "variants": [
            "бэлла"
        ]
    },
    "Бэтти": {
        "translit": "betty",
        "gender": "f",
        "genitive": "Бэтти",
        "variants": [
            "бэтти"
        ]
    },
    "Бягуль": {
        "translit": "byagul",
        "gender": "f",
        "genitive": "Бягуль",
        "variants": [
            "бягуль"
        ]
    },
    "Вадим": {
        "translit": "vadim",
        "gender": "m",
        "genitive": "Вадима",
        "variants": [
            "вадим",
            "вадик",
            "вадимка",
            "вадимочка",
            "вадимчик"
        ]
    },
    "Вазген": {
        "translit": "vazgen",
        "gender": "m",
        "genitive": "Вазгена",
        "variants": [
            "вазген"
        ]
    },
    "Валентин": {
        "translit": "valentin",
        "gender": "m",
        "genitive": "Вали",
        "variants": [
            "валентин",
            "валентинка",
            "валенька",
            "валюнчик",
            "валюня",
            "валюша",
            "валя"
        ]
    },
    "Валентина": {
        "translit": "valentina",
        "gender": "f",
        "genitive": "Валентины",
        "variants": [
            "валентина",
            "валюша",
            "валя"
        ]
    },
    "Валерий": {
        "translit": "valerij",
        "gender": "m",
        "genitive": "Валерия",
        "variants": [
            "валерий",
            "валера",
            "валерочка",
            "валерчик",
            "валюша"
        ]
    },
    "Валерия": {
        "translit": "valeriya",
        "gender": "f",
        "genitive": "Валерии",
        "variants": [
            "валерия"
        ]
    },
    "Валида": {
        "translit": "valida",
        "gender": "f",
        "genitive": "Валиды",
        "variants": [
            "валида"
        ]
    },
    "Ванда": {
        "translit": "vanda",
        "gender": "f",
        "genitive": "Ванды",
        "variants": [
            "ванда"
        ]
    },
    "Ваня": {
        "translit": "vanya",
        "gender": "m",
        "genitive": "Вани",
        "variants": [
            "ваня",
            "ванечка",
            "ванюша",
            "иван",
            "иванушка",
            "ивасик",
            "иваша"
        ]
    },
    "Варвара": {
        "translit": "varvara",
        "gender": "f",
        "genitive": "Варвары",
        "variants": [
            "варвара",
            "варварочка",
            "варечка",
            "варюня",
            "варюша"
        ]
    },
    "Варя": {
        "translit": "varya",
        "gender": "f",
        "genitive": "Вари",
        "variants": [
            "варя"
        ]
    },
    "Василина": {
        "translit": "vasilina",
        "gender": "f",
        "genitive": "Василины",
        "variants": [
            "василина",
            "васена",
            "васечка",
            "васеша",
            "василиночка",
            "василинушка",
            "вася"
        ]
    },
    "Василиса": {
        "translit": "vasilisa",
        "gender": "f",
        "genitive": "Василисы",
        "variants": [
            "василиса",
            "васенька",
            "васечка",
            "василисочка"
        ]
    },
    "Василя": {
        "translit": "vasilya",
        "gender": "f",
        "genitive": "Василя",
        "variants": [
            "василя"
        ]
    },
    "Васса": {
        "translit": "vassa",
        "gender": "f",
        "genitive": "Вассы",
        "variants": [
            "васса"
        ]
    },
    "Вася": {
        "translit": "vasya",
        "gender": "m",
        "genitive": "Васи",
        "variants": [
            "вася",
            "васенька",
            "васечка",
            "василий",
            "васюня"
        ]
    },
    "Вацлав": {
        "translit": "vaczlav",
        "gender": "m",
        "genitive": "Вацлава",
        "variants": [
            "вацлав"
        ]
    },
    "Велизар": {
        "translit": "velizar",
        "gender": "m",
        "genitive": "Велизара",
        "variants": [
            "велизар"
        ]
    },
    "Велина": {
        "translit": "velina",
        "gender": "f",
        "genitive": "Велины",
        "variants": [
            "велина"
        ]
    },
    "Венера": {
        "translit": "venera",
        "gender": "f",
        "genitive": "Венеры",
        "variants": [
            "венера"
        ]
    },
    "Вениамин": {
        "translit": "veniamin",
        "gender": "m",
        "genitive": "Вениамина",
        "variants": [
            "вениамин",
            "вениаминушка",
            "вениаминчик",
            "венюша",
            "веня"
        ]
    },
    "Вера": {
        "translit": "vera",
        "gender": "f",
        "genitive": "Веры",
        "variants": [
            "вера",
            "верочка",
            "веруля",
            "верунчик",
            "веруша"
        ]
    },
    "Веред": {
        "translit": "vered",
        "gender": "f",
        "genitive": "Веред",
        "variants": [
            "веред"
        ]
    },
    "Вероника": {
        "translit": "veronika",
        "gender": "f",
        "genitive": "Вероники",
        "variants": [
            "вероника"
        ]
    },
    "Веселина": {
        "translit": "veselina",
        "gender": "f",
        "genitive": "Веселины",
        "variants": [
            "веселина"
        ]
    },
    "Веска": {
        "translit": "veska",
        "gender": "f",
        "genitive": "Вески",
        "variants": [
            "веска"
        ]
    },
    "Весма": {
        "translit": "vesma",
        "gender": "f",
        "genitive": "Весмы",
        "variants": [
            "весма"
        ]
    },
    "Веста": {
        "translit": "vesta",
        "gender": "f",
        "genitive": "Весты",
        "variants": [
            "веста",
            "весточка"
        ]
    },
    "Вета": {
        "translit": "veta",
        "gender": "f",
        "genitive": "Веты",
        "variants": [
            "вета"
        ]
    },
    "Ветта": {
        "translit": "vetta",
        "gender": "f",
        "genitive": "Ветты",
        "variants": [
            "ветта"
        ]
    },
    "Виалина": {
        "translit": "vialina",
        "gender": "f",
        "genitive": "Виалина",
        "variants": [
            "виалина"
        ]
    },
    "Вивея": {
        "translit": "viveya",
        "gender": "f",
        "genitive": "Вивеи",
        "variants": [
            "вивея"
        ]
    },
    "Вивиана": {
        "translit": "viviana",
        "gender": "f",
        "genitive": "Вивианы",
        "variants": [
            "вивиана"
        ]
    },
    "Вида": {
        "translit": "vida",
        "gender": "f",
        "genitive": "Виды",
        "variants": [
            "вида"
        ]
    },
    "Вика": {
        "translit": "vika",
        "gender": "f",
        "genitive": "Вики",
        "variants": [
            "вика",
            "викочка",
            "виктория",
            "викуля",
            "викуся",
            "викуша"
        ]
    },
    "Виктория": {
        "translit": "viktoriya",
        "gender": "f",
        "genitive": "Виктории",
        "variants": [
            "виктория"
        ]
    },
    "Вилена": {
        "translit": "vilena",
        "gender": "f",
        "genitive": "Вилены",
        "variants": [
            "вилена"
        ]
    },
    "Вильгельм": {
        "translit": "vilgelm",
        "gender": "m",
        "genitive": "Вильгельма",
        "variants": [
            "вильгельм",
            "вильгельмушка",
            "вильгельмчик",
            "уилл"
        ]
    },
    "Вильям": {
        "translit": "vilyam",
        "gender": "m",
        "genitive": "Вильяма",
        "variants": [
            "вильям",
            "вилли",
            "вильямчик"
        ]
    },
    "Виола": {
        "translit": "viola",
        "gender": "f",
        "genitive": "Виолы",
        "variants": [
            "виола",
            "виолочка"
        ]
    },
    "Виолетта": {
        "translit": "violetta",
        "gender": "f",
        "genitive": "Виолетты",
        "variants": [
            "виолетта",
            "виолетточка"
        ]
    },
    "Виолика": {
        "translit": "violika",
        "gender": "f",
        "genitive": "Виолики",
        "variants": [
            "виолика"
        ]
    },
    "Виолина": {
        "translit": "violina",
        "gender": "f",
        "genitive": "Виолины",
        "variants": [
            "виолина"
        ]
    },
    "Виорика": {
        "translit": "viorika",
        "gender": "f",
        "genitive": "Виорики",
        "variants": [
            "виорика"
        ]
    },
    "Вирга": {
        "translit": "virga",
        "gender": "f",
        "genitive": "Вирги",
        "variants": [
            "вирга"
        ]
    },
    "Вирта": {
        "translit": "virta",
        "gender": "f",
        "genitive": "Вирты",
        "variants": [
            "вирта"
        ]
    },
    "Виссарион": {
        "translit": "vissarion",
        "gender": "m",
        "genitive": "Виссариона",
        "variants": [
            "виссарион",
            "висенька",
            "виссарионушка",
            "виссариончик",
            "вися"
        ]
    },
    "Вита": {
        "translit": "vita",
        "gender": "f",
        "genitive": "Виты",
        "variants": [
            "вита"
        ]
    },
    "Виталий": {
        "translit": "vitalij",
        "gender": "m",
        "genitive": "Виталия",
        "variants": [
            "виталий",
            "виталенька",
            "виталечка",
            "виталик",
            "виталька"
        ]
    },
    "Виталина": {
        "translit": "vitalina",
        "gender": "f",
        "genitive": "Виталины",
        "variants": [
            "виталина"
        ]
    },
    "Витя": {
        "translit": "vitya",
        "gender": "m",
        "genitive": "Вити",
        "variants": [
            "витя",
            "виктор",
            "витек",
            "витенька",
            "витюня",
            "витюша"
        ]
    },
    "Влад": {
        "translit": "vlad",
        "gender": "m",
        "genitive": "Влада",
        "variants": [
            "влад"
        ]
    },
    "Влада": {
        "translit": "vlada",
        "gender": "f",
        "genitive": "Влады",
        "variants": [
            "влада",
            "владочка",
            "владушка"
        ]
    },
    "Владислав": {
        "translit": "vladislav",
        "gender": "m",
        "genitive": "Владислава",
        "variants": [
            "владислав",
            "влад",
            "владенька",
            "владик",
            "слава",
            "славик"
        ]
    },
    "Владислава": {
        "translit": "vladislava",
        "gender": "f",
        "genitive": "Владиславы",
        "variants": [
            "владислава",
            "владиславочка",
            "слава",
            "славонька"
        ]
    },
    "Владлена": {
        "translit": "vladlena",
        "gender": "f",
        "genitive": "Владлены",
        "variants": [
            "владлена"
        ]
    },
    "Вова": {
        "translit": "vova",
        "gender": "m",
        "genitive": "Вовы",
        "variants": [
            "вова",
            "владимир",
            "вовочка",
            "володенька",
            "володечка",
            "володюшка",
            "володя"
        ]
    },
    "Вольдемар": {
        "translit": "voldemar",
        "gender": "m",
        "genitive": "Вольдемара",
        "variants": [
            "вольдемар",
            "вольдемарушка",
            "вольдемарчик",
            "вольдик"
        ]
    },
    "Всеволод": {
        "translit": "vsevolod",
        "gender": "m",
        "genitive": "Всеволода",
        "variants": [
            "всеволод"
        ]
    },
    "Вячеслав": {
        "translit": "vyacheslav",
        "gender": "m",
        "genitive": "Славы",
        "variants": [
            "вячеслав",
            "славик",
            "славочка",
            "славушка"
        ]
    },
    "Вячеслава": {
        "translit": "vyacheslava",
        "gender": "f",
        "genitive": "Вячеславы",
        "variants": [
            "вячеслава"
        ]
    },
    "Габи": {
        "translit": "gabi",
        "gender": "f",
        "genitive": "Габи",
        "variants": [
            "габи"
        ]
    },
    "Габриела": {
        "translit": "gabriela",
        "gender": "f",
        "genitive": "Габриелы",
        "variants": [
            "габриела"
        ]
    },
    "Габриэль": {
        "translit": "gabriel",
        "gender": "f",
        "genitive": "Габриэль",
        "variants": [
            "габриэль"
        ]
    },
    "Гавриил": {
        "translit": "gavriil",
        "gender": "m",
        "genitive": "Гавриила",
        "variants": [
            "гавриил"
        ]
    },
    "Гадиля": {
        "translit": "gadilya",
        "gender": "f",
        "genitive": "Гадили",
        "variants": [
            "гадиля"
        ]
    },
    "Газиза": {
        "translit": "gaziza",
        "gender": "f",
        "genitive": "Газизы",
        "variants": [
            "газиза"
        ]
    },
    "Галина": {
        "translit": "galina",
        "gender": "f",
        "genitive": "Галины",
        "variants": [
            "галина",
            "галиночка",
            "галочка",
            "галюша",
            "галя"
        ]
    },
    "Галия": {
        "translit": "galiya",
        "gender": "f",
        "genitive": "Галии",
        "variants": [
            "галия"
        ]
    },
    "Гамзат": {
        "translit": "gamzat",
        "gender": "m",
        "genitive": "Гамзата",
        "variants": [
            "гамзат"
        ]
    },
    "Гамид": {
        "translit": "gamid",
        "gender": "m",
        "genitive": "Гамида",
        "variants": [
            "гамид"
        ]
    },
    "Гамида": {
        "translit": "gamida",
        "gender": "f",
        "genitive": "Гамиды",
        "variants": [
            "гамида"
        ]
    },
    "Гамлет": {
        "translit": "gamlet",
        "gender": "m",
        "genitive": "Гамлета",
        "variants": [
            "гамлет"
        ]
    },
    "Гасэм": {
        "translit": "gasem",
        "gender": "f",
        "genitive": "Гасэм",
        "variants": [
            "гасэм"
        ]
    },
    "Гаухар": {
        "translit": "gaukhar",
        "gender": "f",
        "genitive": "Гаухар",
        "variants": [
            "гаухар"
        ]
    },
    "Гая": {
        "translit": "gaya",
        "gender": "f",
        "genitive": "Гаи",
        "variants": [
            "гая"
        ]
    },
    "Гаяна": {
        "translit": "gayana",
        "gender": "f",
        "genitive": "Гаяны",
        "variants": [
            "гаяна"
        ]
    },
    "Гаянэ": {
        "translit": "gayane",
        "gender": "f",
        "genitive": "Гаянэ",
        "variants": [
            "гаянэ"
        ]
    },
    "Геворг": {
        "translit": "gevorg",
        "gender": "m",
        "genitive": "Геворга",
        "variants": [
            "геворг"
        ]
    },
    "Гезель": {
        "translit": "gezel",
        "gender": "f",
        "genitive": "Гезель",
        "variants": [
            "гезель"
        ]
    },
    "Гектор": {
        "translit": "gektor",
        "gender": "m",
        "genitive": "Гектора",
        "variants": [
            "гектор"
        ]
    },
    "Гелена": {
        "translit": "gelena",
        "gender": "f",
        "genitive": "Гелены",
        "variants": [
            "гелена"
        ]
    },
    "Гелиана": {
        "translit": "geliana",
        "gender": "f",
        "genitive": "Гелианы",
        "variants": [
            "гелиана"
        ]
    },
    "Гелюса": {
        "translit": "gelyusa",
        "gender": "f",
        "genitive": "Гелюсы",
        "variants": [
            "гелюса"
        ]
    },
    "Гена": {
        "translit": "gena",
        "gender": "m",
        "genitive": "Гены",
        "variants": [
            "гена",
            "генадий",
            "геночка",
            "геша",
            "гешенька",
            "гоша",
            "жора"
        ]
    },
    "Генриетта": {
        "translit": "genrietta",
        "gender": "f",
        "genitive": "Генриетты",
        "variants": [
            "генриетта"
        ]
    },
    "Генрих": {
        "translit": "henri",
        "gender": "m",
        "genitive": "Генриха",
        "variants": [
            "генрих"
        ]
    },
    "Генута": {
        "translit": "genuta",
        "gender": "f",
        "genitive": "Генуты",
        "variants": [
            "генута"
        ]
    },
    "Гео": {
        "translit": "geo",
        "gender": "m",
        "genitive": "Гео",
        "variants": [
            "гео"
        ]
    },
    "Георгий": {
        "translit": "georgij",
        "gender": "m",
        "genitive": "Георгия",
        "variants": [
            "георгий",
            "герочка",
            "гоша",
            "гошенька",
            "жора"
        ]
    },
    "Гера": {
        "translit": "gera",
        "gender": "m",
        "genitive": "Геры",
        "variants": [
            "гера",
            "геронька",
            "герочка",
            "геруся",
            "гоша",
            "жора"
        ]
    },
    "Герасим": {
        "translit": "gerasim",
        "gender": "m",
        "genitive": "Герасима",
        "variants": [
            "герасим",
            "герасимушка",
            "герасимчик",
            "герушка",
            "гоша",
            "жора"
        ]
    },
    "Герман": {
        "translit": "german",
        "gender": "m",
        "genitive": "Германа",
        "variants": [
            "герман",
            "геруська",
            "гоша",
            "жора"
        ]
    },
    "Герта": {
        "translit": "gerta",
        "gender": "f",
        "genitive": "Герты",
        "variants": [
            "герта"
        ]
    },
    "Гизела": {
        "translit": "gizela",
        "gender": "f",
        "genitive": "Гизела",
        "variants": [
            "гизела"
        ]
    },
    "Гильда": {
        "translit": "gilda",
        "gender": "f",
        "genitive": "Гильды",
        "variants": [
            "гильда"
        ]
    },
    "Глафира": {
        "translit": "glafira",
        "gender": "f",
        "genitive": "Глафиры",
        "variants": [
            "глафира",
            "главифирочка",
            "глаша"
        ]
    },
    "Глеб": {
        "translit": "gleb",
        "gender": "m",
        "genitive": "Глеба",
        "variants": [
            "глеб",
            "глебка",
            "глебонька",
            "глебушка"
        ]
    },
    "Глория": {
        "translit": "gloriya",
        "gender": "f",
        "genitive": "Глории",
        "variants": [
            "глория"
        ]
    },
    "Гоги": {
        "translit": "gogi",
        "gender": "m",
        "genitive": "Гоги",
        "variants": [
            "гоги"
        ]
    },
    "Гозель": {
        "translit": "gozel",
        "gender": "f",
        "genitive": "Гозель",
        "variants": [
            "гозель"
        ]
    },
    "Гордей": {
        "translit": "gordej",
        "gender": "m",
        "genitive": "Гордея",
        "variants": [
            "гордей",
            "гордеечка",
            "гордейчик",
            "гордеюшка"
        ]
    },
    "Горислав": {
        "translit": "gorislav",
        "gender": "m",
        "genitive": "Горислава",
        "variants": [
            "горислав",
            "гориславек",
            "гориславушка",
            "гориславчик"
        ]
    },
    "Гохар": {
        "translit": "gohar",
        "gender": "f",
        "genitive": "Гохар",
        "variants": [
            "гохар"
        ]
    },
    "Гохарик": {
        "translit": "goharik",
        "gender": "f",
        "genitive": "Гохарик",
        "variants": [
            "гохарик"
        ]
    },
    "Гочи": {
        "translit": "gochi",
        "gender": "m",
        "genitive": "Гочи",
        "variants": [
            "гочи"
        ]
    },
    "Гоша": {
        "translit": "gosha",
        "gender": "m",
        "genitive": "Гоши",
        "variants": [
            "гоша"
        ]
    },
    "Граня": {
        "translit": "grania",
        "gender": "f",
        "genitive": "Грани",
        "variants": [
            "граня"
        ]
    },
    "Гретта": {
        "translit": "gretta",
        "gender": "f",
        "genitive": "Гретты",
        "variants": [
            "гретта"
        ]
    },
    "Грита": {
        "translit": "grita",
        "gender": "f",
        "genitive": "Гриты",
        "variants": [
            "грита"
        ]
    },
    "Гриша": {
        "translit": "grisha",
        "gender": "m",
        "genitive": "Гриши",
        "variants": [
            "гриша",
            "григорий",
            "гриня",
            "гришаня",
            "гришенька",
            "гришуня"
        ]
    },
    "Гузалия": {
        "translit": "guzaliya",
        "gender": "f",
        "genitive": "Гузалии",
        "variants": [
            "гузалия"
        ]
    },
    "Гузаль": {
        "translit": "guzal",
        "gender": "f",
        "genitive": "Гузаль",
        "variants": [
            "гузаль"
        ]
    },
    "Гузель": {
        "translit": "guzel",
        "gender": "f",
        "genitive": "Гузели",
        "variants": [
            "гузель"
        ]
    },
    "Гузеля": {
        "translit": "guzelya",
        "gender": "f",
        "genitive": "Гузели",
        "variants": [
            "гузеля"
        ]
    },
    "Гулафруз": {
        "translit": "gulafruz",
        "gender": "f",
        "genitive": "Гулафруз",
        "variants": [
            "гулафруз"
        ]
    },
    "Гулбария": {
        "translit": "gulbariya",
        "gender": "f",
        "genitive": "Гулбарии",
        "variants": [
            "гулбария"
        ]
    },
    "Гулдана": {
        "translit": "guldanaa",
        "gender": "f",
        "genitive": "Гулданы",
        "variants": [
            "гулдана"
        ]
    },
    "Гулжазира": {
        "translit": "gulzhaziraa",
        "gender": "f",
        "genitive": "Гулжазиры",
        "variants": [
            "гулжазира"
        ]
    },
    "Гулжайна": {
        "translit": "gulzhajna",
        "gender": "f",
        "genitive": "Гулжайны",
        "variants": [
            "гулжайна"
        ]
    },
    "Гулжан": {
        "translit": "gulzhann",
        "gender": "f",
        "genitive": "Гулжан",
        "variants": [
            "гулжан"
        ]
    },
    "Гулжанар": {
        "translit": "gulzhanar",
        "gender": "f",
        "genitive": "Гулжанар",
        "variants": [
            "гулжанар"
        ]
    },
    "Гулжанат": {
        "translit": "gulzhanatt",
        "gender": "f",
        "genitive": "Гулжанат",
        "variants": [
            "гулжанат"
        ]
    },
    "Гулзада": {
        "translit": "gulzadaa",
        "gender": "f",
        "genitive": "Гулзады",
        "variants": [
            "гулзада"
        ]
    },
    "Гулзат": {
        "translit": "gulzata",
        "gender": "f",
        "genitive": "Гулзат",
        "variants": [
            "гулзат"
        ]
    },
    "Гулзира": {
        "translit": "gulziraa",
        "gender": "f",
        "genitive": "Гулзиры",
        "variants": [
            "гулзира"
        ]
    },
    "Гулим": {
        "translit": "gulim",
        "gender": "f",
        "genitive": "Гулим",
        "variants": [
            "гулим"
        ]
    },
    "Гулия": {
        "translit": "guliya",
        "gender": "f",
        "genitive": "Гулии",
        "variants": [
            "гулия"
        ]
    },
    "Гулнар": {
        "translit": "gulnar",
        "gender": "f",
        "genitive": "Гулнар",
        "variants": [
            "гулнар"
        ]
    },
    "Гулнара": {
        "translit": "gulnaraa",
        "gender": "f",
        "genitive": "Гулнары",
        "variants": [
            "гулнара"
        ]
    },
    "Гулноза": {
        "translit": "gulnoza",
        "gender": "f",
        "genitive": "Гулнозы",
        "variants": [
            "гулноза"
        ]
    },
    "Гулнора": {
        "translit": "gulnora",
        "gender": "f",
        "genitive": "Гулноры",
        "variants": [
            "гулнора"
        ]
    },
    "Гулнур": {
        "translit": "gulnurr",
        "gender": "f",
        "genitive": "Гулнур",
        "variants": [
            "гулнур"
        ]
    },
    "Гулпери": {
        "translit": "gulperi",
        "gender": "f",
        "genitive": "Гулпери",
        "variants": [
            "гулпери"
        ]
    },
    "Гулсара": {
        "translit": "gulsara",
        "gender": "f",
        "genitive": "Гулсары",
        "variants": [
            "гулсара"
        ]
    },
    "Гулсим": {
        "translit": "gulsimm",
        "gender": "f",
        "genitive": "Гулсим",
        "variants": [
            "гулсим"
        ]
    },
    "Гулчехра": {
        "translit": "gulchekhraa",
        "gender": "f",
        "genitive": "Гулчехры",
        "variants": [
            "гулчехра"
        ]
    },
    "Гульайна": {
        "translit": "gulajna",
        "gender": "f",
        "genitive": "Гульайны",
        "variants": [
            "гульайна"
        ]
    },
    "Гульбану": {
        "translit": "gulbanu",
        "gender": "f",
        "genitive": "Гульбаны",
        "variants": [
            "гульбану"
        ]
    },
    "Гульдана": {
        "translit": "guldana",
        "gender": "f",
        "genitive": "Гульданы",
        "variants": [
            "гульдана"
        ]
    },
    "Гульдар": {
        "translit": "guldar",
        "gender": "f",
        "genitive": "Гульдар",
        "variants": [
            "гульдар"
        ]
    },
    "Гульден": {
        "translit": "gulden",
        "gender": "f",
        "genitive": "Гульден",
        "variants": [
            "гульден"
        ]
    },
    "Гульдераим": {
        "translit": "gulderaim",
        "gender": "f",
        "genitive": "Гульдераим",
        "variants": [
            "гульдераим"
        ]
    },
    "Гульжазира": {
        "translit": "gulzhazira",
        "gender": "f",
        "genitive": "Гульжазиры",
        "variants": [
            "гульжазира"
        ]
    },
    "Гульжан": {
        "translit": "gulzhan",
        "gender": "f",
        "genitive": "Гульжан",
        "variants": [
            "гульжан"
        ]
    },
    "Гульжана": {
        "translit": "gulzhana",
        "gender": "f",
        "genitive": "Гульжаны",
        "variants": [
            "гульжана"
        ]
    },
    "Гульжанат": {
        "translit": "gulzhanat",
        "gender": "f",
        "genitive": "Гульжанат",
        "variants": [
            "гульжанат"
        ]
    },
    "Гульжихан": {
        "translit": "gulzhihan",
        "gender": "f",
        "genitive": "Гульжихан",
        "variants": [
            "гульжихан"
        ]
    },
    "Гульзада": {
        "translit": "gulzada",
        "gender": "f",
        "genitive": "Гульзады",
        "variants": [
            "гульзада"
        ]
    },
    "Гульзара": {
        "translit": "gulzara",
        "gender": "f",
        "genitive": "Гульзары",
        "variants": [
            "гульзара"
        ]
    },
    "Гульзат": {
        "translit": "gulzat",
        "gender": "f",
        "genitive": "Гульзат",
        "variants": [
            "гульзат"
        ]
    },
    "Гульзина": {
        "translit": "gulzina",
        "gender": "f",
        "genitive": "Гульзины",
        "variants": [
            "гульзина"
        ]
    },
    "Гульзира": {
        "translit": "gulzira",
        "gender": "f",
        "genitive": "Гульзиры",
        "variants": [
            "гульзира"
        ]
    },
    "Гулькей": {
        "translit": "gulkej",
        "gender": "f",
        "genitive": "Гулькей",
        "variants": [
            "гулькей"
        ]
    },
    "Гульназ": {
        "translit": "gulnaz",
        "gender": "f",
        "genitive": "Гульназ",
        "variants": [
            "гульназ"
        ]
    },
    "Гульназира": {
        "translit": "gulnazira",
        "gender": "f",
        "genitive": "Гульназиры",
        "variants": [
            "гульназира"
        ]
    },
    "Гульнар": {
        "translit": "gylnara",
        "gender": "f",
        "genitive": "Гульнара",
        "variants": [
            "гульнар"
        ]
    },
    "Гульнара": {
        "translit": "gulnara",
        "gender": "f",
        "genitive": "Гульнары",
        "variants": [
            "гульнара"
        ]
    },
    "Гульнасып": {
        "translit": "gulnasyp",
        "gender": "f",
        "genitive": "Гульнасып",
        "variants": [
            "гульнасып"
        ]
    },
    "Гульниза": {
        "translit": "gulniza",
        "gender": "f",
        "genitive": "Гульнизы",
        "variants": [
            "гульниза"
        ]
    },
    "Гульнур": {
        "translit": "gulnur",
        "gender": "f",
        "genitive": "Гульнуры",
        "variants": [
            "гульнур"
        ]
    },
    "Гульнура": {
        "translit": "gulnura",
        "gender": "f",
        "genitive": "Гульнуры",
        "variants": [
            "гульнура"
        ]
    },
    "Гульсая": {
        "translit": "gulsaya",
        "gender": "f",
        "genitive": "Гульсаи",
        "variants": [
            "гульсая"
        ]
    },
    "Гульсим": {
        "translit": "gulsim",
        "gender": "f",
        "genitive": "Гульсима",
        "variants": [
            "гульсим"
        ]
    },
    "Гульсина": {
        "translit": "gulsina",
        "gender": "f",
        "genitive": "Гульсины",
        "variants": [
            "гульсина"
        ]
    },
    "Гульфира": {
        "translit": "gulfira",
        "gender": "f",
        "genitive": "Гульфиры",
        "variants": [
            "гульфира"
        ]
    },
    "Гульфия": {
        "translit": "gulfiya",
        "gender": "f",
        "genitive": "Гульфии",
        "variants": [
            "гульфия"
        ]
    },
    "Гульхан": {
        "translit": "gulhan",
        "gender": "f",
        "genitive": "Гульхан",
        "variants": [
            "гульхан"
        ]
    },
    "Гульчачак": {
        "translit": "gulchachak",
        "gender": "f",
        "genitive": "Гульчачак",
        "variants": [
            "гульчачак"
        ]
    },
    "Гульчехра": {
        "translit": "gulchekhra",
        "gender": "f",
        "genitive": "Гульчехры",
        "variants": [
            "гульчехра"
        ]
    },
    "Гульшан": {
        "translit": "gulshan",
        "gender": "f",
        "genitive": "Гульшан",
        "variants": [
            "гульшан"
        ]
    },
    "Гульшат": {
        "translit": "gulshat",
        "gender": "f",
        "genitive": "Гульшат",
        "variants": [
            "гульшат"
        ]
    },
    "Гульюзем": {
        "translit": "gulyuzem",
        "gender": "f",
        "genitive": "Гульюзем",
        "variants": [
            "гульюзем"
        ]
    },
    "Гуля": {
        "translit": "gulya",
        "gender": "f",
        "genitive": "Гули",
        "variants": [
            "гуля"
        ]
    },
    "Гунда": {
        "translit": "gunda",
        "gender": "f",
        "genitive": "Гунды",
        "variants": [
            "гунда"
        ]
    },
    "Гуцула": {
        "translit": "gucula",
        "gender": "f",
        "genitive": "Гуцулы",
        "variants": [
            "гуцула"
        ]
    },
    "Гюзель": {
        "translit": "gyuzel",
        "gender": "f",
        "genitive": "Гюзель",
        "variants": [
            "гюзель"
        ]
    },
    "Гюли": {
        "translit": "gyuli",
        "gender": "f",
        "genitive": "Гюли",
        "variants": [
            "гюли"
        ]
    },
    "Гюльварт": {
        "translit": "gyulvart",
        "gender": "f",
        "genitive": "Гюльварт",
        "variants": [
            "гюльварт"
        ]
    },
    "Гюльзар": {
        "translit": "gyulzar",
        "gender": "f",
        "genitive": "Гюльзар",
        "variants": [
            "гюльзар"
        ]
    },
    "Гюльзарият": {
        "translit": "gyulzariyat",
        "gender": "f",
        "genitive": "Гюльзарият",
        "variants": [
            "гюльзарият"
        ]
    },
    "Гюльназ": {
        "translit": "gyulnaz",
        "gender": "f",
        "genitive": "Гюльназ",
        "variants": [
            "гюльназ"
        ]
    },
    "Гюльнара": {
        "translit": "gyulnara",
        "gender": "f",
        "genitive": "Гюльнары",
        "variants": [
            "гюльнара"
        ]
    },
    "Гяваз": {
        "translit": "gyavaz",
        "gender": "f",
        "genitive": "Гяваз",
        "variants": [
            "гяваз"
        ]
    },
    "Давид": {
        "translit": "david",
        "gender": "m",
        "genitive": "Давида",
        "variants": [
            "давид",
            "давидик",
            "давидка",
            "давидушка",
            "додик"
        ]
    },
    "Дагмара": {
        "translit": "dagmara",
        "gender": "f",
        "genitive": "Дагмары",
        "variants": [
            "дагмара"
        ]
    },
    "Дайана": {
        "translit": "dayana",
        "gender": "f",
        "genitive": "Дайаны",
        "variants": [
            "дайана"
        ]
    },
    "Дайганат": {
        "translit": "dajganat",
        "gender": "f",
        "genitive": "Дайганат",
        "variants": [
            "дайганат"
        ]
    },
    "Далия": {
        "translit": "dalia",
        "gender": "f",
        "genitive": "Далии",
        "variants": [
            "далия"
        ]
    },
    "Даля": {
        "translit": "dalya",
        "gender": "f",
        "genitive": "Дали",
        "variants": [
            "даля"
        ]
    },
    "Дамиан": {
        "translit": "damian",
        "gender": "m",
        "genitive": "Дамиана",
        "variants": [
            "дамиан"
        ]
    },
    "Дамир": {
        "translit": "damir",
        "gender": "m",
        "genitive": "Дамира",
        "variants": [
            "дамир",
            "дамик",
            "дамирушка",
            "дамирчик",
            "мирчик"
        ]
    },
    "Дамира": {
        "translit": "damira",
        "gender": "f",
        "genitive": "Дамиры",
        "variants": [
            "дамира"
        ]
    },
    "Дана": {
        "translit": "dana",
        "gender": "f",
        "genitive": "Даны",
        "variants": [
            "дана",
            "даночка"
        ]
    },
    "Данагул": {
        "translit": "danagull",
        "gender": "f",
        "genitive": "Данагул",
        "variants": [
            "данагул"
        ]
    },
    "Данагуль": {
        "translit": "danagul",
        "gender": "f",
        "genitive": "Данагуль",
        "variants": [
            "данагуль"
        ]
    },
    "Данара": {
        "translit": "danara",
        "gender": "f",
        "genitive": "Данары",
        "variants": [
            "данара"
        ]
    },
    "Данель": {
        "translit": "danel",
        "gender": "f",
        "genitive": "Данель",
        "variants": [
            "данель"
        ]
    },
    "Даниел": {
        "translit": "daniyel",
        "gender": "m",
        "genitive": "Даниеля",
        "variants": [
            "даниел"
        ]
    },
    "Даниела": {
        "translit": "daniela",
        "gender": "f",
        "genitive": "Даниелы",
        "variants": [
            "даниела",
            "даниелочка",
            "даниэла"
        ]
    },
    "Даниелла": {
        "translit": "daniellaa",
        "gender": "f",
        "genitive": "Даниеллы",
        "variants": [
            "даниелла"
        ]
    },
    "Даниил": {
        "translit": "daniil",
        "gender": "m",
        "genitive": "Даниила",
        "variants": [
            "даниил",
            "данечка",
            "даниилушка",
            "данилушка",
            "даня"
        ]
    },
    "Данил": {
        "translit": "danil",
        "gender": "m",
        "genitive": "Данилы",
        "variants": [
            "данил"
        ]
    },
    "Данила": {
        "translit": "danila",
        "gender": "m",
        "genitive": "Данилы",
        "variants": [
            "данила",
            "данилка",
            "данильчик",
            "даня"
        ]
    },
    "Данира": {
        "translit": "danira",
        "gender": "f",
        "genitive": "Даниры",
        "variants": [
            "данира"
        ]
    },
    "Данис": {
        "translit": "danis",
        "gender": "m",
        "genitive": "Даниса",
        "variants": [
            "данис",
            "данисушка",
            "дениска",
            "денисочка",
            "денка",
            "деня"
        ]
    },
    "Даниэл": {
        "translit": "danieel",
        "gender": "m",
        "genitive": "Даниэла",
        "variants": [
            "даниэл"
        ]
    },
    "Даниэла": {
        "translit": "danielaa",
        "gender": "f",
        "genitive": "Даниэлы",
        "variants": [
            "даниэла"
        ]
    },
    "Даниэлла": {
        "translit": "daniella",
        "gender": "f",
        "genitive": "Даниэллы",
        "variants": [
            "даниэлла"
        ]
    },
    "Даниэль": {
        "translit": "daniel",
        "gender": "m",
        "genitive": "Даниэля",
        "variants": [
            "даниэль",
            "даниэлушка",
            "даниэльчик"
        ]
    },
    "Даниял": {
        "translit": "daniyal",
        "gender": "m",
        "genitive": "Данияла",
        "variants": [
            "даниял"
        ]
    },
    "Данияр": {
        "translit": "daniyar",
        "gender": "m",
        "genitive": "Данияра",
        "variants": [
            "данияр"
        ]
    },
    "Данна": {
        "translit": "danna",
        "gender": "f",
        "genitive": "Данны",
        "variants": [
            "данна"
        ]
    },
    "Дара": {
        "translit": "dara",
        "gender": "f",
        "genitive": "Дары",
        "variants": [
            "дара",
            "дарочка"
        ]
    },
    "Даре": {
        "translit": "dare",
        "gender": "f",
        "genitive": "Даре",
        "variants": [
            "даре"
        ]
    },
    "Дари": {
        "translit": "dari",
        "gender": "f",
        "genitive": "Дари",
        "variants": [
            "дари"
        ]
    },
    "Дариан": {
        "translit": "darian",
        "gender": "f",
        "genitive": "Дариана",
        "variants": [
            "дариан"
        ]
    },
    "Дарима": {
        "translit": "darima",
        "gender": "f",
        "genitive": "Даримы",
        "variants": [
            "дарима"
        ]
    },
    "Дарина": {
        "translit": "darina",
        "gender": "f",
        "genitive": "Дарины",
        "variants": [
            "дарина",
            "дариночка"
        ]
    },
    "Дариуш": {
        "translit": "dariush",
        "gender": "m",
        "genitive": "Дариуш",
        "variants": [
            "дариуш"
        ]
    },
    "Дариха": {
        "translit": "dariha",
        "gender": "f",
        "genitive": "Дарихи",
        "variants": [
            "дариха"
        ]
    },
    "Дария": {
        "translit": "daria",
        "gender": "f",
        "genitive": "Дарии",
        "variants": [
            "дария"
        ]
    },
    "Дарияга": {
        "translit": "dariyaga",
        "gender": "f",
        "genitive": "Дарияги",
        "variants": [
            "дарияга"
        ]
    },
    "Дарьдана": {
        "translit": "dardana",
        "gender": "f",
        "genitive": "Дарьданы",
        "variants": [
            "дарьдана"
        ]
    },
    "Дарья": {
        "translit": "darya",
        "gender": "f",
        "genitive": "Дарьи",
        "variants": [
            "дарья"
        ]
    },
    "Дарьяна": {
        "translit": "darjyana",
        "gender": "f",
        "genitive": "Дарьяны",
        "variants": [
            "дарьяна"
        ]
    },
    "Даулет": {
        "translit": "daulet",
        "gender": "f",
        "genitive": "Даулет",
        "variants": [
            "даулет"
        ]
    },
    "Даурия": {
        "translit": "dauriya",
        "gender": "f",
        "genitive": "Даурии",
        "variants": [
            "даурия"
        ]
    },
    "Даша": {
        "translit": "dasha",
        "gender": "f",
        "genitive": "Даши",
        "variants": [
            "даша",
            "дарья",
            "дашенька",
            "дашечка",
            "дашуля",
            "дашута"
        ]
    },
    "Дая": {
        "translit": "daya",
        "gender": "f",
        "genitive": "Даи",
        "variants": [
            "дая"
        ]
    },
    "Даян": {
        "translit": "dayan",
        "gender": "m",
        "genitive": "Даяна",
        "variants": [
            "даян"
        ]
    },
    "Даяна": {
        "translit": "daiyana",
        "gender": "f",
        "genitive": "Даяны",
        "variants": [
            "даяна"
        ]
    },
    "Дельгр": {
        "translit": "delgr",
        "gender": "f",
        "genitive": "Дельгр",
        "variants": [
            "дельгр"
        ]
    },
    "Дементий": {
        "translit": "dementiy",
        "gender": "m",
        "genitive": "Дементия",
        "variants": [
            "дементий"
        ]
    },
    "Демид": {
        "translit": "demid",
        "gender": "m",
        "genitive": "Демида",
        "variants": [
            "демид",
            "демидушка",
            "диомид"
        ]
    },
    "Демир": {
        "translit": "demir",
        "gender": "f",
        "genitive": "Демира",
        "variants": [
            "демир"
        ]
    },
    "Демьян": {
        "translit": "demyan",
        "gender": "m",
        "genitive": "Демьяна",
        "variants": [
            "демьян",
            "дема",
            "демочка",
            "демушка",
            "демьянчик"
        ]
    },
    "Дениз": {
        "translit": "deniz",
        "gender": "f",
        "genitive": "Дениз",
        "variants": [
            "дениз"
        ]
    },
    "Денис": {
        "translit": "denis",
        "gender": "m",
        "genitive": "Дениса",
        "variants": [
            "денис",
            "дениска",
            "денисонька",
            "денисочка",
            "денисушка",
            "деня"
        ]
    },
    "Джамал": {
        "translit": "dzhamal",
        "gender": "m",
        "genitive": "Джамала",
        "variants": [
            "джамал",
            "джама",
            "джамалик",
            "джамаль",
            "джамиль"
        ]
    },
    "Джамилия": {
        "translit": "dzhamiliya",
        "gender": "f",
        "genitive": "Джамилии",
        "variants": [
            "джамилия"
        ]
    },
    "Джамиль": {
        "translit": "dzhamil",
        "gender": "m",
        "genitive": "Джамиля",
        "variants": [
            "джамиль",
            "джамиленька",
            "джамилечка",
            "джамилюшка",
            "джамуся",
            "джамушка"
        ]
    },
    "Джамиля": {
        "translit": "dzhamilya",
        "gender": "f",
        "genitive": "Джамили",
        "variants": [
            "джамиля"
        ]
    },
    "Джана": {
        "translit": "dzhana",
        "gender": "f",
        "genitive": "Джаны",
        "variants": [
            "джана"
        ]
    },
    "Джасмин": {
        "translit": "dzasmin",
        "gender": "f",
        "genitive": "Джасмин",
        "variants": [
            "джасмин"
        ]
    },
    "Джейн": {
        "translit": "jane",
        "gender": "f",
        "genitive": "Джейн",
        "variants": [
            "джейн"
        ]
    },
    "Джемма": {
        "translit": "dzhemma",
        "gender": "f",
        "genitive": "Джеммы",
        "variants": [
            "джемма"
        ]
    },
    "Джемме": {
        "translit": "dzhemme",
        "gender": "f",
        "genitive": "Джемме",
        "variants": [
            "джемме"
        ]
    },
    "Джен": {
        "translit": "dzhen",
        "gender": "f",
        "genitive": "Джен",
        "variants": [
            "джен"
        ]
    },
    "Дженифер": {
        "translit": "dzhenifer",
        "gender": "f",
        "genitive": "Дженифер",
        "variants": [
            "дженифер"
        ]
    },
    "Дженнет": {
        "translit": "dzhennet",
        "gender": "f",
        "genitive": "Дженнет",
        "variants": [
            "дженнет"
        ]
    },
    "Джентик": {
        "translit": "dzhentik",
        "gender": "f",
        "genitive": "Джентик",
        "variants": [
            "джентик"
        ]
    },
    "Джесика": {
        "translit": "dzhesika",
        "gender": "f",
        "genitive": "Джесики",
        "variants": [
            "джесика"
        ]
    },
    "Джессика": {
        "translit": "dzhessika",
        "gender": "f",
        "genitive": "Джессики",
        "variants": [
            "джессика"
        ]
    },
    "Джихан": {
        "translit": "dzihan",
        "gender": "m",
        "genitive": "Джихана",
        "variants": [
            "джихан"
        ]
    },
    "Джолин": {
        "translit": "dzholin",
        "gender": "f",
        "genitive": "Джолин",
        "variants": [
            "джолин"
        ]
    },
    "Джордж": {
        "translit": "dzordz",
        "gender": "m",
        "genitive": "Джорджа",
        "variants": [
            "джордж"
        ]
    },
    "Джулианна": {
        "translit": "julianna",
        "gender": "f",
        "genitive": "Джулианны",
        "variants": [
            "джулианна"
        ]
    },
    "Джулия": {
        "translit": "dzhuliya",
        "gender": "f",
        "genitive": "Джулии",
        "variants": [
            "джулия"
        ]
    },
    "Джульетта": {
        "translit": "dzhuletta",
        "gender": "f",
        "genitive": "Джульетты",
        "variants": [
            "джульетта"
        ]
    },
    "Дзера": {
        "translit": "dzera",
        "gender": "f",
        "genitive": "Дзеры",
        "variants": [
            "дзера"
        ]
    },
    "Дзерасса": {
        "translit": "dzerassa",
        "gender": "f",
        "genitive": "Дзерассы",
        "variants": [
            "дзерасса"
        ]
    },
    "Диана": {
        "translit": "diana",
        "gender": "f",
        "genitive": "Дианы",
        "variants": [
            "диана",
            "дианочка",
            "диечка",
            "диночка"
        ]
    },
    "Дианара": {
        "translit": "dianara",
        "gender": "f",
        "genitive": "Дианары",
        "variants": [
            "дианара"
        ]
    },
    "Диас": {
        "translit": "dias",
        "gender": "m",
        "genitive": "Диаса",
        "variants": [
            "диас"
        ]
    },
    "Дилавер": {
        "translit": "dilaver",
        "gender": "f",
        "genitive": "Дилавер",
        "variants": [
            "дилавер"
        ]
    },
    "Дилара": {
        "translit": "dilara",
        "gender": "f",
        "genitive": "Дилары",
        "variants": [
            "дилара"
        ]
    },
    "Дилбар": {
        "translit": "dilbar",
        "gender": "f",
        "genitive": "Дилбар",
        "variants": [
            "дилбар"
        ]
    },
    "Дилором": {
        "translit": "dilorom",
        "gender": "f",
        "genitive": "Дилором",
        "variants": [
            "дилором"
        ]
    },
    "Дилрабо": {
        "translit": "dilrabo",
        "gender": "f",
        "genitive": "Дилрабо",
        "variants": [
            "дилрабо"
        ]
    },
    "Дилфуза": {
        "translit": "dilfuza",
        "gender": "f",
        "genitive": "Дилфузы",
        "variants": [
            "дилфуза"
        ]
    },
    "Дильназ": {
        "translit": "dilnaz",
        "gender": "f",
        "genitive": "Дильназ",
        "variants": [
            "дильназ"
        ]
    },
    "Дильфуза": {
        "translit": "dillfuza",
        "gender": "f",
        "genitive": "Дильфузы",
        "variants": [
            "дильфуза"
        ]
    },
    "Дильшат": {
        "translit": "dilshat",
        "gender": "f",
        "genitive": "Дильшат",
        "variants": [
            "дильшат"
        ]
    },
    "Диля": {
        "translit": "dilya",
        "gender": "f",
        "genitive": "Дили",
        "variants": [
            "диля"
        ]
    },
    "Диляра": {
        "translit": "dilyara",
        "gender": "f",
        "genitive": "Диляры",
        "variants": [
            "диляра"
        ]
    },
    "Диляфрус": {
        "translit": "dilyafrus",
        "gender": "f",
        "genitive": "Диляфрус",
        "variants": [
            "диляфрус"
        ]
    },
    "Дима": {
        "translit": "dima",
        "gender": "m",
        "genitive": "Димы",
        "variants": [
            "дима",
            "димочка",
            "димуля",
            "димуся",
            "дмитрий",
            "митюша",
            "митя"
        ]
    },
    "Дина": {
        "translit": "dina",
        "gender": "f",
        "genitive": "Дины",
        "variants": [
            "дина",
            "диночка"
        ]
    },
    "Динар": {
        "translit": "dinar",
        "gender": "m",
        "genitive": "Динара",
        "variants": [
            "динар"
        ]
    },
    "Динара": {
        "translit": "dinara",
        "gender": "f",
        "genitive": "Динары",
        "variants": [
            "динара",
            "Диночка"
        ]
    },
    "Динкабай": {
        "translit": "dinkabaj",
        "gender": "f",
        "genitive": "Динкабай",
        "variants": [
            "динкабай"
        ]
    },
    "Дисана": {
        "translit": "disana",
        "gender": "f",
        "genitive": "Дисаны",
        "variants": [
            "дисана"
        ]
    },
    "Добромир": {
        "translit": "dobromir",
        "gender": "m",
        "genitive": "Добромира",
        "variants": [
            "добромир"
        ]
    },
    "Добрыня": {
        "translit": "dobrynya",
        "gender": "m",
        "genitive": "Добрыня",
        "variants": [
            "добрыня",
            "добруша",
            "добрынка",
            "добрынчик",
            "добрынюшка"
        ]
    },
    "Доля": {
        "translit": "dolya",
        "gender": "f",
        "genitive": "Доли",
        "variants": [
            "доля"
        ]
    },
    "Доминик": {
        "translit": "dominik",
        "gender": "m",
        "genitive": "Доминика",
        "variants": [
            "доминик"
        ]
    },
    "Доминика": {
        "translit": "dominika",
        "gender": "f",
        "genitive": "Доминики",
        "variants": [
            "доминика"
        ]
    },
    "Донатас": {
        "translit": "donnatas",
        "gender": "m",
        "genitive": "Донатаса",
        "variants": [
            "донатас"
        ]
    },
    "Дониер": {
        "translit": "donier",
        "gender": "f",
        "genitive": "Дониеры",
        "variants": [
            "дониер"
        ]
    },
    "Дора": {
        "translit": "dora",
        "gender": "f",
        "genitive": "Доры",
        "variants": [
            "дора"
        ]
    },
    "Дора-Антония": {
        "translit": "dora-antonia",
        "gender": "f",
        "genitive": "Доры-Антонии",
        "variants": [
            "дора-антония"
        ]
    },
    "Дориан": {
        "translit": "dorian",
        "gender": "m",
        "genitive": "Дориана",
        "variants": [
            "дориан"
        ]
    },
    "Дорина": {
        "translit": "dorina",
        "gender": "f",
        "genitive": "Дорины",
        "variants": [
            "дорина"
        ]
    },
    "Доро": {
        "translit": "doro",
        "gender": "m",
        "genitive": "Доро",
        "variants": [
            "доро"
        ]
    },
    "Дорофей": {
        "translit": "dorofej",
        "gender": "m",
        "genitive": "Дорофея",
        "variants": [
            "дорофей",
            "дарик",
            "дорик",
            "дорофейка",
            "дорофейчик",
            "дорофеюшка"
        ]
    },
    "Дурдона": {
        "translit": "durdona",
        "gender": "f",
        "genitive": "Дурдоны",
        "variants": [
            "дурдона"
        ]
    },
    "Дуся": {
        "translit": "dusya",
        "gender": "f",
        "genitive": "Дуси",
        "variants": [
            "дуся"
        ]
    },
    "Дэвид": {
        "translit": "devid",
        "gender": "m",
        "genitive": "Дэвида",
        "variants": [
            "дэвид",
            "давидик",
            "давидка",
            "давидушка",
            "додик"
        ]
    },
    "Дэни": {
        "translit": "deny",
        "gender": "m",
        "genitive": "Дэни",
        "variants": [
            "дэни"
        ]
    },
    "Дэниэл": {
        "translit": "deeniel",
        "gender": "m",
        "genitive": "Дэниэла",
        "variants": [
            "дэниэл"
        ]
    },
    "Дэниэль": {
        "translit": "deniel",
        "gender": "m",
        "genitive": "Дэниэля",
        "variants": [
            "дэниэль",
            "даниэльчик"
        ]
    },
    "Дэсислава": {
        "translit": "desislava",
        "gender": "f",
        "genitive": "Дэсиславы",
        "variants": [
            "дэсислава"
        ]
    },
    "Дюльбер": {
        "translit": "dyulber",
        "gender": "f",
        "genitive": "Дюльбер",
        "variants": [
            "дюльбер"
        ]
    },
    "Ева": {
        "translit": "eva",
        "gender": "f",
        "genitive": "Евы",
        "variants": [
            "ева",
            "евонька",
            "евочка"
        ]
    },
    "Евангелина": {
        "translit": "evangelina",
        "gender": "f",
        "genitive": "Евангелины",
        "variants": [
            "евангелина",
            "евангелиночка"
        ]
    },
    "Евгений": {
        "translit": "evgenij",
        "gender": "m",
        "genitive": "Жени",
        "variants": [
            "евгений",
            "гешенька",
            "евген",
            "евгеньюшка",
            "женек",
            "женечка",
            "женя"
        ]
    },
    "Евгения": {
        "translit": "evgeniya",
        "gender": "f",
        "genitive": "Жени",
        "variants": [
            "евгения",
            "женечка",
            "женя"
        ]
    },
    "Евдокия": {
        "translit": "evdokiya",
        "gender": "f",
        "genitive": "Евдокии",
        "variants": [
            "евдокия"
        ]
    },
    "Евпраксия": {
        "translit": "evpraksiya",
        "gender": "f",
        "genitive": "Евпраксии",
        "variants": [
            "евпраксия"
        ]
    },
    "Егана": {
        "translit": "egana",
        "gender": "f",
        "genitive": "Еганы",
        "variants": [
            "егана"
        ]
    },
    "Егор": {
        "translit": "egor",
        "gender": "m",
        "genitive": "Егора",
        "variants": [
            "егор",
            "егорка",
            "егорочка",
            "егорушка",
            "егорчик",
            "жора",
            "жорочка"
        ]
    },
    "Езги": {
        "translit": "ezgi",
        "gender": "f",
        "genitive": "Езги",
        "variants": [
            "езги"
        ]
    },
    "Екатерина": {
        "translit": "ekaterina",
        "gender": "f",
        "genitive": "Екатерины",
        "variants": [
            "екатерина"
        ]
    },
    "Елена": {
        "translit": "elenaa",
        "gender": "f",
        "genitive": "Елены",
        "variants": [
            "елена"
        ]
    },
    "Елизавета": {
        "translit": "elizaveta",
        "gender": "f",
        "genitive": "Елизаветы",
        "variants": [
            "елизавета"
        ]
    },
    "Елисавета": {
        "translit": "elisaveta",
        "gender": "f",
        "genitive": "Елисаветы",
        "variants": [
            "елисавета"
        ]
    },
    "Елисей": {
        "translit": "elisej",
        "gender": "m",
        "genitive": "Елисея",
        "variants": [
            "елисей",
            "елисейчик",
            "елисеюшка",
            "лисенок"
        ]
    },
    "Ельзада": {
        "translit": "elzada",
        "gender": "f",
        "genitive": "Ельзады",
        "variants": [
            "ельзада"
        ]
    },
    "Емельян": {
        "translit": "emelyan",
        "gender": "m",
        "genitive": "Емельяна",
        "variants": [
            "емельян",
            "емеленька",
            "емелечка",
            "емельянушка",
            "емельянчик",
            "емеля"
        ]
    },
    "Емеля": {
        "translit": "emelya",
        "gender": "m",
        "genitive": "Емели",
        "variants": [
            "емеля"
        ]
    },
    "Ерасыл": {
        "translit": "erasil",
        "gender": "m",
        "genitive": "Ерасыла",
        "variants": [
            "ерасыл"
        ]
    },
    "Еремей": {
        "translit": "eremej",
        "gender": "m",
        "genitive": "Еремея",
        "variants": [
            "еремей",
            "еремейчик",
            "еремеюшка"
        ]
    },
    "Ержан": {
        "translit": "erzhan",
        "gender": "m",
        "genitive": "Ержана",
        "variants": [
            "ержан"
        ]
    },
    "Ерке": {
        "translit": "erke",
        "gender": "f",
        "genitive": "Ерке",
        "variants": [
            "ерке"
        ]
    },
    "Еркежан": {
        "translit": "erkezhan",
        "gender": "f",
        "genitive": "Еркежан",
        "variants": [
            "еркежан"
        ]
    },
    "Ерофей": {
        "translit": "erofej",
        "gender": "m",
        "genitive": "Ерофея",
        "variants": [
            "ерофей",
            "ерофейчик",
            "ерофеюшка"
        ]
    },
    "Есения": {
        "translit": "eseniya",
        "gender": "f",
        "genitive": "Есении",
        "variants": [
            "есения"
        ]
    },
    "Ефим": {
        "translit": "efim",
        "gender": "m",
        "genitive": "Ефима",
        "variants": [
            "ефим",
            "ефимка",
            "ефимушка",
            "ефимчик",
            "фима",
            "фимочка"
        ]
    },
    "Ефимия": {
        "translit": "efimiya",
        "gender": "f",
        "genitive": "Ефимии",
        "variants": [
            "ефимия",
            "фима"
        ]
    },
    "Ефросиния": {
        "translit": "efrosiniya",
        "gender": "f",
        "genitive": "Ефросинии",
        "variants": [
            "ефросиния",
            "евфросиния",
            "евфросинья",
            "ефросинья",
            "фрося"
        ]
    },
    "Жадыра": {
        "translit": "zhadyra",
        "gender": "f",
        "genitive": "Жадыры",
        "variants": [
            "жадыра"
        ]
    },
    "Жазгул": {
        "translit": "zhazgul",
        "gender": "f",
        "genitive": "Жазгул",
        "variants": [
            "жазгул"
        ]
    },
    "Жазира": {
        "translit": "zhazira",
        "gender": "f",
        "genitive": "Жазир",
        "variants": [
            "жазира"
        ]
    },
    "Жайна": {
        "translit": "zhajna",
        "gender": "f",
        "genitive": "Жайны",
        "variants": [
            "жайна"
        ]
    },
    "Жакуляй": {
        "translit": "zhakulyaj",
        "gender": "f",
        "genitive": "Жакуляй",
        "variants": [
            "жакуляй"
        ]
    },
    "Жамиля": {
        "translit": "zhamilya",
        "gender": "f",
        "genitive": "Жамили",
        "variants": [
            "жамиля"
        ]
    },
    "Жан": {
        "translit": "dzan",
        "gender": "m",
        "genitive": "Жана",
        "variants": [
            "жан"
        ]
    },
    "Жанагул": {
        "translit": "zhanagul",
        "gender": "f",
        "genitive": "Жанагул",
        "variants": [
            "жанагул"
        ]
    },
    "Жанар": {
        "translit": "zhanar",
        "gender": "f",
        "genitive": "Жанар",
        "variants": [
            "жанар"
        ]
    },
    "Жанаргуль": {
        "translit": "zhanargul",
        "gender": "f",
        "genitive": "Жанаргуль",
        "variants": [
            "жанаргуль"
        ]
    },
    "Жанат": {
        "translit": "zhanat",
        "gender": "f",
        "genitive": "Жанат",
        "variants": [
            "жанат"
        ]
    },
    "Жанбота": {
        "translit": "zhanbota",
        "gender": "f",
        "genitive": "Жанботы",
        "variants": [
            "жанбота"
        ]
    },
    "Жангуль": {
        "translit": "zhangul",
        "gender": "f",
        "genitive": "Жангуль",
        "variants": [
            "жангуль"
        ]
    },
    "Жанека": {
        "translit": "zhaneka",
        "gender": "f",
        "genitive": "Жанеки",
        "variants": [
            "жанека"
        ]
    },
    "Жанель": {
        "translit": "zhanel",
        "gender": "f",
        "genitive": "Жанель",
        "variants": [
            "жанель"
        ]
    },
    "Жания": {
        "translit": "zhaniya",
        "gender": "f",
        "genitive": "Жании",
        "variants": [
            "жания"
        ]
    },
    "Жанкабай": {
        "translit": "zhankabaj",
        "gender": "f",
        "genitive": "Жанкабай",
        "variants": [
            "жанкабай"
        ]
    },
    "Жанна": {
        "translit": "zhanna",
        "gender": "f",
        "genitive": "Жанны",
        "variants": [
            "жанна",
            "жанночка"
        ]
    },
    "Жансауле": {
        "translit": "zhansaule",
        "gender": "f",
        "genitive": "Жансауле",
        "variants": [
            "жансауле"
        ]
    },
    "Жансая": {
        "translit": "jansaya",
        "gender": "f",
        "genitive": "Жансой",
        "variants": [
            "жансая"
        ]
    },
    "Жансулу": {
        "translit": "zhansulu",
        "gender": "f",
        "genitive": "Жансулу",
        "variants": [
            "жансулу"
        ]
    },
    "Жанукем": {
        "translit": "zhanukem",
        "gender": "f",
        "genitive": "Жанукем",
        "variants": [
            "жанукем"
        ]
    },
    "Жаныл": {
        "translit": "zhanyl",
        "gender": "f",
        "genitive": "Жаныл",
        "variants": [
            "жаныл"
        ]
    },
    "Жаным": {
        "translit": "zhanym",
        "gender": "f",
        "genitive": "Жаным",
        "variants": [
            "жаным"
        ]
    },
    "Жасмин": {
        "translit": "zhasmin",
        "gender": "f",
        "genitive": "Жасмин",
        "variants": [
            "жасмин"
        ]
    },
    "Жасмина": {
        "translit": "zhasmina",
        "gender": "f",
        "genitive": "Жасмины",
        "variants": [
            "жасмина"
        ]
    },
    "Жаухар": {
        "translit": "zhauhar",
        "gender": "f",
        "genitive": "Жаухар",
        "variants": [
            "жаухар"
        ]
    },
    "Ждан": {
        "translit": "zdnan",
        "gender": "m",
        "genitive": "Ждана",
        "variants": [
            "ждан"
        ]
    },
    "Жибек": {
        "translit": "zhibek",
        "gender": "f",
        "genitive": "Жибек",
        "variants": [
            "жибек"
        ]
    },
    "Живиле": {
        "translit": "zhivile",
        "gender": "f",
        "genitive": "Живиле",
        "variants": [
            "живиле"
        ]
    },
    "Жони": {
        "translit": "zhoni",
        "gender": "f",
        "genitive": "Жони",
        "variants": [
            "жони"
        ]
    },
    "Жора": {
        "translit": "zhora",
        "gender": "m",
        "genitive": "Жоры",
        "variants": [
            "жора"
        ]
    },
    "Жулдуз": {
        "translit": "zhulduz",
        "gender": "f",
        "genitive": "Жулдуз",
        "variants": [
            "жулдуз"
        ]
    },
    "Жулдыз": {
        "translit": "zhuldyz",
        "gender": "f",
        "genitive": "Жулдыз",
        "variants": [
            "жулдыз"
        ]
    },
    "Жулдызай": {
        "translit": "zhuldyzaj",
        "gender": "f",
        "genitive": "Жулдызай",
        "variants": [
            "жулдызай"
        ]
    },
    "Жумабай": {
        "translit": "zhumabaj",
        "gender": "f",
        "genitive": "Жумабай",
        "variants": [
            "жумабай"
        ]
    },
    "Жумагул": {
        "translit": "zhumagul",
        "gender": "f",
        "genitive": "Жумагул",
        "variants": [
            "жумагул"
        ]
    },
    "Жумакуль": {
        "translit": "zhumakul",
        "gender": "f",
        "genitive": "Жумакуль",
        "variants": [
            "жумакуль"
        ]
    },
    "Жупар": {
        "translit": "zhupar",
        "gender": "f",
        "genitive": "Жупар",
        "variants": [
            "жупар"
        ]
    },
    "Забира": {
        "translit": "zabira",
        "gender": "f",
        "genitive": "Забиры",
        "variants": [
            "забира"
        ]
    },
    "Забират": {
        "translit": "zabirat",
        "gender": "f",
        "genitive": "Забират",
        "variants": [
            "забират"
        ]
    },
    "Загра": {
        "translit": "zagra",
        "gender": "f",
        "genitive": "Загры",
        "variants": [
            "загра"
        ]
    },
    "Заида": {
        "translit": "zaida",
        "gender": "f",
        "genitive": "Заиды",
        "variants": [
            "заида"
        ]
    },
    "Заира": {
        "translit": "zaira",
        "gender": "f",
        "genitive": "Заиры",
        "variants": [
            "заира"
        ]
    },
    "Зайнаб": {
        "translit": "zajnab",
        "gender": "f",
        "genitive": "Зайнаб",
        "variants": [
            "зайнаб"
        ]
    },
    "Зайнап": {
        "translit": "zajnap",
        "gender": "f",
        "genitive": "Зайнап",
        "variants": [
            "зайнап"
        ]
    },
    "Зайнаш": {
        "translit": "zajnash",
        "gender": "f",
        "genitive": "Зайнаш",
        "variants": [
            "зайнаш"
        ]
    },
    "Зайрагул": {
        "translit": "zajragul",
        "gender": "f",
        "genitive": "Зайрагул",
        "variants": [
            "зайрагул"
        ]
    },
    "Заки": {
        "translit": "zaki",
        "gender": "m",
        "genitive": "Заки",
        "variants": [
            "заки"
        ]
    },
    "Закира": {
        "translit": "zakira",
        "gender": "f",
        "genitive": "Закиры",
        "variants": [
            "закира"
        ]
    },
    "Залина": {
        "translit": "zalina",
        "gender": "f",
        "genitive": "Залины",
        "variants": [
            "залина"
        ]
    },
    "Залия": {
        "translit": "zaliya",
        "gender": "f",
        "genitive": "Залии",
        "variants": [
            "залия"
        ]
    },
    "Замбиля": {
        "translit": "zambilya",
        "gender": "f",
        "genitive": "Замбили",
        "variants": [
            "замбиля"
        ]
    },
    "Замзагуль": {
        "translit": "zamzagul",
        "gender": "f",
        "genitive": "Замзагуль",
        "variants": [
            "замзагуль"
        ]
    },
    "Замира": {
        "translit": "zamira",
        "gender": "f",
        "genitive": "Замиры",
        "variants": [
            "замира"
        ]
    },
    "Зара": {
        "translit": "zara",
        "gender": "f",
        "genitive": "Зары",
        "variants": [
            "зара",
            "зарочка"
        ]
    },
    "Зарема": {
        "translit": "zarema",
        "gender": "f",
        "genitive": "Заремы",
        "variants": [
            "зарема"
        ]
    },
    "Зарима": {
        "translit": "zarima",
        "gender": "f",
        "genitive": "Заримы",
        "variants": [
            "зарима"
        ]
    },
    "Зарина": {
        "translit": "zarina",
        "gender": "f",
        "genitive": "Зарины",
        "variants": [
            "зарина",
            "зариночка"
        ]
    },
    "Зарминахон": {
        "translit": "zarminahon",
        "gender": "f",
        "genitive": "Зарминахон",
        "variants": [
            "зарминахон"
        ]
    },
    "Зарнигор": {
        "translit": "zarnigor",
        "gender": "f",
        "genitive": "Зарнигор",
        "variants": [
            "зарнигор"
        ]
    },
    "Заррина": {
        "translit": "zarrina",
        "gender": "f",
        "genitive": "Заррины",
        "variants": [
            "заррина"
        ]
    },
    "Заур": {
        "translit": "zaur",
        "gender": "m",
        "genitive": "Заура",
        "variants": [
            "заур"
        ]
    },
    "Зауре": {
        "translit": "zaure",
        "gender": "f",
        "genitive": "Зауре",
        "variants": [
            "зауре"
        ]
    },
    "Зауреш": {
        "translit": "zauresh",
        "gender": "f",
        "genitive": "Зауреш",
        "variants": [
            "зауреш"
        ]
    },
    "Захар": {
        "translit": "zahar",
        "gender": "m",
        "genitive": "Захара",
        "variants": [
            "захар",
            "захарка",
            "захарушка",
            "захарчик"
        ]
    },
    "Зденка": {
        "translit": "zdenka",
        "gender": "f",
        "genitive": "Зденки",
        "variants": [
            "зденка"
        ]
    },
    "Зебо": {
        "translit": "zebo",
        "gender": "f",
        "genitive": "Зебо",
        "variants": [
            "зебо"
        ]
    },
    "Зейнаб": {
        "translit": "zejnab",
        "gender": "f",
        "genitive": "Зейнаб",
        "variants": [
            "зейнаб"
        ]
    },
    "Зеккие": {
        "translit": "zekkie",
        "gender": "f",
        "genitive": "Зеккие",
        "variants": [
            "зеккие"
        ]
    },
    "Земфира": {
        "translit": "zemfira",
        "gender": "f",
        "genitive": "Земфиры",
        "variants": [
            "земфира"
        ]
    },
    "Зенфира": {
        "translit": "zenfira",
        "gender": "f",
        "genitive": "Зенфиры",
        "variants": [
            "зенфира"
        ]
    },
    "Зера": {
        "translit": "zera",
        "gender": "f",
        "genitive": "Зеры",
        "variants": [
            "зера"
        ]
    },
    "Зере": {
        "translit": "zere",
        "gender": "f",
        "genitive": "Зере",
        "variants": [
            "зере"
        ]
    },
    "Зефира": {
        "translit": "zefira",
        "gender": "f",
        "genitive": "Зефиры",
        "variants": [
            "зефира"
        ]
    },
    "Зефиркам": {
        "translit": "zefirkam",
        "gender": "f",
        "genitive": "Зефиркам",
        "variants": [
            "зефиркам"
        ]
    },
    "Зимфира": {
        "translit": "zimfira",
        "gender": "f",
        "genitive": "Зимфиры",
        "variants": [
            "зимфира"
        ]
    },
    "Зина": {
        "translit": "zina",
        "gender": "f",
        "genitive": "Зины",
        "variants": [
            "зина",
            "зинаида",
            "зиначка",
            "зинуля"
        ]
    },
    "Зинаида": {
        "translit": "zinaida",
        "gender": "f",
        "genitive": "Зинаиды",
        "variants": [
            "зинаида"
        ]
    },
    "Зита": {
        "translit": "zita",
        "gender": "f",
        "genitive": "Зиты",
        "variants": [
            "зита"
        ]
    },
    "Зифа": {
        "translit": "zifa",
        "gender": "f",
        "genitive": "Зифы",
        "variants": [
            "зифа"
        ]
    },
    "Злата": {
        "translit": "zlata",
        "gender": "f",
        "genitive": "Златы",
        "variants": [
            "злата",
            "златочка"
        ]
    },
    "Златан": {
        "translit": "zlatan",
        "gender": "m",
        "genitive": "Златана",
        "variants": [
            "златан"
        ]
    },
    "Зои": {
        "translit": "zoi",
        "gender": "f",
        "genitive": "Зои",
        "variants": [
            "зои"
        ]
    },
    "Зока": {
        "translit": "zoka",
        "gender": "f",
        "genitive": "Зоки",
        "variants": [
            "зока"
        ]
    },
    "Золия": {
        "translit": "zoliya",
        "gender": "f",
        "genitive": "Золии",
        "variants": [
            "золия"
        ]
    },
    "Зоран": {
        "translit": "zoran",
        "gender": "f",
        "genitive": "Зоран",
        "variants": [
            "зоран"
        ]
    },
    "Зорница": {
        "translit": "zornica",
        "gender": "f",
        "genitive": "Зорницы",
        "variants": [
            "зорница"
        ]
    },
    "Зося": {
        "translit": "zosya",
        "gender": "f",
        "genitive": "Зоси",
        "variants": [
            "зося"
        ]
    },
    "Зохра": {
        "translit": "zohra",
        "gender": "f",
        "genitive": "Зохры",
        "variants": [
            "зохра"
        ]
    },
    "Зоя": {
        "translit": "zoya",
        "gender": "f",
        "genitive": "Зои",
        "variants": [
            "зоя",
            "зоячка"
        ]
    },
    "Зубаржат": {
        "translit": "zubarzhat",
        "gender": "f",
        "genitive": "Зубаржат",
        "variants": [
            "зубаржат"
        ]
    },
    "Зулейха": {
        "translit": "zulejha",
        "gender": "f",
        "genitive": "Зулейхи",
        "variants": [
            "зулейха"
        ]
    },
    "Зулпа": {
        "translit": "zulpa",
        "gender": "f",
        "genitive": "Зулпы",
        "variants": [
            "зулпа"
        ]
    },
    "Зульманат": {
        "translit": "zulmanat",
        "gender": "f",
        "genitive": "Зульманат",
        "variants": [
            "зульманат"
        ]
    },
    "Зульфира": {
        "translit": "zulfira",
        "gender": "f",
        "genitive": "Зульфиры",
        "variants": [
            "зульфира"
        ]
    },
    "Зульфия": {
        "translit": "zulfiya",
        "gender": "f",
        "genitive": "Зульфии",
        "variants": [
            "зульфия"
        ]
    },
    "Зума": {
        "translit": "zuma",
        "gender": "f",
        "genitive": "Зумы",
        "variants": [
            "зума"
        ]
    },
    "Зумруд": {
        "translit": "zumrud",
        "gender": "f",
        "genitive": "Зумруд",
        "variants": [
            "зумруд"
        ]
    },
    "Зура": {
        "translit": "zura",
        "gender": "f",
        "genitive": "Зуры",
        "variants": [
            "зура"
        ]
    },
    "Зухра": {
        "translit": "zuhra",
        "gender": "f",
        "genitive": "Зухры",
        "variants": [
            "зухра"
        ]
    },
    "Иаков": {
        "translit": "iakov",
        "gender": "m",
        "genitive": "Иакова",
        "variants": [
            "иаков"
        ]
    },
    "Ибрагим": {
        "translit": "ibragim",
        "gender": "m",
        "genitive": "Ибрагима",
        "variants": [
            "ибрагим"
        ]
    },
    "Ива": {
        "translit": "iva",
        "gender": "f",
        "genitive": "Ивы",
        "variants": [
            "ива"
        ]
    },
    "Иван": {
        "translit": "ivan",
        "gender": "m",
        "genitive": "Ивана",
        "variants": [
            "иван"
        ]
    },
    "Ивана": {
        "translit": "ivana",
        "gender": "f",
        "genitive": "Иваны",
        "variants": [
            "ивана"
        ]
    },
    "Иванна": {
        "translit": "ivanna",
        "gender": "f",
        "genitive": "Иванны",
        "variants": [
            "иванна",
            "иванночка"
        ]
    },
    "Иветта": {
        "translit": "ivetta",
        "gender": "f",
        "genitive": "Иветты",
        "variants": [
            "иветта"
        ]
    },
    "Ивона": {
        "translit": "iona",
        "gender": "f",
        "genitive": "Ивоны",
        "variants": [
            "ивона"
        ]
    },
    "Ивэйн": {
        "translit": "ivein",
        "gender": "m",
        "genitive": "Ивэйна",
        "variants": [
            "ивэйн"
        ]
    },
    "Игнат": {
        "translit": "ignat",
        "gender": "m",
        "genitive": "Игната",
        "variants": [
            "игнат",
            "игнаточка",
            "игнаша",
            "игнашечка",
            "игоша",
            "игошенька"
        ]
    },
    "Игнатий": {
        "translit": "ignatij",
        "gender": "m",
        "genitive": "Игнатия",
        "variants": [
            "игнатий",
            "игнаточка",
            "игнаша",
            "игнашечка",
            "игоша",
            "игошенька"
        ]
    },
    "Игорь": {
        "translit": "igor",
        "gender": "m",
        "genitive": "Игоря",
        "variants": [
            "игорь",
            "гога",
            "гоша",
            "гошенька",
            "игорек",
            "игоречек"
        ]
    },
    "Ида": {
        "translit": "ida",
        "gender": "f",
        "genitive": "Иды",
        "variants": [
            "ида",
            "идочка"
        ]
    },
    "Изабелла": {
        "translit": "izabella",
        "gender": "f",
        "genitive": "Изабеллы",
        "variants": [
            "изабелла"
        ]
    },
    "Изольда": {
        "translit": "izolda",
        "gender": "f",
        "genitive": "Изольды",
        "variants": [
            "изольда"
        ]
    },
    "Израиль": {
        "translit": "izrail",
        "gender": "m",
        "genitive": "Израиля",
        "variants": [
            "израиль",
            "израил",
            "израилюшка",
            "израйльчик"
        ]
    },
    "Изя": {
        "translit": "izj",
        "gender": "m",
        "genitive": "Изи",
        "variants": [
            "изя"
        ]
    },
    "Изяслав": {
        "translit": "izyaslav",
        "gender": "m",
        "genitive": "Изяслава",
        "variants": [
            "изяслав",
            "изяславушка",
            "изяславчик",
            "слава",
            "славуша"
        ]
    },
    "Иисус": {
        "translit": "iisus",
        "gender": "m",
        "genitive": "Иисуса",
        "variants": [
            "иисус"
        ]
    },
    "Илария": {
        "translit": "ilariya",
        "gender": "f",
        "genitive": "Иларии",
        "variants": [
            "илария"
        ]
    },
    "Илиан": {
        "translit": "illian",
        "gender": "m",
        "genitive": "Илиана",
        "variants": [
            "илиан"
        ]
    },
    "Илиана": {
        "translit": "iliana",
        "gender": "f",
        "genitive": "Илианы",
        "variants": [
            "илиана"
        ]
    },
    "Илиза": {
        "translit": "iliza",
        "gender": "f",
        "genitive": "Илизы",
        "variants": [
            "илиза"
        ]
    },
    "Илия": {
        "translit": "iliya",
        "gender": "f",
        "genitive": "Илии",
        "variants": [
            "илия"
        ]
    },
    "Илларион": {
        "translit": "illarion",
        "gender": "m",
        "genitive": "Иллариона",
        "variants": [
            "илларион",
            "илларионушка",
            "иллариончик",
            "ларик",
            "лариончик",
            "лариоша"
        ]
    },
    "Иллона": {
        "translit": "illona",
        "gender": "f",
        "genitive": "Иллоны",
        "variants": [
            "иллона"
        ]
    },
    "Илона": {
        "translit": "ilona",
        "gender": "f",
        "genitive": "Илоны",
        "variants": [
            "илона",
            "илоночка"
        ]
    },
    "Илфира": {
        "translit": "ilfira",
        "gender": "f",
        "genitive": "Илфиры",
        "variants": [
            "илфира"
        ]
    },
    "Ильвира": {
        "translit": "ilvira",
        "gender": "f",
        "genitive": "Ильвиры",
        "variants": [
            "ильвира"
        ]
    },
    "Ильгена": {
        "translit": "ilgena",
        "gender": "f",
        "genitive": "Ильгены",
        "variants": [
            "ильгена"
        ]
    },
    "Ильгиза": {
        "translit": "ilgiza",
        "gender": "f",
        "genitive": "Ильгизы",
        "variants": [
            "ильгиза"
        ]
    },
    "Ильгизя": {
        "translit": "ilgizya",
        "gender": "f",
        "genitive": "Ильгизя",
        "variants": [
            "ильгизя"
        ]
    },
    "Ильдар": {
        "translit": "ildar",
        "gender": "m",
        "genitive": "Ильдара",
        "variants": [
            "ильдар"
        ]
    },
    "Ильза": {
        "translit": "ilza",
        "gender": "f",
        "genitive": "Ильзы",
        "variants": [
            "ильза"
        ]
    },
    "Ильзира": {
        "translit": "ilzira",
        "gender": "f",
        "genitive": "Ильзиры",
        "variants": [
            "ильзира"
        ]
    },
    "Ильмира": {
        "translit": "ilmira",
        "gender": "f",
        "genitive": "Ильмиры",
        "variants": [
            "ильмира"
        ]
    },
    "Ильназ": {
        "translit": "ilnaz",
        "gender": "m",
        "genitive": "Ильназа",
        "variants": [
            "ильназ"
        ]
    },
    "Ильнар": {
        "translit": "ilnar",
        "gender": "m",
        "genitive": "Ильнара",
        "variants": [
            "ильнар"
        ]
    },
    "Ильнара": {
        "translit": "ilnara",
        "gender": "f",
        "genitive": "Ильнары",
        "variants": [
            "ильнара"
        ]
    },
    "Ильнур": {
        "translit": "ilnur",
        "gender": "m",
        "genitive": "Ильнур",
        "variants": [
            "ильнур"
        ]
    },
    "Ильсия": {
        "translit": "ilsiya",
        "gender": "f",
        "genitive": "Ильсии",
        "variants": [
            "ильсия"
        ]
    },
    "Илья": {
        "translit": "ilya",
        "gender": "m",
        "genitive": "Ильи",
        "variants": [
            "илья",
            "ильюша",
            "илюня",
            "илюша",
            "иляша"
        ]
    },
    "Ильяс": {
        "translit": "ilyas",
        "gender": "m",
        "genitive": "Ильяса",
        "variants": [
            "ильяс",
            "ильясик"
        ]
    },
    "Илюза": {
        "translit": "ilyuza",
        "gender": "f",
        "genitive": "Илюзы",
        "variants": [
            "илюза"
        ]
    },
    "Иляна": {
        "translit": "ilyana",
        "gender": "f",
        "genitive": "Иляны",
        "variants": [
            "иляна"
        ]
    },
    "Иман": {
        "translit": "iman",
        "gender": "f",
        "genitive": "Иман",
        "variants": [
            "иман"
        ]
    },
    "Имран": {
        "translit": "imran",
        "gender": "m",
        "genitive": "Имрана",
        "variants": [
            "имран"
        ]
    },
    "Имрана": {
        "translit": "imrana",
        "gender": "f",
        "genitive": "Имраны",
        "variants": [
            "имрана"
        ]
    },
    "Инга": {
        "translit": "inga",
        "gender": "f",
        "genitive": "Инги",
        "variants": [
            "инга",
            "ингуша"
        ]
    },
    "Ингрид": {
        "translit": "ingrid",
        "gender": "f",
        "genitive": "Ингрид",
        "variants": [
            "ингрид"
        ]
    },
    "Индира": {
        "translit": "indira",
        "gender": "f",
        "genitive": "Индиры",
        "variants": [
            "индира"
        ]
    },
    "Инеза": {
        "translit": "ineza",
        "gender": "f",
        "genitive": "Инезы",
        "variants": [
            "инеза"
        ]
    },
    "Инесса": {
        "translit": "inessa",
        "gender": "f",
        "genitive": "Инессы",
        "variants": [
            "инесса",
            "инессочка"
        ]
    },
    "Инжу": {
        "translit": "inzhu",
        "gender": "f",
        "genitive": "Инжу",
        "variants": [
            "инжу"
        ]
    },
    "Инна": {
        "translit": "inna",
        "gender": "f",
        "genitive": "Инны",
        "variants": [
            "инна",
            "инночка",
            "инуся"
        ]
    },
    "Иннесса": {
        "translit": "innessa",
        "gender": "f",
        "genitive": "Иннессы",
        "variants": [
            "иннесса"
        ]
    },
    "Иннокентий": {
        "translit": "innokentij",
        "gender": "m",
        "genitive": "Иннокентия",
        "variants": [
            "иннокентий",
            "инечка",
            "иня",
            "кеша",
            "кешенька"
        ]
    },
    "Инсар": {
        "translit": "insar",
        "gender": "m",
        "genitive": "Инсара",
        "variants": [
            "инсар"
        ]
    },
    "Инсаф": {
        "translit": "insaf",
        "gender": "m",
        "genitive": "Инсафа",
        "variants": [
            "инсаф"
        ]
    },
    "Инэсса": {
        "translit": "inessaa",
        "gender": "f",
        "genitive": "Инэссы",
        "variants": [
            "инэсса"
        ]
    },
    "Иоанн": {
        "translit": "ioann",
        "gender": "m",
        "genitive": "Иоанна",
        "variants": [
            "иоанн"
        ]
    },
    "Иоанна": {
        "translit": "ioanna",
        "gender": "f",
        "genitive": "Иоанны",
        "variants": [
            "иоанна"
        ]
    },
    "Иоланта": {
        "translit": "iolanta",
        "gender": "f",
        "genitive": "Иоланты",
        "variants": [
            "иоланта"
        ]
    },
    "Ионна": {
        "translit": "ionna",
        "gender": "f",
        "genitive": "Ионны",
        "variants": [
            "ионна"
        ]
    },
    "Иосиф": {
        "translit": "iosif",
        "gender": "m",
        "genitive": "Иосифа",
        "variants": [
            "иосиф",
            "еся",
            "иосенька",
            "осенька",
            "ося"
        ]
    },
    "Ира": {
        "translit": "ira",
        "gender": "f",
        "genitive": "Иры",
        "variants": [
            "ира",
            "ирина",
            "иришка",
            "ирочка",
            "ируся"
        ]
    },
    "Ирада": {
        "translit": "irada",
        "gender": "f",
        "genitive": "Ирады",
        "variants": [
            "ирада"
        ]
    },
    "Ираида": {
        "translit": "iraida",
        "gender": "f",
        "genitive": "Ираиды",
        "variants": [
            "ираида"
        ]
    },
    "Ираклий": {
        "translit": "iraklij",
        "gender": "m",
        "genitive": "Ираклия",
        "variants": [
            "ираклий"
        ]
    },
    "Ирена": {
        "translit": "irenaa",
        "gender": "f",
        "genitive": "Ирены",
        "variants": [
            "ирена"
        ]
    },
    "Ирина": {
        "translit": "irina",
        "gender": "f",
        "genitive": "Ирины",
        "variants": [
            "ирина"
        ]
    },
    "Ирма": {
        "translit": "irma",
        "gender": "f",
        "genitive": "Ирмы",
        "variants": [
            "ирма"
        ]
    },
    "Ирода": {
        "translit": "iroda",
        "gender": "f",
        "genitive": "Ироды",
        "variants": [
            "ирода"
        ]
    },
    "Ирэн": {
        "translit": "iren",
        "gender": "f",
        "genitive": "Ирэн",
        "variants": [
            "ирэн"
        ]
    },
    "Ирэна": {
        "translit": "irena",
        "gender": "f",
        "genitive": "Ирэны",
        "variants": [
            "ирэна"
        ]
    },
    "Исидора": {
        "translit": "isidora",
        "gender": "f",
        "genitive": "Исидоры",
        "variants": [
            "исидора"
        ]
    },
    "Искандер": {
        "translit": "iskander",
        "gender": "m",
        "genitive": "Искандера",
        "variants": [
            "искандер"
        ]
    },
    "Искра": {
        "translit": "iskra",
        "gender": "f",
        "genitive": "Искры",
        "variants": [
            "искра",
            "Искорка"
        ]
    },
    "Ислам": {
        "translit": "islam",
        "gender": "m",
        "genitive": "Ислама",
        "variants": [
            "ислам"
        ]
    },
    "Исмаил": {
        "translit": "ismail",
        "gender": "m",
        "genitive": "Исмаила",
        "variants": [
            "исмаил"
        ]
    },
    "Ифа": {
        "translit": "ifa",
        "gender": "f",
        "genitive": "Ифы",
        "variants": [
            "ифа"
        ]
    },
    "Ия": {
        "translit": "iya",
        "gender": "f",
        "genitive": "Ии",
        "variants": [
            "ия",
            "иенька",
            "иечка"
        ]
    },
    "Каан-Даниэль": {
        "translit": "kaan-daniel",
        "gender": "m",
        "genitive": "Каан-Даниэля",
        "variants": [
            "каан-даниэль"
        ]
    },
    "Кабира": {
        "translit": "kabira",
        "gender": "f",
        "genitive": "Кабиры",
        "variants": [
            "кабира"
        ]
    },
    "Кадерлем": {
        "translit": "kaderlem",
        "gender": "f",
        "genitive": "Кадерлем",
        "variants": [
            "кадерлем"
        ]
    },
    "Кадрия": {
        "translit": "kadriya",
        "gender": "f",
        "genitive": "Кадрии",
        "variants": [
            "кадрия"
        ]
    },
    "Казимир": {
        "translit": "kazimir",
        "gender": "m",
        "genitive": "Казимира",
        "variants": [
            "казимир",
            "казенька",
            "казимирушка",
            "казимирчик",
            "казя"
        ]
    },
    "Кайни": {
        "translit": "kajni",
        "gender": "f",
        "genitive": "Кайни",
        "variants": [
            "кайни"
        ]
    },
    "Кайрат": {
        "translit": "kayrat",
        "gender": "m",
        "genitive": "Кайрата",
        "variants": [
            "кайрат"
        ]
    },
    "Каламкас": {
        "translit": "kalamkas",
        "gender": "f",
        "genitive": "Каламкас",
        "variants": [
            "каламкас"
        ]
    },
    "Калерия": {
        "translit": "kaleriya",
        "gender": "f",
        "genitive": "Калерии",
        "variants": [
            "калерия"
        ]
    },
    "Калипа": {
        "translit": "kalipa",
        "gender": "f",
        "genitive": "Калипы",
        "variants": [
            "калипа"
        ]
    },
    "Камал": {
        "translit": "kamal",
        "gender": "m",
        "genitive": "Камала",
        "variants": [
            "камал",
            "камалушка",
            "камалчик",
            "камальчик"
        ]
    },
    "Камил": {
        "translit": "kamil",
        "gender": "m",
        "genitive": "Камила",
        "variants": [
            "камил",
            "каля",
            "кама",
            "камилушка",
            "камиль"
        ]
    },
    "Камила": {
        "translit": "kamila",
        "gender": "f",
        "genitive": "Камилы",
        "variants": [
            "камила"
        ]
    },
    "Камилла": {
        "translit": "kamilla",
        "gender": "f",
        "genitive": "Камиллы",
        "variants": [
            "камилла",
            "камила",
            "камиллочка"
        ]
    },
    "Камиль": {
        "translit": "kamill",
        "gender": "m",
        "genitive": "Камиля",
        "variants": [
            "камиль"
        ]
    },
    "Камиля": {
        "translit": "kamilya",
        "gender": "f",
        "genitive": "Камилы",
        "variants": [
            "камиля"
        ]
    },
    "Камола": {
        "translit": "kamola",
        "gender": "f",
        "genitive": "Камолы",
        "variants": [
            "камола"
        ]
    },
    "Камшат": {
        "translit": "kamshat",
        "gender": "f",
        "genitive": "Камшат",
        "variants": [
            "камшат"
        ]
    },
    "Канат": {
        "translit": "kanat",
        "gender": "f",
        "genitive": "Канат",
        "variants": [
            "канат"
        ]
    },
    "Каныш": {
        "translit": "kanysh",
        "gender": "f",
        "genitive": "Каныш",
        "variants": [
            "каныш"
        ]
    },
    "Каракыз": {
        "translit": "karakyz",
        "gender": "f",
        "genitive": "Каракыз",
        "variants": [
            "каракыз"
        ]
    },
    "Карен": {
        "translit": "karen",
        "gender": "m",
        "genitive": "Карена",
        "variants": [
            "карен",
            "каренушка",
            "каренчик"
        ]
    },
    "Кареша": {
        "translit": "karesha",
        "gender": "f",
        "genitive": "Кареши",
        "variants": [
            "кареша"
        ]
    },
    "Карида": {
        "translit": "karida",
        "gender": "f",
        "genitive": "Карида",
        "variants": [
            "карида"
        ]
    },
    "Карим": {
        "translit": "karim",
        "gender": "m",
        "genitive": "Карима",
        "variants": [
            "карим",
            "карик",
            "каримушка",
            "каримчик",
            "каря"
        ]
    },
    "Карина": {
        "translit": "karina",
        "gender": "f",
        "genitive": "Карины",
        "variants": [
            "карина",
            "кариночка"
        ]
    },
    "Каринэ": {
        "translit": "karine",
        "gender": "f",
        "genitive": "Каринэ",
        "variants": [
            "каринэ"
        ]
    },
    "Карлыгаш": {
        "translit": "karlygash",
        "gender": "f",
        "genitive": "Карлыгаш",
        "variants": [
            "карлыгаш"
        ]
    },
    "Каролина": {
        "translit": "karolina",
        "gender": "f",
        "genitive": "Каролины",
        "variants": [
            "каролина",
            "каролиночка"
        ]
    },
    "Касиет": {
        "translit": "kasiet",
        "gender": "f",
        "genitive": "Касиеты",
        "variants": [
            "касиет"
        ]
    },
    "Каталея": {
        "translit": "kataleya",
        "gender": "f",
        "genitive": "Каталеи",
        "variants": [
            "каталея"
        ]
    },
    "Каталина": {
        "translit": "katalina",
        "gender": "f",
        "genitive": "Каталины",
        "variants": [
            "каталина"
        ]
    },
    "Катарина": {
        "translit": "katarina",
        "gender": "f",
        "genitive": "Катарины",
        "variants": [
            "катарина"
        ]
    },
    "Катидже": {
        "translit": "katidzhe",
        "gender": "f",
        "genitive": "Катиджи",
        "variants": [
            "катидже"
        ]
    },
    "Катя": {
        "translit": "katya",
        "gender": "f",
        "genitive": "Кати",
        "variants": [
            "катя",
            "екатерина",
            "катена",
            "катенька",
            "катюша"
        ]
    },
    "Каусар": {
        "translit": "kausar",
        "gender": "f",
        "genitive": "Каусар",
        "variants": [
            "каусар"
        ]
    },
    "Каусария": {
        "translit": "kausariya",
        "gender": "f",
        "genitive": "Каусарии",
        "variants": [
            "каусария"
        ]
    },
    "Кая": {
        "translit": "kaya",
        "gender": "f",
        "genitive": "Каи",
        "variants": [
            "кая"
        ]
    },
    "Кеворк": {
        "translit": "kevork",
        "gender": "m",
        "genitive": "Кеворка",
        "variants": [
            "кеворк"
        ]
    },
    "Кен": {
        "translit": "ken",
        "gender": "m",
        "genitive": "Кена",
        "variants": [
            "кен"
        ]
    },
    "Кенжегулге": {
        "translit": "kenzhegulge",
        "gender": "f",
        "genitive": "Кенжегулге",
        "variants": [
            "кенжегулге"
        ]
    },
    "Кенжегуль": {
        "translit": "kenzhegul",
        "gender": "f",
        "genitive": "Кенжегуль",
        "variants": [
            "кенжегуль"
        ]
    },
    "Керен": {
        "translit": "keren",
        "gender": "f",
        "genitive": "Керен",
        "variants": [
            "керен"
        ]
    },
    "Кетино": {
        "translit": "ketino",
        "gender": "f",
        "genitive": "Кетино",
        "variants": [
            "кетино"
        ]
    },
    "Кимберли": {
        "translit": "kimberli",
        "gender": "f",
        "genitive": "Кимберли",
        "variants": [
            "кимберли"
        ]
    },
    "Кир": {
        "translit": "kir",
        "gender": "m",
        "genitive": "Кира",
        "variants": [
            "кир",
            "кируня",
            "кируся",
            "кируша",
            "кирушка"
        ]
    },
    "Кира": {
        "translit": "kira",
        "gender": "f",
        "genitive": "Киры",
        "variants": [
            "кира",
            "кирочка",
            "кирюша"
        ]
    },
    "Кирилл": {
        "translit": "kirill",
        "gender": "m",
        "genitive": "Кирилла",
        "variants": [
            "кирилл",
            "кирочка",
            "кируша",
            "кирушка",
            "кирюша",
            "киря"
        ]
    },
    "Клава": {
        "translit": "klava",
        "gender": "f",
        "genitive": "Клавы",
        "variants": [
            "клава",
            "клавдия",
            "клавочка"
        ]
    },
    "Клавдия": {
        "translit": "klavdiya",
        "gender": "f",
        "genitive": "Клавдии",
        "variants": [
            "клавдия"
        ]
    },
    "Клара": {
        "translit": "klara",
        "gender": "f",
        "genitive": "Клары",
        "variants": [
            "клара",
            "кларочка",
            "лара",
            "ларочка"
        ]
    },
    "Клена": {
        "translit": "klena",
        "gender": "f",
        "genitive": "Клены",
        "variants": [
            "клена"
        ]
    },
    "Клим": {
        "translit": "klim",
        "gender": "m",
        "genitive": "Клима",
        "variants": [
            "клим"
        ]
    },
    "Клэр": {
        "translit": "kler",
        "gender": "f",
        "genitive": "Клэр",
        "variants": [
            "клэр"
        ]
    },
    "Коля": {
        "translit": "kolya",
        "gender": "m",
        "genitive": "Коли",
        "variants": [
            "коля",
            "коленька",
            "колечка",
            "колюня",
            "коляша",
            "ник",
            "николай"
        ]
    },
    "Корина": {
        "translit": "korina",
        "gender": "f",
        "genitive": "Корины",
        "variants": [
            "корина"
        ]
    },
    "Кормак": {
        "translit": "kormak",
        "gender": "m",
        "genitive": "Кормака",
        "variants": [
            "кормак"
        ]
    },
    "Костя": {
        "translit": "kostya",
        "gender": "m",
        "genitive": "Кости",
        "variants": [
            "костя",
            "константин",
            "костенька",
            "костик",
            "костюша",
            "костян"
        ]
    },
    "Кремена": {
        "translit": "kremena",
        "gender": "f",
        "genitive": "Кремены",
        "variants": [
            "кремена"
        ]
    },
    "Крис": {
        "translit": "kris",
        "gender": "m",
        "genitive": "Криса",
        "variants": [
            "крис"
        ]
    },
    "Кристиан": {
        "translit": "kristian",
        "gender": "m",
        "genitive": "Кристиана",
        "variants": [
            "кристиан",
            "кристианушка",
            "кристик",
            "кристя"
        ]
    },
    "Кристина": {
        "translit": "kristina",
        "gender": "f",
        "genitive": "Кристины",
        "variants": [
            "кристина",
            "кристиночка"
        ]
    },
    "Кристофер": {
        "translit": "kristofer",
        "gender": "m",
        "genitive": "Кристофера",
        "variants": [
            "кристофер"
        ]
    },
    "Ксения": {
        "translit": "kseniya",
        "gender": "f",
        "genitive": "Ксении",
        "variants": [
            "ксения"
        ]
    },
    "Ксюша": {
        "translit": "ksyusha",
        "gender": "f",
        "genitive": "Ксюши",
        "variants": [
            "ксюша",
            "ксения",
            "ксюшенька",
            "ксюшечка"
        ]
    },
    "Кудрят": {
        "translit": "kudryat",
        "gender": "f",
        "genitive": "Кудрят",
        "variants": [
            "кудрят"
        ]
    },
    "Кузьма": {
        "translit": "kuzma",
        "gender": "m",
        "genitive": "Кузьмы",
        "variants": [
            "кузьма",
            "кузенька",
            "кузька",
            "кузя",
            "кузяша"
        ]
    },
    "Куляим": {
        "translit": "kulyaim",
        "gender": "f",
        "genitive": "Куляим",
        "variants": [
            "куляим"
        ]
    },
    "Кулян": {
        "translit": "kulyan",
        "gender": "f",
        "genitive": "Кулян",
        "variants": [
            "кулян"
        ]
    },
    "Кумар": {
        "translit": "kumar",
        "gender": "f",
        "genitive": "Кумар",
        "variants": [
            "кумар"
        ]
    },
    "Кундуз": {
        "translit": "kunduz",
        "gender": "f",
        "genitive": "Кундуз",
        "variants": [
            "кундуз"
        ]
    },
    "Кундыз": {
        "translit": "kundyz",
        "gender": "f",
        "genitive": "Кундыз",
        "variants": [
            "кундыз"
        ]
    },
    "Куралай": {
        "translit": "kuralaj",
        "gender": "f",
        "genitive": "Куралай",
        "variants": [
            "куралай"
        ]
    },
    "Кыздар": {
        "translit": "kyzdar",
        "gender": "f",
        "genitive": "Кыздар",
        "variants": [
            "кыздар"
        ]
    },
    "Кэтрин": {
        "translit": "ketrin",
        "gender": "f",
        "genitive": "Кэтрин",
        "variants": [
            "кэтрин"
        ]
    },
    "Лавиника": {
        "translit": "lavinika",
        "gender": "f",
        "genitive": "Лавиники",
        "variants": [
            "лавиника"
        ]
    },
    "Лавр": {
        "translit": "lavr",
        "gender": "m",
        "genitive": "Лавра",
        "variants": [
            "лавр",
            "лаврентий",
            "лаврик",
            "лавруша",
            "лаврушка"
        ]
    },
    "Лаврентий": {
        "translit": "lavrentiy",
        "gender": "m",
        "genitive": "Лаврентия",
        "variants": [
            "лаврентий"
        ]
    },
    "Лада": {
        "translit": "lada",
        "gender": "f",
        "genitive": "Лады",
        "variants": [
            "лада",
            "ладочка"
        ]
    },
    "Лайля": {
        "translit": "lajlya",
        "gender": "f",
        "genitive": "Лайли",
        "variants": [
            "лайля"
        ]
    },
    "Лайне": {
        "translit": "lajne",
        "gender": "f",
        "genitive": "Лайны",
        "variants": [
            "лайне"
        ]
    },
    "Лала": {
        "translit": "lala",
        "gender": "f",
        "genitive": "Лалы",
        "variants": [
            "лала"
        ]
    },
    "Лалена": {
        "translit": "lalena",
        "gender": "f",
        "genitive": "Лалены",
        "variants": [
            "лалена"
        ]
    },
    "Лалина": {
        "translit": "lalina",
        "gender": "f",
        "genitive": "Лалины",
        "variants": [
            "лалина"
        ]
    },
    "Лана": {
        "translit": "lana",
        "gender": "f",
        "genitive": "Ланы",
        "variants": [
            "лана"
        ]
    },
    "Лара": {
        "translit": "lara",
        "gender": "f",
        "genitive": "Лары",
        "variants": [
            "лара",
            "Ларочка"
        ]
    },
    "Лариса": {
        "translit": "larisa",
        "gender": "f",
        "genitive": "Ларисы",
        "variants": [
            "лариса",
            "лара",
            "ларисочка",
            "ларочка"
        ]
    },
    "Лаура": {
        "translit": "laurra",
        "gender": "f",
        "genitive": "Лауры",
        "variants": [
            "лаура"
        ]
    },
    "Лаша": {
        "translit": "lasha",
        "gender": "m",
        "genitive": "Лаши",
        "variants": [
            "лаша"
        ]
    },
    "Леброн": {
        "translit": "lebron",
        "gender": "m",
        "genitive": "Леброна",
        "variants": [
            "леброн"
        ]
    },
    "Лев": {
        "translit": "lev",
        "gender": "m",
        "genitive": "Льва",
        "variants": [
            "лев",
            "лева",
            "левик",
            "левочка",
            "левушка"
        ]
    },
    "Левон": {
        "translit": "levon",
        "gender": "m",
        "genitive": "Левона",
        "variants": [
            "левон"
        ]
    },
    "Лейла": {
        "translit": "lejla",
        "gender": "f",
        "genitive": "Лейлы",
        "variants": [
            "лейла"
        ]
    },
    "Лейсан": {
        "translit": "lejsan",
        "gender": "f",
        "genitive": "Лейсан",
        "variants": [
            "лейсан"
        ]
    },
    "Лейсана": {
        "translit": "lejsana",
        "gender": "f",
        "genitive": "Лейсаны",
        "variants": [
            "лейсана"
        ]
    },
    "Лела": {
        "translit": "lela",
        "gender": "f",
        "genitive": "Лелы",
        "variants": [
            "лела"
        ]
    },
    "Леля": {
        "translit": "lelya",
        "gender": "f",
        "genitive": "Лели",
        "variants": [
            "леля"
        ]
    },
    "Лен": {
        "translit": "len",
        "gender": "m",
        "genitive": "Лена",
        "variants": [
            "лен"
        ]
    },
    "Лена": {
        "translit": "lena",
        "gender": "f",
        "genitive": "Лены",
        "variants": [
            "лена",
            "аленка",
            "аленушка",
            "елена",
            "леночка",
            "ленуся"
        ]
    },
    "Ленара": {
        "translit": "lenara",
        "gender": "f",
        "genitive": "Ленары",
        "variants": [
            "ленара"
        ]
    },
    "Лениана": {
        "translit": "leniana",
        "gender": "f",
        "genitive": "Ленианы",
        "variants": [
            "лениана"
        ]
    },
    "Лениара": {
        "translit": "leniara",
        "gender": "f",
        "genitive": "Лениары",
        "variants": [
            "лениара"
        ]
    },
    "Лениза": {
        "translit": "leniza",
        "gender": "f",
        "genitive": "Ленизы",
        "variants": [
            "лениза"
        ]
    },
    "Лео": {
        "translit": "leo",
        "gender": "m",
        "genitive": "Лео",
        "variants": [
            "лео"
        ]
    },
    "Леон": {
        "translit": "leon",
        "gender": "m",
        "genitive": "Леона",
        "variants": [
            "леон",
            "ленчик",
            "лео",
            "леонушка",
            "леончик"
        ]
    },
    "Леона": {
        "translit": "leona",
        "gender": "f",
        "genitive": "Леоны",
        "variants": [
            "леона"
        ]
    },
    "Леонард": {
        "translit": "leonard",
        "gender": "m",
        "genitive": "Леонарда",
        "variants": [
            "леонард"
        ]
    },
    "Леонид": {
        "translit": "leonid",
        "gender": "m",
        "genitive": "Леонида",
        "variants": [
            "леонид",
            "ленечка",
            "ленчик",
            "ленюся",
            "леня",
            "леонидушка"
        ]
    },
    "Леонида": {
        "translit": "leonida",
        "gender": "f",
        "genitive": "Леониды",
        "variants": [
            "леонида"
        ]
    },
    "Леонэль": {
        "translit": "leonel",
        "gender": "m",
        "genitive": "Леонэля",
        "variants": [
            "леонэль"
        ]
    },
    "Леопольд": {
        "translit": "leopold",
        "gender": "m",
        "genitive": "Леопольда",
        "variants": [
            "леопольд",
            "леопольдик",
            "леопольдушка"
        ]
    },
    "Лера": {
        "translit": "lera",
        "gender": "f",
        "genitive": "Леры",
        "variants": [
            "лера",
            "валерия",
            "лерочка"
        ]
    },
    "Леся": {
        "translit": "lesya",
        "gender": "f",
        "genitive": "Леси",
        "variants": [
            "леся",
            "лесенька"
        ]
    },
    "Лея": {
        "translit": "leya",
        "gender": "f",
        "genitive": "Леи",
        "variants": [
            "лея"
        ]
    },
    "Лиам": {
        "translit": "liam",
        "gender": "m",
        "genitive": "Лиама",
        "variants": [
            "лиам"
        ]
    },
    "Лиана": {
        "translit": "liana",
        "gender": "f",
        "genitive": "Лианы",
        "variants": [
            "лиана",
            "лианочка"
        ]
    },
    "Либи": {
        "translit": "libi",
        "gender": "m",
        "genitive": "Либи",
        "variants": [
            "либи"
        ]
    },
    "Лида": {
        "translit": "lida",
        "gender": "f",
        "genitive": "Лиды",
        "variants": [
            "лида",
            "лидия",
            "лидочка"
        ]
    },
    "Лидия": {
        "translit": "lidiya",
        "gender": "f",
        "genitive": "Лидии",
        "variants": [
            "лидия"
        ]
    },
    "Лиза": {
        "translit": "liza",
        "gender": "f",
        "genitive": "Лизы",
        "variants": [
            "лиза",
            "елизавета",
            "лизонька",
            "лизочка",
            "лизуша",
            "лилечка"
        ]
    },
    "Лили": {
        "translit": "lili",
        "gender": "f",
        "genitive": "Лили",
        "variants": [
            "лили",
            "лиличка"
        ]
    },
    "Лилиана": {
        "translit": "liliana",
        "gender": "f",
        "genitive": "Лилианы",
        "variants": [
            "лилиана"
        ]
    },
    "Лилианна": {
        "translit": "lilianna",
        "gender": "f",
        "genitive": "Лилианны",
        "variants": [
            "лилианна"
        ]
    },
    "Лилико": {
        "translit": "liliko",
        "gender": "f",
        "genitive": "Лилико",
        "variants": [
            "лилико"
        ]
    },
    "Лилит": {
        "translit": "lilit",
        "gender": "f",
        "genitive": "Лилит",
        "variants": [
            "лилит",
            "Лика",
            "Ликуся"
        ]
    },
    "Лилия": {
        "translit": "liliya",
        "gender": "f",
        "genitive": "Лилии",
        "variants": [
            "лилия",
            "лиенька",
            "лилечка",
            "лилочка"
        ]
    },
    "Лилу": {
        "translit": "lilu",
        "gender": "f",
        "genitive": "Лилу",
        "variants": [
            "лилу"
        ]
    },
    "Лиля": {
        "translit": "lilj",
        "gender": "f",
        "genitive": "Лили",
        "variants": [
            "лиля"
        ]
    },
    "Лина": {
        "translit": "lina",
        "gender": "f",
        "genitive": "Лины",
        "variants": [
            "лина",
            "линочка"
        ]
    },
    "Линара": {
        "translit": "linara",
        "gender": "f",
        "genitive": "Линары",
        "variants": [
            "линара"
        ]
    },
    "Линда": {
        "translit": "linda",
        "gender": "f",
        "genitive": "Линды",
        "variants": [
            "линда"
        ]
    },
    "Лиор": {
        "translit": "lior",
        "gender": "m",
        "genitive": "Лиора",
        "variants": [
            "лиор"
        ]
    },
    "Лира": {
        "translit": "lira",
        "gender": "f",
        "genitive": "Лиры",
        "variants": [
            "лира"
        ]
    },
    "Лиса": {
        "translit": "lisa",
        "gender": "f",
        "genitive": "Лисы",
        "variants": [
            "лиса"
        ]
    },
    "Лиэль": {
        "translit": "liel",
        "gender": "f",
        "genitive": "Лиэли",
        "variants": [
            "лиэль"
        ]
    },
    "Лия": {
        "translit": "liya",
        "gender": "f",
        "genitive": "Лии",
        "variants": [
            "лия"
        ]
    },
    "Лола": {
        "translit": "lola",
        "gender": "f",
        "genitive": "Лолы",
        "variants": [
            "лола"
        ]
    },
    "Лолита": {
        "translit": "lolita",
        "gender": "f",
        "genitive": "Лолиты",
        "variants": [
            "лолита"
        ]
    },
    "Лора": {
        "translit": "lora",
        "gender": "f",
        "genitive": "Лоры",
        "variants": [
            "лора"
        ]
    },
    "Лоретта": {
        "translit": "loretta",
        "gender": "f",
        "genitive": "Лоретты",
        "variants": [
            "лоретта"
        ]
    },
    "Луиза": {
        "translit": "luisa",
        "gender": "f",
        "genitive": "Луизы",
        "variants": [
            "луиза"
        ]
    },
    "Луис": {
        "translit": "luis",
        "gender": "m",
        "genitive": "Луиса",
        "variants": [
            "луис"
        ]
    },
    "Лука": {
        "translit": "luka",
        "gender": "m",
        "genitive": "Луки",
        "variants": [
            "лука",
            "лукаша",
            "лукашенька",
            "лукашечка",
            "лукиан"
        ]
    },
    "Лукас": {
        "translit": "lukas",
        "gender": "m",
        "genitive": "Лукаса",
        "variants": [
            "лукас"
        ]
    },
    "Лукерия": {
        "translit": "lukeriya",
        "gender": "f",
        "genitive": "Лукерии",
        "variants": [
            "лукерия"
        ]
    },
    "Лукьян": {
        "translit": "lukyan",
        "gender": "m",
        "genitive": "Лукьяна",
        "variants": [
            "лукьян",
            "лука",
            "лукьянушка",
            "лукьянчик"
        ]
    },
    "Лунара": {
        "translit": "lunara",
        "gender": "f",
        "genitive": "Лунары",
        "variants": [
            "лунара"
        ]
    },
    "Лура": {
        "translit": "lura",
        "gender": "f",
        "genitive": "Луры",
        "variants": [
            "лура"
        ]
    },
    "Лусине": {
        "translit": "lusine",
        "gender": "f",
        "genitive": "Лусине",
        "variants": [
            "лусине"
        ]
    },
    "Лутфулло": {
        "translit": "lutfullo",
        "gender": "f",
        "genitive": "Лутфулло",
        "variants": [
            "лутфулло"
        ]
    },
    "Лучик": {
        "translit": "luchik",
        "gender": "m",
        "genitive": "Лучика",
        "variants": [
            "лучик"
        ]
    },
    "Лучия": {
        "translit": "luchiya",
        "gender": "f",
        "genitive": "Лучии",
        "variants": [
            "лучия"
        ]
    },
    "Люба": {
        "translit": "lyuba",
        "gender": "f",
        "genitive": "Любы",
        "variants": [
            "люба",
            "любава",
            "любаша",
            "любовь",
            "любочка",
            "люся"
        ]
    },
    "Любовь": {
        "translit": "lyubov",
        "gender": "f",
        "genitive": "Любови",
        "variants": [
            "любовь"
        ]
    },
    "Люда": {
        "translit": "lyuda",
        "gender": "f",
        "genitive": "Люды",
        "variants": [
            "люда",
            "людмила",
            "людочка"
        ]
    },
    "Людмила": {
        "translit": "lyudmila",
        "gender": "f",
        "genitive": "Людмилы",
        "variants": [
            "людмила"
        ]
    },
    "Люзия": {
        "translit": "lyuziya",
        "gender": "f",
        "genitive": "Люзии",
        "variants": [
            "люзия"
        ]
    },
    "Люси": {
        "translit": "lyusi",
        "gender": "f",
        "genitive": "Люси",
        "variants": [
            "люси"
        ]
    },
    "Люсинэ": {
        "translit": "lyusine",
        "gender": "f",
        "genitive": "Люсинэ",
        "variants": [
            "люсинэ"
        ]
    },
    "Люция": {
        "translit": "lyuciya",
        "gender": "f",
        "genitive": "Люции",
        "variants": [
            "люция"
        ]
    },
    "Лязат": {
        "translit": "lyazat",
        "gender": "f",
        "genitive": "Лязат",
        "variants": [
            "лязат"
        ]
    },
    "Ляззат": {
        "translit": "lyazzat",
        "gender": "f",
        "genitive": "Ляззат",
        "variants": [
            "ляззат"
        ]
    },
    "Ляиза": {
        "translit": "lyaiza",
        "gender": "f",
        "genitive": "Ляизы",
        "variants": [
            "ляиза"
        ]
    },
    "Ляйля": {
        "translit": "lyajlya",
        "gender": "f",
        "genitive": "Ляйли",
        "variants": [
            "ляйля"
        ]
    },
    "Ляйсан": {
        "translit": "leysan",
        "gender": "f",
        "genitive": "Ляйсан",
        "variants": [
            "ляйсан"
        ]
    },
    "Ляля": {
        "translit": "lyalya",
        "gender": "f",
        "genitive": "Ляли",
        "variants": [
            "ляля"
        ]
    },
    "Ляман": {
        "translit": "lyaman",
        "gender": "m",
        "genitive": "Лямана",
        "variants": [
            "ляман"
        ]
    },
    "Ляна": {
        "translit": "lyna",
        "gender": "f",
        "genitive": "Ляны",
        "variants": [
            "ляна"
        ]
    },
    "Лёша": {
        "translit": "lesha",
        "gender": "m",
        "genitive": "Лёши",
        "variants": [
            "лёша",
            "алексей",
            "алеша",
            "алешенька",
            "леха",
            "лешенька"
        ]
    },
    "Мавлюда": {
        "translit": "mavlyuda",
        "gender": "f",
        "genitive": "Мавлюды",
        "variants": [
            "мавлюда"
        ]
    },
    "Магамед": {
        "translit": "magamed",
        "gender": "m",
        "genitive": "Магамеда",
        "variants": [
            "магамед"
        ]
    },
    "Магдалена": {
        "translit": "magdalena",
        "gender": "f",
        "genitive": "Магдалены",
        "variants": [
            "магдалена"
        ]
    },
    "Магдалина": {
        "translit": "magdalina",
        "gender": "f",
        "genitive": "Магдалины",
        "variants": [
            "магдалина",
            "магдалиночка"
        ]
    },
    "Магинора": {
        "translit": "maginora",
        "gender": "f",
        "genitive": "Магиноры",
        "variants": [
            "магинора"
        ]
    },
    "Магомед": {
        "translit": "magomed",
        "gender": "m",
        "genitive": "Магомеда",
        "variants": [
            "магомед"
        ]
    },
    "Мадина": {
        "translit": "madina",
        "gender": "f",
        "genitive": "Мадины",
        "variants": [
            "мадина"
        ]
    },
    "Мадинна": {
        "translit": "madinna",
        "gender": "f",
        "genitive": "Мадинны",
        "variants": [
            "мадинна"
        ]
    },
    "Мадлен": {
        "translit": "madlen",
        "gender": "m",
        "genitive": "Мадлены",
        "variants": [
            "мадлен",
            "мадленочка"
        ]
    },
    "Мажена": {
        "translit": "mazhena",
        "gender": "f",
        "genitive": "Мажены",
        "variants": [
            "мажена"
        ]
    },
    "Маик": {
        "translit": "maik",
        "gender": "m",
        "genitive": "Маика",
        "variants": [
            "маик"
        ]
    },
    "Маиса": {
        "translit": "maisa",
        "gender": "f",
        "genitive": "Маисы",
        "variants": [
            "маиса"
        ]
    },
    "Майгуль": {
        "translit": "majgul",
        "gender": "f",
        "genitive": "Майгуль",
        "variants": [
            "майгуль"
        ]
    },
    "Майкл": {
        "translit": "majkl",
        "gender": "m",
        "genitive": "Майкла",
        "variants": [
            "майкл"
        ]
    },
    "Майра": {
        "translit": "majra",
        "gender": "f",
        "genitive": "Майры",
        "variants": [
            "майра"
        ]
    },
    "Майрамгул": {
        "translit": "majramgul",
        "gender": "f",
        "genitive": "Майрамгул",
        "variants": [
            "майрамгул"
        ]
    },
    "Майя": {
        "translit": "majya",
        "gender": "f",
        "genitive": "Майи",
        "variants": [
            "майя",
            "майечка"
        ]
    },
    "Макар": {
        "translit": "makar",
        "gender": "m",
        "genitive": "Макара",
        "variants": [
            "макар",
            "макарка",
            "макарушка",
            "макарчик",
            "макаша",
            "макашенька"
        ]
    },
    "Макия": {
        "translit": "makiya",
        "gender": "f",
        "genitive": "Макии",
        "variants": [
            "макия"
        ]
    },
    "Макка": {
        "translit": "makka",
        "gender": "f",
        "genitive": "Макки",
        "variants": [
            "макка"
        ]
    },
    "Макка-Мадина": {
        "translit": "makka-madina",
        "gender": "f",
        "genitive": "Макка-Мадины",
        "variants": [
            "макка-мадина"
        ]
    },
    "Маккахан": {
        "translit": "makkahan",
        "gender": "f",
        "genitive": "Маккахан",
        "variants": [
            "маккахан"
        ]
    },
    "Макпал": {
        "translit": "makpal",
        "gender": "f",
        "genitive": "Макпал",
        "variants": [
            "макпал"
        ]
    },
    "Максим": {
        "translit": "maksim",
        "gender": "m",
        "genitive": "Максима",
        "variants": [
            "максим",
            "макс",
            "максик",
            "максимка",
            "максимчик"
        ]
    },
    "Максимильян": {
        "translit": "maksimilyan",
        "gender": "m",
        "genitive": "Максимильяна",
        "variants": [
            "максимильян",
            "макс",
            "максик",
            "максимильянушка",
            "максимильянчик"
        ]
    },
    "Максуда": {
        "translit": "maksuda",
        "gender": "f",
        "genitive": "Максуды",
        "variants": [
            "максуда"
        ]
    },
    "Максут": {
        "translit": "maksut",
        "gender": "f",
        "genitive": "Максут",
        "variants": [
            "максут"
        ]
    },
    "Мактина": {
        "translit": "maktina",
        "gender": "f",
        "genitive": "Мактины",
        "variants": [
            "мактина"
        ]
    },
    "Малик": {
        "translit": "malik",
        "gender": "m",
        "genitive": "Малика",
        "variants": [
            "малик"
        ]
    },
    "Малика": {
        "translit": "malilka",
        "gender": "f",
        "genitive": "Малики",
        "variants": [
            "малика"
        ]
    },
    "Малохат": {
        "translit": "malohat",
        "gender": "f",
        "genitive": "Малохат",
        "variants": [
            "малохат"
        ]
    },
    "Мама": {
        "translit": "mama",
        "gender": "f",
        "genitive": "Мамы",
        "variants": [
            "мама"
        ]
    },
    "Мамура": {
        "translit": "mamura",
        "gender": "f",
        "genitive": "Мамуры",
        "variants": [
            "мамура"
        ]
    },
    "Манана": {
        "translit": "manana",
        "gender": "f",
        "genitive": "Мананы",
        "variants": [
            "манана"
        ]
    },
    "Манзура": {
        "translit": "manzura",
        "gender": "f",
        "genitive": "Манзуры",
        "variants": [
            "манзура"
        ]
    },
    "Манижа": {
        "translit": "manizha",
        "gender": "f",
        "genitive": "Манижи",
        "variants": [
            "манижа"
        ]
    },
    "Мансур": {
        "translit": "mansur",
        "gender": "m",
        "genitive": "Мансура",
        "variants": [
            "мансур"
        ]
    },
    "Маншук": {
        "translit": "manshuk",
        "gender": "f",
        "genitive": "Маншук",
        "variants": [
            "маншук"
        ]
    },
    "Мара": {
        "translit": "mara",
        "gender": "f",
        "genitive": "Мары",
        "variants": [
            "мара"
        ]
    },
    "Марал": {
        "translit": "maral",
        "gender": "f",
        "genitive": "Марал",
        "variants": [
            "марал"
        ]
    },
    "Марат": {
        "translit": "marat",
        "gender": "m",
        "genitive": "Марата",
        "variants": [
            "марат"
        ]
    },
    "Маргарита": {
        "translit": "margarita",
        "gender": "f",
        "genitive": "Маргариты",
        "variants": [
            "маргарита",
            "маргариточка",
            "марго",
            "маргоша"
        ]
    },
    "Марго": {
        "translit": "margo",
        "gender": "f",
        "genitive": "Марго",
        "variants": [
            "марго"
        ]
    },
    "Марета": {
        "translit": "mareta",
        "gender": "f",
        "genitive": "Мареты",
        "variants": [
            "марета"
        ]
    },
    "Маржан": {
        "translit": "marzhan",
        "gender": "f",
        "genitive": "Маржан",
        "variants": [
            "маржан"
        ]
    },
    "Маржана": {
        "translit": "marzhana",
        "gender": "f",
        "genitive": "Маржаны",
        "variants": [
            "маржана"
        ]
    },
    "Марзи": {
        "translit": "marzi",
        "gender": "f",
        "genitive": "Марзи",
        "variants": [
            "марзи"
        ]
    },
    "Мариам": {
        "translit": "mariam",
        "gender": "f",
        "genitive": "Мариам",
        "variants": [
            "мариам"
        ]
    },
    "Марианна": {
        "translit": "marianna",
        "gender": "f",
        "genitive": "Марианы",
        "variants": [
            "марианна",
            "марианночка"
        ]
    },
    "Марика": {
        "translit": "marika",
        "gender": "f",
        "genitive": "Марики",
        "variants": [
            "марика"
        ]
    },
    "Марина": {
        "translit": "marina",
        "gender": "f",
        "genitive": "Марины",
        "variants": [
            "марина",
            "мариночка",
            "мариша"
        ]
    },
    "Маричель": {
        "translit": "marichel",
        "gender": "f",
        "genitive": "Маричель",
        "variants": [
            "маричель"
        ]
    },
    "Мариэта": {
        "translit": "marieta",
        "gender": "f",
        "genitive": "Мариэты",
        "variants": [
            "мариэта"
        ]
    },
    "Мариэтта": {
        "translit": "marietta",
        "gender": "f",
        "genitive": "Мариэтты",
        "variants": [
            "мариэтта"
        ]
    },
    "Мария": {
        "translit": "mariya",
        "gender": "f",
        "genitive": "Марии",
        "variants": [
            "мария"
        ]
    },
    "Мариям": {
        "translit": "mariyam",
        "gender": "f",
        "genitive": "Мариям",
        "variants": [
            "мариям"
        ]
    },
    "Марк": {
        "translit": "mark",
        "gender": "m",
        "genitive": "Марка",
        "variants": [
            "марк",
            "марик",
            "маркуша",
            "маркушечка"
        ]
    },
    "Марсель": {
        "translit": "marsel",
        "gender": "m",
        "genitive": "Марселя",
        "variants": [
            "марсель",
            "марс",
            "марселька",
            "марселюшка",
            "марся"
        ]
    },
    "Марта": {
        "translit": "marta",
        "gender": "f",
        "genitive": "Марты",
        "variants": [
            "марта",
            "марточка"
        ]
    },
    "Мартин": {
        "translit": "martin",
        "gender": "m",
        "genitive": "Мартина",
        "variants": [
            "мартин",
            "мартиня",
            "мартын",
            "мартюня",
            "мартюха"
        ]
    },
    "Мартина": {
        "translit": "martina",
        "gender": "f",
        "genitive": "Мартины",
        "variants": [
            "мартина"
        ]
    },
    "Маруся": {
        "translit": "marusya",
        "gender": "f",
        "genitive": "Маруси",
        "variants": [
            "маруся"
        ]
    },
    "Марфа": {
        "translit": "marfa",
        "gender": "f",
        "genitive": "Марфы",
        "variants": [
            "марфа",
            "марфочка",
            "марфуша"
        ]
    },
    "Марья": {
        "translit": "marya",
        "gender": "f",
        "genitive": "Марьи",
        "variants": [
            "марья"
        ]
    },
    "Марьям": {
        "translit": "marjyam",
        "gender": "f",
        "genitive": "Марьям",
        "variants": [
            "марьям",
            "Мариам"
        ]
    },
    "Марьяна": {
        "translit": "maryana",
        "gender": "f",
        "genitive": "Марьяны",
        "variants": [
            "марьяна",
            "мартяночка",
            "марьяша"
        ]
    },
    "Матвей": {
        "translit": "matvej",
        "gender": "m",
        "genitive": "Матвея",
        "variants": [
            "матвей",
            "матвейка",
            "матвеюшка",
            "матюха",
            "матя",
            "мотя"
        ]
    },
    "Матильда": {
        "translit": "matilda",
        "gender": "f",
        "genitive": "Матильды",
        "variants": [
            "матильда",
            "матильдочка"
        ]
    },
    "Матлюба": {
        "translit": "matlyuba",
        "gender": "f",
        "genitive": "Матлюбы",
        "variants": [
            "матлюба"
        ]
    },
    "Матрена": {
        "translit": "matrena",
        "gender": "f",
        "genitive": "Матрены",
        "variants": [
            "матрена"
        ]
    },
    "Матэ": {
        "translit": "mate",
        "gender": "m",
        "genitive": "Матэ",
        "variants": [
            "матэ"
        ]
    },
    "Мауриза": {
        "translit": "mauriza",
        "gender": "f",
        "genitive": "Мауризы",
        "variants": [
            "мауриза"
        ]
    },
    "Махабат": {
        "translit": "mahabat",
        "gender": "f",
        "genitive": "Махабат",
        "variants": [
            "махабат"
        ]
    },
    "Махаббат": {
        "translit": "mahabbat",
        "gender": "f",
        "genitive": "Махаббат",
        "variants": [
            "махаббат"
        ]
    },
    "Махмуд": {
        "translit": "mahmud",
        "gender": "m",
        "genitive": "Махмуда",
        "variants": [
            "махмуд",
            "мухаммад",
            "хамид"
        ]
    },
    "Маша": {
        "translit": "masha",
        "gender": "f",
        "genitive": "Маши",
        "variants": [
            "маша",
            "манечка",
            "манюта",
            "мариша",
            "мария",
            "маруся",
            "машенька",
            "машуня"
        ]
    },
    "Мая": {
        "translit": "maya",
        "gender": "f",
        "genitive": "Маи",
        "variants": [
            "мая",
            "маечка"
        ]
    },
    "Мевагул": {
        "translit": "mevagul",
        "gender": "f",
        "genitive": "Мевагул",
        "variants": [
            "мевагул"
        ]
    },
    "Медина": {
        "translit": "medina",
        "gender": "f",
        "genitive": "Медины",
        "variants": [
            "медина"
        ]
    },
    "Мейрамгул": {
        "translit": "mejramgul",
        "gender": "f",
        "genitive": "Мейрамгул",
        "variants": [
            "мейрамгул"
        ]
    },
    "Мелания": {
        "translit": "melaniya",
        "gender": "f",
        "genitive": "Мелании",
        "variants": [
            "мелания"
        ]
    },
    "Мелек": {
        "translit": "melek",
        "gender": "f",
        "genitive": "Мелек",
        "variants": [
            "мелек"
        ]
    },
    "Мелисса": {
        "translit": "melissa",
        "gender": "f",
        "genitive": "Мелиссы",
        "variants": [
            "мелисса",
            "мелиссонька"
        ]
    },
    "Мендигуль": {
        "translit": "mendigul",
        "gender": "f",
        "genitive": "Мендигуль",
        "variants": [
            "мендигуль"
        ]
    },
    "Мерджен": {
        "translit": "merdzhen",
        "gender": "f",
        "genitive": "Мерджен",
        "variants": [
            "мерджен"
        ]
    },
    "Мерей": {
        "translit": "merej",
        "gender": "f",
        "genitive": "Мерей",
        "variants": [
            "мерей"
        ]
    },
    "Мереке": {
        "translit": "mereke",
        "gender": "f",
        "genitive": "Мереке",
        "variants": [
            "мереке"
        ]
    },
    "Мери": {
        "translit": "merii",
        "gender": "f",
        "genitive": "Мери",
        "variants": [
            "мери"
        ]
    },
    "Мериван": {
        "translit": "merivan",
        "gender": "f",
        "genitive": "Мериван",
        "variants": [
            "мериван"
        ]
    },
    "Мерседес": {
        "translit": "mersedes",
        "gender": "f",
        "genitive": "Мерседес",
        "variants": [
            "мерседес"
        ]
    },
    "Меруерт": {
        "translit": "meruert",
        "gender": "f",
        "genitive": "Меруерт",
        "variants": [
            "меруерт"
        ]
    },
    "Мехрангез": {
        "translit": "mekhrangez",
        "gender": "f",
        "genitive": "Мехрангез",
        "variants": [
            "мехрангез"
        ]
    },
    "Мехрнигор": {
        "translit": "mekhrnigor",
        "gender": "f",
        "genitive": "Мехрнигор",
        "variants": [
            "мехрнигор"
        ]
    },
    "Миа": {
        "translit": "mia",
        "gender": "f",
        "genitive": "Мии",
        "variants": [
            "миа"
        ]
    },
    "Мигель": {
        "translit": "migel",
        "gender": "m",
        "genitive": "Мигеля",
        "variants": [
            "мигель"
        ]
    },
    "Мидина": {
        "translit": "midina",
        "gender": "f",
        "genitive": "Мидины",
        "variants": [
            "мидина"
        ]
    },
    "Микаэл": {
        "translit": "mikael",
        "gender": "m",
        "genitive": "Микаэла",
        "variants": [
            "микаэл"
        ]
    },
    "Микаэла": {
        "translit": "mikaela",
        "gender": "f",
        "genitive": "Микаэлы",
        "variants": [
            "микаэла",
            "микаэлочка"
        ]
    },
    "Микаэль": {
        "translit": "mikael",
        "gender": "m",
        "genitive": "Микаэля",
        "variants": [
            "микаэль"
        ]
    },
    "Микая": {
        "translit": "mikaya",
        "gender": "f",
        "genitive": "Микаи",
        "variants": [
            "микая"
        ]
    },
    "Мила": {
        "translit": "mila",
        "gender": "f",
        "genitive": "Милы",
        "variants": [
            "мила",
            "милочка"
        ]
    },
    "Милада": {
        "translit": "milada",
        "gender": "f",
        "genitive": "Милады",
        "variants": [
            "милада"
        ]
    },
    "Милан": {
        "translit": "milan",
        "gender": "m",
        "genitive": "Милана",
        "variants": [
            "милан",
            "миланушка",
            "миланчик",
            "милочка",
            "милушка"
        ]
    },
    "Милана": {
        "translit": "milana",
        "gender": "f",
        "genitive": "Миланы",
        "variants": [
            "милана",
            "миланочка"
        ]
    },
    "Милена": {
        "translit": "milena",
        "gender": "f",
        "genitive": "Милены",
        "variants": [
            "милена",
            "миленочка"
        ]
    },
    "Милиса": {
        "translit": "milisa",
        "gender": "f",
        "genitive": "Милисы",
        "variants": [
            "милиса"
        ]
    },
    "Миллана": {
        "translit": "millana",
        "gender": "f",
        "genitive": "Милланы",
        "variants": [
            "миллана"
        ]
    },
    "Милослава": {
        "translit": "miloslava",
        "gender": "f",
        "genitive": "Милославы",
        "variants": [
            "милослава"
        ]
    },
    "Минара": {
        "translit": "minara",
        "gender": "f",
        "genitive": "Минара",
        "variants": [
            "минара"
        ]
    },
    "Миндания": {
        "translit": "mindaniya",
        "gender": "f",
        "genitive": "Миндании",
        "variants": [
            "миндания"
        ]
    },
    "Миннира": {
        "translit": "minnira",
        "gender": "f",
        "genitive": "Минниры",
        "variants": [
            "миннира"
        ]
    },
    "Минслу": {
        "translit": "minslu",
        "gender": "f",
        "genitive": "Минслу",
        "variants": [
            "минслу"
        ]
    },
    "Мира": {
        "translit": "mira",
        "gender": "f",
        "genitive": "Миры",
        "variants": [
            "мира",
            "мирочка"
        ]
    },
    "Мирай": {
        "translit": "miray",
        "gender": "f",
        "genitive": "Мирая",
        "variants": [
            "мирай"
        ]
    },
    "Мирам": {
        "translit": "miram",
        "gender": "m",
        "genitive": "Мирама",
        "variants": [
            "мирам"
        ]
    },
    "Мирана": {
        "translit": "mirana",
        "gender": "f",
        "genitive": "Мираны",
        "variants": [
            "мирана"
        ]
    },
    "Мирас": {
        "translit": "miras",
        "gender": "m",
        "genitive": "Мираса",
        "variants": [
            "мирас"
        ]
    },
    "Мири": {
        "translit": "miri",
        "gender": "f",
        "genitive": "Мири",
        "variants": [
            "мири"
        ]
    },
    "Мириам": {
        "translit": "miriam",
        "gender": "f",
        "genitive": "Мириам",
        "variants": [
            "мириам"
        ]
    },
    "Мирон": {
        "translit": "miron",
        "gender": "m",
        "genitive": "Мирона",
        "variants": [
            "мирон",
            "миронушка",
            "мироша",
            "мирошенька",
            "мирошечка"
        ]
    },
    "Мирослав": {
        "translit": "miroslav",
        "gender": "m",
        "genitive": "Мирослава",
        "variants": [
            "мирослав",
            "мир",
            "мирославушка",
            "мирославчик",
            "мироша",
            "мирчик"
        ]
    },
    "Мирослава": {
        "translit": "miroslava",
        "gender": "f",
        "genitive": "Мирославы",
        "variants": [
            "мирослава",
            "слава"
        ]
    },
    "Мирра": {
        "translit": "mirra",
        "gender": "f",
        "genitive": "Мирры",
        "variants": [
            "мирра",
            "Мира"
        ]
    },
    "Мирсини": {
        "translit": "mirsini",
        "gender": "f",
        "genitive": "Мирсини",
        "variants": [
            "мирсини"
        ]
    },
    "Мирслу": {
        "translit": "mirslu",
        "gender": "f",
        "genitive": "Мирслу",
        "variants": [
            "мирслу"
        ]
    },
    "Митрофан": {
        "translit": "mitrofan",
        "gender": "m",
        "genitive": "Митрофана",
        "variants": [
            "митрофан",
            "митрофанчик",
            "митроша",
            "митрошенька",
            "митрошка",
            "митя"
        ]
    },
    "Митя": {
        "translit": "mitya",
        "gender": "m",
        "genitive": "Мити",
        "variants": [
            "митя"
        ]
    },
    "Михаель": {
        "translit": "mihael",
        "gender": "m",
        "genitive": "Михаэля",
        "variants": [
            "михаель",
            "миха",
            "михаэльчик",
            "миша",
            "мишенька"
        ]
    },
    "Михей": {
        "translit": "mihej",
        "gender": "m",
        "genitive": "Михея",
        "variants": [
            "михей",
            "михейчик",
            "михеюшка"
        ]
    },
    "Миша": {
        "translit": "misha",
        "gender": "m",
        "genitive": "Миши",
        "variants": [
            "миша",
            "михаил",
            "мишаня",
            "мишенька",
            "мишка",
            "мишуля",
            "мишутка"
        ]
    },
    "Мишель": {
        "translit": "mishel",
        "gender": "f",
        "genitive": "Мишель",
        "variants": [
            "мишель"
        ]
    },
    "Мия": {
        "translit": "miya",
        "gender": "f",
        "genitive": "Мии",
        "variants": [
            "мия"
        ]
    },
    "Моисей": {
        "translit": "moisej",
        "gender": "m",
        "genitive": "Моисея",
        "variants": [
            "моисей"
        ]
    },
    "Молдин": {
        "translit": "moldin",
        "gender": "f",
        "genitive": "Молдины",
        "variants": [
            "молдин"
        ]
    },
    "Молдир": {
        "translit": "moldir",
        "gender": "f",
        "genitive": "Молдиры",
        "variants": [
            "молдир"
        ]
    },
    "Мона": {
        "translit": "mona",
        "gender": "f",
        "genitive": "Моны",
        "variants": [
            "мона"
        ]
    },
    "Моника": {
        "translit": "monika",
        "gender": "f",
        "genitive": "Моники",
        "variants": [
            "моника"
        ]
    },
    "Мохигулхон": {
        "translit": "mohigulhon",
        "gender": "f",
        "genitive": "Мохигулхон",
        "variants": [
            "мохигулхон"
        ]
    },
    "Мохинур": {
        "translit": "mohinur",
        "gender": "f",
        "genitive": "Мохинур",
        "variants": [
            "мохинур"
        ]
    },
    "Мохира": {
        "translit": "mohira",
        "gender": "f",
        "genitive": "Мохиры",
        "variants": [
            "мохира"
        ]
    },
    "Мстислав": {
        "translit": "mstislav",
        "gender": "m",
        "genitive": "Мстислава",
        "variants": [
            "мстислав",
            "мстиславчик",
            "мстиша",
            "мстишенька",
            "слава",
            "славик"
        ]
    },
    "Мстислава": {
        "translit": "mstislava",
        "gender": "f",
        "genitive": "Мстиславы",
        "variants": [
            "мстислава"
        ]
    },
    "Мугминат": {
        "translit": "mugminat",
        "gender": "f",
        "genitive": "Мугминат",
        "variants": [
            "мугминат"
        ]
    },
    "Муза": {
        "translit": "muza",
        "gender": "f",
        "genitive": "Музы",
        "variants": [
            "муза"
        ]
    },
    "Музлифат": {
        "translit": "muzlifat",
        "gender": "f",
        "genitive": "Музлифат",
        "variants": [
            "музлифат"
        ]
    },
    "Мукаддас": {
        "translit": "mukaddas",
        "gender": "f",
        "genitive": "Мукаддас",
        "variants": [
            "мукаддас"
        ]
    },
    "Мулаим": {
        "translit": "mulaim",
        "gender": "f",
        "genitive": "Мулаим",
        "variants": [
            "мулаим"
        ]
    },
    "Мунир": {
        "translit": "munir",
        "gender": "m",
        "genitive": "Мунира",
        "variants": [
            "мунир"
        ]
    },
    "Мунира": {
        "translit": "munira",
        "gender": "f",
        "genitive": "Муниры",
        "variants": [
            "мунира"
        ]
    },
    "Мурад": {
        "translit": "murad",
        "gender": "m",
        "genitive": "Мурада",
        "variants": [
            "мурад",
            "мурадик",
            "мурик"
        ]
    },
    "Мурат": {
        "translit": "murat",
        "gender": "m",
        "genitive": "Мурата",
        "variants": [
            "мурат",
            "муратик",
            "мурик"
        ]
    },
    "Мусалия": {
        "translit": "musaliya",
        "gender": "f",
        "genitive": "Мусалии",
        "variants": [
            "мусалия"
        ]
    },
    "Муслим": {
        "translit": "muslim",
        "gender": "m",
        "genitive": "Муслима",
        "variants": [
            "муслим",
            "муслимушка",
            "муслимчик",
            "муся"
        ]
    },
    "Муслима": {
        "translit": "muslima",
        "gender": "f",
        "genitive": "Муслимы",
        "variants": [
            "муслима"
        ]
    },
    "Мустафа": {
        "translit": "mustafa",
        "gender": "m",
        "genitive": "Мустафы",
        "variants": [
            "мустафа"
        ]
    },
    "Мухаммед": {
        "translit": "mukhammed",
        "gender": "m",
        "genitive": "Мухаммеда",
        "variants": [
            "мухаммед"
        ]
    },
    "Мухаммед Али": {
        "translit": "muhhamedali",
        "gender": "m",
        "genitive": "Мухаммеда Али",
        "variants": [
            "мухаммед али"
        ]
    },
    "Мухаммед Эмир": {
        "translit": "mukhammed-emir",
        "gender": "m",
        "genitive": "Мухаммеда Эмира",
        "variants": [
            "мухаммед эмир"
        ]
    },
    "Мухиба": {
        "translit": "muhiba",
        "gender": "f",
        "genitive": "Мухибы",
        "variants": [
            "мухиба"
        ]
    },
    "Мухибахон": {
        "translit": "muhibahon",
        "gender": "f",
        "genitive": "Мухибахон",
        "variants": [
            "мухибахон"
        ]
    },
    "Мухлиса": {
        "translit": "muhlisa",
        "gender": "f",
        "genitive": "Мухлисы",
        "variants": [
            "мухлиса"
        ]
    },
    "Мухтар": {
        "translit": "muhtar",
        "gender": "m",
        "genitive": "Мухтара",
        "variants": [
            "мухтар",
            "мухтарушка",
            "мухтарчик"
        ]
    },
    "Мэри": {
        "translit": "meri",
        "gender": "f",
        "genitive": "Мэри",
        "variants": [
            "мэри"
        ]
    },
    "Мээрим": {
        "translit": "meerim",
        "gender": "f",
        "genitive": "Мээрим",
        "variants": [
            "мээрим"
        ]
    },
    "Нагима": {
        "translit": "nagima",
        "gender": "f",
        "genitive": "Нагимы",
        "variants": [
            "нагима"
        ]
    },
    "Нагмид": {
        "translit": "nagmid",
        "gender": "f",
        "genitive": "Нагмид",
        "variants": [
            "нагмид"
        ]
    },
    "Надежда": {
        "translit": "nadezhda",
        "gender": "f",
        "genitive": "Надежды",
        "variants": [
            "надежда"
        ]
    },
    "Наджие": {
        "translit": "nadzhie",
        "gender": "f",
        "genitive": "Наджии",
        "variants": [
            "наджие"
        ]
    },
    "Наджия": {
        "translit": "nadzhiya",
        "gender": "f",
        "genitive": "Наджии",
        "variants": [
            "наджия"
        ]
    },
    "Надиля": {
        "translit": "nadilya",
        "gender": "f",
        "genitive": "Надили",
        "variants": [
            "надиля"
        ]
    },
    "Надин": {
        "translit": "nadin",
        "gender": "f",
        "genitive": "Надин",
        "variants": [
            "надин"
        ]
    },
    "Надире": {
        "translit": "nadire",
        "gender": "f",
        "genitive": "Надире",
        "variants": [
            "надире"
        ]
    },
    "Надя": {
        "translit": "nadya",
        "gender": "f",
        "genitive": "Нади",
        "variants": [
            "надя",
            "надежда",
            "наденька",
            "надюша"
        ]
    },
    "Нажия": {
        "translit": "nazhiya",
        "gender": "f",
        "genitive": "Нажии",
        "variants": [
            "нажия"
        ]
    },
    "Назар": {
        "translit": "nazar",
        "gender": "m",
        "genitive": "Назара",
        "variants": [
            "назар",
            "зора",
            "назарушка",
            "назарчик"
        ]
    },
    "Назгул": {
        "translit": "nazgull",
        "gender": "f",
        "genitive": "Назгул",
        "variants": [
            "назгул"
        ]
    },
    "Назгуль": {
        "translit": "nazgul",
        "gender": "f",
        "genitive": "Назгуль",
        "variants": [
            "назгуль"
        ]
    },
    "Назерке": {
        "translit": "nazerke",
        "gender": "f",
        "genitive": "Назерке",
        "variants": [
            "назерке"
        ]
    },
    "Назик": {
        "translit": "nazik",
        "gender": "f",
        "genitive": "Назики",
        "variants": [
            "назик"
        ]
    },
    "Назика": {
        "translit": "nazika",
        "gender": "f",
        "genitive": "Назики",
        "variants": [
            "назика"
        ]
    },
    "Назиля": {
        "translit": "nazilya",
        "gender": "f",
        "genitive": "Назили",
        "variants": [
            "назиля"
        ]
    },
    "Назипа": {
        "translit": "nazipa",
        "gender": "f",
        "genitive": "Назипы",
        "variants": [
            "назипа"
        ]
    },
    "Назирочка": {
        "translit": "nazirochka",
        "gender": "f",
        "genitive": "Назирочки",
        "variants": [
            "назирочка"
        ]
    },
    "Назия": {
        "translit": "naziya",
        "gender": "f",
        "genitive": "Назии",
        "variants": [
            "назия"
        ]
    },
    "Назлыгуль": {
        "translit": "nazlygul",
        "gender": "f",
        "genitive": "Назлыгуль",
        "variants": [
            "назлыгуль"
        ]
    },
    "Назмира": {
        "translit": "nazmira",
        "gender": "f",
        "genitive": "Назмиры",
        "variants": [
            "назмира"
        ]
    },
    "Назым": {
        "translit": "nazym",
        "gender": "f",
        "genitive": "Назым",
        "variants": [
            "назым"
        ]
    },
    "Наида": {
        "translit": "naida",
        "gender": "f",
        "genitive": "Наиды",
        "variants": [
            "наида"
        ]
    },
    "Наила": {
        "translit": "naila",
        "gender": "f",
        "genitive": "Наилы",
        "variants": [
            "наила"
        ]
    },
    "Наиль": {
        "translit": "nail",
        "gender": "m",
        "genitive": "Наиля",
        "variants": [
            "наиль"
        ]
    },
    "Наиля": {
        "translit": "nailya",
        "gender": "f",
        "genitive": "Наили",
        "variants": [
            "наиля"
        ]
    },
    "Наина": {
        "translit": "naina",
        "gender": "f",
        "genitive": "Наины",
        "variants": [
            "наина"
        ]
    },
    "Наира": {
        "translit": "naira",
        "gender": "f",
        "genitive": "Наиры",
        "variants": [
            "наира"
        ]
    },
    "Наируи": {
        "translit": "nairui",
        "gender": "f",
        "genitive": "Наируи",
        "variants": [
            "наируи"
        ]
    },
    "Найа": {
        "translit": "naja",
        "gender": "f",
        "genitive": "Найи",
        "variants": [
            "найа"
        ]
    },
    "Найля": {
        "translit": "najlya",
        "gender": "f",
        "genitive": "Найли",
        "variants": [
            "найля"
        ]
    },
    "Накия": {
        "translit": "nakiya",
        "gender": "f",
        "genitive": "Накии",
        "variants": [
            "накия"
        ]
    },
    "Намжилма": {
        "translit": "namzhilma",
        "gender": "f",
        "genitive": "Намжилмы",
        "variants": [
            "намжилма"
        ]
    },
    "Нана": {
        "translit": "nana",
        "gender": "f",
        "genitive": "Наны",
        "variants": [
            "нана"
        ]
    },
    "Нани": {
        "translit": "nani",
        "gender": "f",
        "genitive": "Нани",
        "variants": [
            "нани"
        ]
    },
    "Нанули": {
        "translit": "nanuli",
        "gender": "f",
        "genitive": "Нанули",
        "variants": [
            "нанули"
        ]
    },
    "Написат": {
        "translit": "napisat",
        "gender": "f",
        "genitive": "Написат",
        "variants": [
            "написат"
        ]
    },
    "Нараяна": {
        "translit": "narajyana",
        "gender": "f",
        "genitive": "Нараяны",
        "variants": [
            "нараяна"
        ]
    },
    "Наргиза": {
        "translit": "nargiza",
        "gender": "f",
        "genitive": "Наргизы",
        "variants": [
            "наргиза",
            "Наргиз"
        ]
    },
    "Наргис": {
        "translit": "nargis",
        "gender": "f",
        "genitive": "Наргис",
        "variants": [
            "наргис"
        ]
    },
    "Нарго": {
        "translit": "nargo",
        "gender": "f",
        "genitive": "Нарго",
        "variants": [
            "нарго"
        ]
    },
    "Наргул": {
        "translit": "nargul",
        "gender": "f",
        "genitive": "Наргул",
        "variants": [
            "наргул"
        ]
    },
    "Нарек": {
        "translit": "narek",
        "gender": "m",
        "genitive": "Нарека",
        "variants": [
            "нарек"
        ]
    },
    "Нарине": {
        "translit": "narine",
        "gender": "f",
        "genitive": "Нарине",
        "variants": [
            "нарине"
        ]
    },
    "Наркес": {
        "translit": "narkes",
        "gender": "f",
        "genitive": "Наркес",
        "variants": [
            "наркес"
        ]
    },
    "Нармин": {
        "translit": "narmin",
        "gender": "f",
        "genitive": "Нармин",
        "variants": [
            "нармин"
        ]
    },
    "Нармина": {
        "translit": "narmina",
        "gender": "f",
        "genitive": "Нармины",
        "variants": [
            "нармина"
        ]
    },
    "Нарт": {
        "translit": "nart",
        "gender": "m",
        "genitive": "Нарта",
        "variants": [
            "нарт"
        ]
    },
    "Нарыйа": {
        "translit": "naryja",
        "gender": "f",
        "genitive": "Нарыйа",
        "variants": [
            "нарыйа"
        ]
    },
    "Насиба": {
        "translit": "nasiba",
        "gender": "f",
        "genitive": "Насибы",
        "variants": [
            "насиба"
        ]
    },
    "Настя": {
        "translit": "nastya",
        "gender": "f",
        "genitive": "Насти",
        "variants": [
            "настя",
            "анастасия",
            "анастаска",
            "ася",
            "настенька",
            "настюша",
            "стася",
            "тася"
        ]
    },
    "Наталия": {
        "translit": "natalia",
        "gender": "f",
        "genitive": "Наталии",
        "variants": [
            "наталия"
        ]
    },
    "Наталья": {
        "translit": "natalya",
        "gender": "f",
        "genitive": "Натальи",
        "variants": [
            "наталья"
        ]
    },
    "Натан": {
        "translit": "natan",
        "gender": "m",
        "genitive": "Натана",
        "variants": [
            "натан",
            "натаник",
            "натанчик",
            "натаня",
            "наток"
        ]
    },
    "Натаниэль": {
        "translit": "nataniel",
        "gender": "m",
        "genitive": "Натаниэля",
        "variants": [
            "натаниэль",
            "натаниэл",
            "натаниэльчик",
            "натаниэлюшка"
        ]
    },
    "Наташа": {
        "translit": "natasha",
        "gender": "f",
        "genitive": "Наташи",
        "variants": [
            "наташа",
            "наталья",
            "наташенька"
        ]
    },
    "Натела": {
        "translit": "natela",
        "gender": "f",
        "genitive": "Нателы",
        "variants": [
            "натела"
        ]
    },
    "Нателла": {
        "translit": "natella",
        "gender": "f",
        "genitive": "Нателлы",
        "variants": [
            "нателла"
        ]
    },
    "Наум": {
        "translit": "naum",
        "gender": "m",
        "genitive": "Наума",
        "variants": [
            "наум",
            "наумушка",
            "наумчик",
            "ум",
            "умчик"
        ]
    },
    "Нафиза": {
        "translit": "nafiza",
        "gender": "f",
        "genitive": "Нафизы",
        "variants": [
            "нафиза"
        ]
    },
    "Нафиса": {
        "translit": "nafisa",
        "gender": "f",
        "genitive": "Нафисы",
        "variants": [
            "нафиса"
        ]
    },
    "Нева": {
        "translit": "neva",
        "gender": "f",
        "genitive": "Невы",
        "variants": [
            "нева"
        ]
    },
    "Нелли": {
        "translit": "nelliy",
        "gender": "f",
        "genitive": "Нелли",
        "variants": [
            "нелли",
            "неллечка"
        ]
    },
    "Нелля": {
        "translit": "nellyaa",
        "gender": "f",
        "genitive": "Нелли",
        "variants": [
            "нелля"
        ]
    },
    "Неля": {
        "translit": "nelyaa",
        "gender": "f",
        "genitive": "Нели",
        "variants": [
            "неля"
        ]
    },
    "Неонила": {
        "translit": "neonila",
        "gender": "f",
        "genitive": "Неонилы",
        "variants": [
            "неонила"
        ]
    },
    "Неонилла": {
        "translit": "neonilla",
        "gender": "f",
        "genitive": "Неониллы",
        "variants": [
            "неонилла"
        ]
    },
    "Нестор": {
        "translit": "nestor",
        "gender": "m",
        "genitive": "Нестора",
        "variants": [
            "нестор",
            "несенька",
            "несечка",
            "нестерик",
            "нестерушка",
            "несторушка"
        ]
    },
    "Нефизе": {
        "translit": "nefize",
        "gender": "f",
        "genitive": "Нефизе",
        "variants": [
            "нефизе"
        ]
    },
    "Нехама": {
        "translit": "nehama",
        "gender": "f",
        "genitive": "Нехамы",
        "variants": [
            "нехама"
        ]
    },
    "Ниа": {
        "translit": "nia",
        "gender": "f",
        "genitive": "Нии",
        "variants": [
            "ниа"
        ]
    },
    "Нигар": {
        "translit": "nigar",
        "gender": "f",
        "genitive": "Нигар",
        "variants": [
            "нигар"
        ]
    },
    "Нигина": {
        "translit": "nigina",
        "gender": "f",
        "genitive": "Нигины",
        "variants": [
            "нигина"
        ]
    },
    "Нигора": {
        "translit": "nigora",
        "gender": "f",
        "genitive": "Нигоры",
        "variants": [
            "нигора"
        ]
    },
    "Нигяр": {
        "translit": "nigyar",
        "gender": "f",
        "genitive": "Нигяр",
        "variants": [
            "нигяр"
        ]
    },
    "Ника": {
        "translit": "nika",
        "gender": "f",
        "genitive": "Ники",
        "variants": [
            "ника"
        ]
    },
    "Никанор": {
        "translit": "nikanor",
        "gender": "m",
        "genitive": "Никанора",
        "variants": [
            "никанор"
        ]
    },
    "Никита": {
        "translit": "nikita",
        "gender": "m",
        "genitive": "Никиты",
        "variants": [
            "никита",
            "ник",
            "никитенок",
            "никитка",
            "никитосик",
            "никитушка",
            "никиша"
        ]
    },
    "Николь": {
        "translit": "nikol",
        "gender": "f",
        "genitive": "Николь",
        "variants": [
            "николь"
        ]
    },
    "Николя": {
        "translit": "nikolya",
        "gender": "m",
        "genitive": "Николя",
        "variants": [
            "николя"
        ]
    },
    "Нил": {
        "translit": "nil",
        "gender": "m",
        "genitive": "Нила",
        "variants": [
            "нил",
            "нилинчик",
            "нилито",
            "нило"
        ]
    },
    "Нильс": {
        "translit": "nils",
        "gender": "m",
        "genitive": "Нильса",
        "variants": [
            "нильс"
        ]
    },
    "Нилюфер": {
        "translit": "nilufer",
        "gender": "m",
        "genitive": "Нилюфера",
        "variants": [
            "нилюфер"
        ]
    },
    "Нина": {
        "translit": "nina",
        "gender": "f",
        "genitive": "Нины",
        "variants": [
            "нина",
            "ниночка"
        ]
    },
    "Нинель": {
        "translit": "ninel",
        "gender": "f",
        "genitive": "Нинель",
        "variants": [
            "нинель"
        ]
    },
    "Нино": {
        "translit": "nino",
        "gender": "f",
        "genitive": "Нино",
        "variants": [
            "нино"
        ]
    },
    "Ноа": {
        "translit": "noa",
        "gender": "f",
        "genitive": "Ноа",
        "variants": [
            "ноа"
        ]
    },
    "Нозима": {
        "translit": "nozima",
        "gender": "f",
        "genitive": "Нозимы",
        "variants": [
            "нозима"
        ]
    },
    "Нона": {
        "translit": "nona",
        "gender": "f",
        "genitive": "Ноны",
        "variants": [
            "нона"
        ]
    },
    "Нонна": {
        "translit": "nonna",
        "gender": "f",
        "genitive": "Нонны",
        "variants": [
            "нонна",
            "Нонночка"
        ]
    },
    "Нора": {
        "translit": "nora",
        "gender": "f",
        "genitive": "Норы",
        "variants": [
            "нора",
            "норочка"
        ]
    },
    "Нуашка": {
        "translit": "nuashka",
        "gender": "f",
        "genitive": "Нуашки",
        "variants": [
            "нуашка"
        ]
    },
    "Нуашка ": {
        "translit": "nuyashka",
        "gender": "f",
        "genitive": "Нуашки",
        "variants": [
            "нуашка ",
            "нуа"
        ]
    },
    "Нурадил": {
        "translit": "nuradil",
        "gender": "f",
        "genitive": "Нурадил",
        "variants": [
            "нурадил"
        ]
    },
    "Нурана": {
        "translit": "nurana",
        "gender": "f",
        "genitive": "Нураны",
        "variants": [
            "нурана"
        ]
    },
    "Нуране": {
        "translit": "nurane",
        "gender": "f",
        "genitive": "Нуране",
        "variants": [
            "нуране"
        ]
    },
    "Нурания": {
        "translit": "nuraniya",
        "gender": "f",
        "genitive": "Нурании",
        "variants": [
            "нурания"
        ]
    },
    "Нурбакыт": {
        "translit": "nurbakyt",
        "gender": "f",
        "genitive": "Нурбакыт",
        "variants": [
            "нурбакыт"
        ]
    },
    "Нурбану": {
        "translit": "nurbanu",
        "gender": "f",
        "genitive": "Нурбану",
        "variants": [
            "нурбану"
        ]
    },
    "Нургул": {
        "translit": "nurgul",
        "gender": "f",
        "genitive": "Нургул",
        "variants": [
            "нургул"
        ]
    },
    "Нуржамал": {
        "translit": "nurzhamal",
        "gender": "f",
        "genitive": "Нуржамал",
        "variants": [
            "нуржамал"
        ]
    },
    "Нуржемал": {
        "translit": "nurzhemal",
        "gender": "f",
        "genitive": "Нуржемал",
        "variants": [
            "нуржемал"
        ]
    },
    "Нурзада": {
        "translit": "nurzada",
        "gender": "f",
        "genitive": "Нурзады",
        "variants": [
            "нурзада"
        ]
    },
    "Нурик": {
        "translit": "nurik",
        "gender": "m",
        "genitive": "Нурика",
        "variants": [
            "нурик"
        ]
    },
    "Нурлан": {
        "translit": "nurlan",
        "gender": "m",
        "genitive": "Нурлана",
        "variants": [
            "нурлан"
        ]
    },
    "Нурсауле": {
        "translit": "nursaule",
        "gender": "f",
        "genitive": "Нурсауле",
        "variants": [
            "нурсауле"
        ]
    },
    "Нурсиля": {
        "translit": "nursilya",
        "gender": "f",
        "genitive": "Нурсили",
        "variants": [
            "нурсиля"
        ]
    },
    "Нурсият": {
        "translit": "nursiyat",
        "gender": "f",
        "genitive": "Нурсият",
        "variants": [
            "нурсият"
        ]
    },
    "Нурсулу": {
        "translit": "nursulu",
        "gender": "f",
        "genitive": "Нурсулы",
        "variants": [
            "нурсулу"
        ]
    },
    "Нуфуза": {
        "translit": "nufuza",
        "gender": "f",
        "genitive": "Нуфузы",
        "variants": [
            "нуфуза"
        ]
    },
    "Нэлли": {
        "translit": "nelli",
        "gender": "f",
        "genitive": "Нэлли",
        "variants": [
            "нэлли"
        ]
    },
    "Нэлля": {
        "translit": "nellya",
        "gender": "f",
        "genitive": "Нэлли",
        "variants": [
            "нэлля"
        ]
    },
    "Нэля": {
        "translit": "nelya",
        "gender": "f",
        "genitive": "Нэли",
        "variants": [
            "нэля"
        ]
    },
    "Нюргуяна": {
        "translit": "nyurguyana",
        "gender": "f",
        "genitive": "Нюргуяны",
        "variants": [
            "нюргуяна"
        ]
    },
    "Нюрзият": {
        "translit": "nyurziyat",
        "gender": "f",
        "genitive": "Нюрзият",
        "variants": [
            "нюрзият"
        ]
    },
    "Ованес": {
        "translit": "ovanes",
        "gender": "m",
        "genitive": "Ованеса",
        "variants": [
            "ованес"
        ]
    },
    "Овсанна": {
        "translit": "ovsanna",
        "gender": "f",
        "genitive": "Овсанны",
        "variants": [
            "овсанна"
        ]
    },
    "Оксана": {
        "translit": "oksana",
        "gender": "f",
        "genitive": "Оксаны",
        "variants": [
            "оксана",
            "оксаночка"
        ]
    },
    "Октябрина": {
        "translit": "oktyabrina",
        "gender": "f",
        "genitive": "Октябрины",
        "variants": [
            "октябрина"
        ]
    },
    "Олаф": {
        "translit": "olaf",
        "gender": "m",
        "genitive": "Олафа",
        "variants": [
            "олаф"
        ]
    },
    "Олег": {
        "translit": "oleg",
        "gender": "m",
        "genitive": "Олега",
        "variants": [
            "олег",
            "лека",
            "олежек",
            "олеженька",
            "олежка"
        ]
    },
    "Олеся": {
        "translit": "olesya",
        "gender": "f",
        "genitive": "Олеси",
        "variants": [
            "олеся",
            "олесечка"
        ]
    },
    "Оливия": {
        "translit": "oliviya",
        "gender": "f",
        "genitive": "Оливии",
        "variants": [
            "оливия"
        ]
    },
    "Олимпиада": {
        "translit": "olimpiada",
        "gender": "f",
        "genitive": "Олимпиады",
        "variants": [
            "олимпиада"
        ]
    },
    "Олоф": {
        "translit": "olof",
        "gender": "m",
        "genitive": "Олофа",
        "variants": [
            "олоф"
        ]
    },
    "Ольга": {
        "translit": "olga",
        "gender": "f",
        "genitive": "Ольги",
        "variants": [
            "ольга"
        ]
    },
    "Оля": {
        "translit": "olya",
        "gender": "f",
        "genitive": "Оли",
        "variants": [
            "оля",
            "олечка",
            "ольга"
        ]
    },
    "Омар": {
        "translit": "omar",
        "gender": "m",
        "genitive": "Омара",
        "variants": [
            "омар",
            "омарушка",
            "омарчик",
            "умар"
        ]
    },
    "Омирхан": {
        "translit": "omirhan",
        "gender": "f",
        "genitive": "Омирхан",
        "variants": [
            "омирхан"
        ]
    },
    "Оравхан": {
        "translit": "oravhan",
        "gender": "f",
        "genitive": "Оравхан",
        "variants": [
            "оравхан"
        ]
    },
    "Оразгул": {
        "translit": "orazgul",
        "gender": "f",
        "genitive": "Оразгул",
        "variants": [
            "оразгул"
        ]
    },
    "Орнелла": {
        "translit": "ornella",
        "gender": "f",
        "genitive": "Орнеллы",
        "variants": [
            "орнелла"
        ]
    },
    "Орхан": {
        "translit": "orhan",
        "gender": "m",
        "genitive": "Орхана",
        "variants": [
            "орхан"
        ]
    },
    "Осип": {
        "translit": "osip",
        "gender": "m",
        "genitive": "Осипа",
        "variants": [
            "осип",
            "осенька",
            "осипчик",
            "оська",
            "ося"
        ]
    },
    "Оскар": {
        "translit": "oskar",
        "gender": "m",
        "genitive": "Оскара",
        "variants": [
            "оскар",
            "оса",
            "оска",
            "оскарушка",
            "оскарчик"
        ]
    },
    "Осман": {
        "translit": "osman",
        "gender": "m",
        "genitive": "Османа",
        "variants": [
            "осман",
            "османушка",
            "османчик"
        ]
    },
    "Оснат": {
        "translit": "osnat",
        "gender": "f",
        "genitive": "Оснат",
        "variants": [
            "оснат"
        ]
    },
    "Офелия": {
        "translit": "ofeliya",
        "gender": "f",
        "genitive": "Офелии",
        "variants": [
            "офелия"
        ]
    },
    "Оюна": {
        "translit": "oyuna",
        "gender": "f",
        "genitive": "Оюны",
        "variants": [
            "оюна"
        ]
    },
    "Оя": {
        "translit": "oya",
        "gender": "f",
        "genitive": "Ои",
        "variants": [
            "оя"
        ]
    },
    "Павла": {
        "translit": "pavla",
        "gender": "f",
        "genitive": "Павлы",
        "variants": [
            "павла",
            "павлуша"
        ]
    },
    "Павлина": {
        "translit": "pavlina",
        "gender": "f",
        "genitive": "Павлины",
        "variants": [
            "павлина"
        ]
    },
    "Пантелеймон": {
        "translit": "panteleymon",
        "gender": "m",
        "genitive": "Пантелеймона",
        "variants": [
            "пантелеймон"
        ]
    },
    "Парфен": {
        "translit": "parfyon",
        "gender": "m",
        "genitive": "Парфена",
        "variants": [
            "парфен",
            "парфенко",
            "парфенушка",
            "парфенчик",
            "парфеша"
        ]
    },
    "Патима": {
        "translit": "patima",
        "gender": "f",
        "genitive": "Патимы",
        "variants": [
            "патима",
            "Тима"
        ]
    },
    "Патимат": {
        "translit": "patimat",
        "gender": "f",
        "genitive": "Патимат",
        "variants": [
            "патимат"
        ]
    },
    "Патрисия": {
        "translit": "patrisiya",
        "gender": "f",
        "genitive": "Патрисии",
        "variants": [
            "патрисия"
        ]
    },
    "Пахом": {
        "translit": "pahom",
        "gender": "m",
        "genitive": "Пахома",
        "variants": [
            "пахом",
            "пахомушка",
            "пахомчик"
        ]
    },
    "Паша": {
        "translit": "pasha",
        "gender": "m",
        "genitive": "Паши",
        "variants": [
            "паша",
            "павел",
            "павлик",
            "павлуша",
            "пашенька",
            "пашуня"
        ]
    },
    "Пелагея": {
        "translit": "pelageya",
        "gender": "f",
        "genitive": "Пелагеи",
        "variants": [
            "пелагея"
        ]
    },
    "Перизат": {
        "translit": "perizat",
        "gender": "f",
        "genitive": "Перизат",
        "variants": [
            "перизат"
        ]
    },
    "Петра": {
        "translit": "petra",
        "gender": "f",
        "genitive": "Петры",
        "variants": [
            "петра"
        ]
    },
    "Петя": {
        "translit": "petya",
        "gender": "m",
        "genitive": "Пети",
        "variants": [
            "петя",
            "петенька",
            "петечка",
            "петр",
            "петруня",
            "петюня",
            "петюша"
        ]
    },
    "Пикрия": {
        "translit": "pikriya",
        "gender": "f",
        "genitive": "Пикрии",
        "variants": [
            "пикрия"
        ]
    },
    "Пламен": {
        "translit": "plamen",
        "gender": "m",
        "genitive": "Пламена",
        "variants": [
            "пламен"
        ]
    },
    "Платон": {
        "translit": "platon",
        "gender": "m",
        "genitive": "Платона",
        "variants": [
            "платон",
            "платоня",
            "платоша",
            "тоня",
            "тоха",
            "тоша"
        ]
    },
    "Поликсена": {
        "translit": "poliksena",
        "gender": "f",
        "genitive": "Поликсена",
        "variants": [
            "поликсена"
        ]
    },
    "Полина": {
        "translit": "polina",
        "gender": "f",
        "genitive": "Полины",
        "variants": [
            "полина",
            "полиночка"
        ]
    },
    "Прасковья": {
        "translit": "praskovya",
        "gender": "f",
        "genitive": "Прасковьи",
        "variants": [
            "прасковья"
        ]
    },
    "Праскофья": {
        "translit": "praskofya",
        "gender": "f",
        "genitive": "Праскофьи",
        "variants": [
            "праскофья"
        ]
    },
    "Прохор": {
        "translit": "prohor",
        "gender": "m",
        "genitive": "Прохора",
        "variants": [
            "прохор",
            "проня",
            "проша",
            "прошенька",
            "прошечка"
        ]
    },
    "Рабига": {
        "translit": "rabiga",
        "gender": "f",
        "genitive": "Рабиги",
        "variants": [
            "рабига"
        ]
    },
    "Рабиля": {
        "translit": "rabilya",
        "gender": "f",
        "genitive": "Рабили",
        "variants": [
            "рабиля"
        ]
    },
    "Равиль": {
        "translit": "ravil",
        "gender": "m",
        "genitive": "Равиля",
        "variants": [
            "равиль"
        ]
    },
    "Равиля": {
        "translit": "ravilya",
        "gender": "f",
        "genitive": "Равили",
        "variants": [
            "равиля"
        ]
    },
    "Равия": {
        "translit": "raviya",
        "gender": "f",
        "genitive": "Равии",
        "variants": [
            "равия"
        ]
    },
    "Рада": {
        "translit": "rada",
        "gender": "f",
        "genitive": "Рады",
        "variants": [
            "рада",
            "радочка"
        ]
    },
    "Радель": {
        "translit": "radel",
        "gender": "m",
        "genitive": "Раделя",
        "variants": [
            "радель",
            "радельчик",
            "раделюшка"
        ]
    },
    "Радим": {
        "translit": "radim",
        "gender": "m",
        "genitive": "Радима",
        "variants": [
            "радим"
        ]
    },
    "Радимир": {
        "translit": "radimir",
        "gender": "m",
        "genitive": "Радимира",
        "variants": [
            "радимир",
            "радик",
            "радимирушка",
            "радимирчик",
            "радмир",
            "родомир"
        ]
    },
    "Радион": {
        "translit": "radion",
        "gender": "m",
        "genitive": "Радиона",
        "variants": [
            "радион"
        ]
    },
    "Радмила": {
        "translit": "radmila",
        "gender": "f",
        "genitive": "Радмилы",
        "variants": [
            "радмила"
        ]
    },
    "Радмир": {
        "translit": "radmir",
        "gender": "m",
        "genitive": "Радмира",
        "variants": [
            "радмир",
            "радик",
            "радмирушка",
            "радмирчик",
            "родомир"
        ]
    },
    "Радмира": {
        "translit": "radmira",
        "gender": "f",
        "genitive": "Радмиры",
        "variants": [
            "радмира"
        ]
    },
    "Разиля": {
        "translit": "razilya",
        "gender": "f",
        "genitive": "Разили",
        "variants": [
            "разиля"
        ]
    },
    "Разима": {
        "translit": "razima",
        "gender": "f",
        "genitive": "Разимы",
        "variants": [
            "разима"
        ]
    },
    "Разият": {
        "translit": "raziyat",
        "gender": "f",
        "genitive": "Разият",
        "variants": [
            "разият"
        ]
    },
    "Раиса": {
        "translit": "raisa",
        "gender": "f",
        "genitive": "Раисы",
        "variants": [
            "раиса"
        ]
    },
    "Райана": {
        "translit": "rajana",
        "gender": "f",
        "genitive": "Райаны",
        "variants": [
            "райана"
        ]
    },
    "Райвис": {
        "translit": "rajvis",
        "gender": "f",
        "genitive": "Райвис",
        "variants": [
            "райвис"
        ]
    },
    "Райганат": {
        "translit": "rajganat",
        "gender": "f",
        "genitive": "Райганат",
        "variants": [
            "райганат"
        ]
    },
    "Райгардас": {
        "translit": "raygardas",
        "gender": "m",
        "genitive": "Райгардаса",
        "variants": [
            "райгардас"
        ]
    },
    "Райен": {
        "translit": "rajen",
        "gender": "m",
        "genitive": "Райена",
        "variants": [
            "райен"
        ]
    },
    "Райля": {
        "translit": "rajlya",
        "gender": "f",
        "genitive": "Райли",
        "variants": [
            "райля"
        ]
    },
    "Райхан": {
        "translit": "rajhan",
        "gender": "f",
        "genitive": "Райхан",
        "variants": [
            "райхан"
        ]
    },
    "Райхана": {
        "translit": "rajhana",
        "gender": "f",
        "genitive": "Райханы",
        "variants": [
            "райхана"
        ]
    },
    "Ракия": {
        "translit": "rakiya",
        "gender": "f",
        "genitive": "Ракии",
        "variants": [
            "ракия"
        ]
    },
    "Раксана": {
        "translit": "raksana",
        "gender": "f",
        "genitive": "Раксаны",
        "variants": [
            "раксана"
        ]
    },
    "Ралина": {
        "translit": "ralina",
        "gender": "f",
        "genitive": "Ралины",
        "variants": [
            "ралина"
        ]
    },
    "Рамазан": {
        "translit": "ramazan",
        "gender": "m",
        "genitive": "Рамазана",
        "variants": [
            "рамазан",
            "рамазанушка",
            "рамазанчик"
        ]
    },
    "Рамелла": {
        "translit": "ramella",
        "gender": "f",
        "genitive": "Рамеллы",
        "variants": [
            "рамелла"
        ]
    },
    "Рамзия": {
        "translit": "ramziya",
        "gender": "f",
        "genitive": "Рамзии",
        "variants": [
            "рамзия"
        ]
    },
    "Рами": {
        "translit": "rami",
        "gender": "f",
        "genitive": "Рами",
        "variants": [
            "рами"
        ]
    },
    "Рамида": {
        "translit": "ramida",
        "gender": "f",
        "genitive": "Рамиды",
        "variants": [
            "рамида"
        ]
    },
    "Рамиль": {
        "translit": "ramil",
        "gender": "m",
        "genitive": "Рамиля",
        "variants": [
            "рамиль"
        ]
    },
    "Рамина": {
        "translit": "ramina",
        "gender": "f",
        "genitive": "Рамины",
        "variants": [
            "рамина"
        ]
    },
    "Рания": {
        "translit": "raniya",
        "gender": "f",
        "genitive": "Рании",
        "variants": [
            "рания"
        ]
    },
    "Рано": {
        "translit": "rano",
        "gender": "f",
        "genitive": "Рано",
        "variants": [
            "рано"
        ]
    },
    "Рапсиме": {
        "translit": "rapsime",
        "gender": "f",
        "genitive": "Рапсиме",
        "variants": [
            "рапсиме"
        ]
    },
    "Расим ": {
        "translit": "rasim",
        "gender": "m",
        "genitive": "Расима",
        "variants": [
            "расим "
        ]
    },
    "Расима": {
        "translit": "rasima",
        "gender": "f",
        "genitive": "Расимы",
        "variants": [
            "расима"
        ]
    },
    "Расул": {
        "translit": "rasul",
        "gender": "m",
        "genitive": "Расула",
        "variants": [
            "расул"
        ]
    },
    "Ратмир": {
        "translit": "ratmir",
        "gender": "m",
        "genitive": "Ратмира",
        "variants": [
            "ратмир",
            "ратмирушка",
            "ратмирчик",
            "ратша"
        ]
    },
    "Ратха": {
        "translit": "ratha",
        "gender": "f",
        "genitive": "Ратхи",
        "variants": [
            "ратха"
        ]
    },
    "Рауфа": {
        "translit": "raufa",
        "gender": "f",
        "genitive": "Рауфы",
        "variants": [
            "рауфа"
        ]
    },
    "Раушан": {
        "translit": "raushan",
        "gender": "f",
        "genitive": "Раушан",
        "variants": [
            "раушан"
        ]
    },
    "Раушания": {
        "translit": "raushaniya",
        "gender": "f",
        "genitive": "Раушании",
        "variants": [
            "раушания"
        ]
    },
    "Рафа": {
        "translit": "rafa",
        "gender": "f",
        "genitive": "Рафы",
        "variants": [
            "рафа"
        ]
    },
    "Рафаэль": {
        "translit": "rafael",
        "gender": "m",
        "genitive": "Рафаэль",
        "variants": [
            "рафаэль"
        ]
    },
    "Рахила": {
        "translit": "rahila",
        "gender": "f",
        "genitive": "Рахилы",
        "variants": [
            "рахила"
        ]
    },
    "Рахим": {
        "translit": "rakhim",
        "gender": "m",
        "genitive": "Рахима",
        "variants": [
            "рахим"
        ]
    },
    "Рахымжан": {
        "translit": "rahymzhan",
        "gender": "f",
        "genitive": "Рахымжан",
        "variants": [
            "рахымжан"
        ]
    },
    "Рашид": {
        "translit": "rashid",
        "gender": "m",
        "genitive": "Рашида",
        "variants": [
            "рашид",
            "рашидик",
            "рашидушка",
            "рашик"
        ]
    },
    "Рая": {
        "translit": "raya",
        "gender": "f",
        "genitive": "Раи",
        "variants": [
            "рая",
            "раечка",
            "раиса"
        ]
    },
    "Раяна": {
        "translit": "rayana",
        "gender": "f",
        "genitive": "Раяны",
        "variants": [
            "раяна"
        ]
    },
    "Реваль": {
        "translit": "reval",
        "gender": "m",
        "genitive": "Реваля",
        "variants": [
            "реваль"
        ]
    },
    "Регина": {
        "translit": "regina",
        "gender": "f",
        "genitive": "Регины",
        "variants": [
            "регина",
            "региночка"
        ]
    },
    "Резеда": {
        "translit": "rezeda",
        "gender": "f",
        "genitive": "Резеды",
        "variants": [
            "резеда"
        ]
    },
    "Резида": {
        "translit": "rezida",
        "gender": "f",
        "genitive": "Резиды",
        "variants": [
            "резида"
        ]
    },
    "Резо": {
        "translit": "rezo",
        "gender": "m",
        "genitive": "Резо",
        "variants": [
            "резо",
            "резончик",
            "резотик",
            "резошка",
            "резушка"
        ]
    },
    "Ремзия": {
        "translit": "remziya",
        "gender": "f",
        "genitive": "Ремзии",
        "variants": [
            "ремзия"
        ]
    },
    "Рена": {
        "translit": "rena",
        "gender": "f",
        "genitive": "Рены",
        "variants": [
            "рена"
        ]
    },
    "Ренат": {
        "translit": "renat",
        "gender": "m",
        "genitive": "Рената",
        "variants": [
            "ренат",
            "ренатик",
            "ренатушка",
            "ренечка",
            "реня"
        ]
    },
    "Рената": {
        "translit": "renata",
        "gender": "f",
        "genitive": "Ренаты",
        "variants": [
            "рената",
            "ренаточка",
            "ренатушка"
        ]
    },
    "Риана": {
        "translit": "riana",
        "gender": "f",
        "genitive": "Рианы",
        "variants": [
            "риана",
            "рианочка"
        ]
    },
    "Рианна": {
        "translit": "rianna",
        "gender": "f",
        "genitive": "Рианны",
        "variants": [
            "рианна"
        ]
    },
    "Рида": {
        "translit": "rida",
        "gender": "f",
        "genitive": "Риды",
        "variants": [
            "рида"
        ]
    },
    "Риза": {
        "translit": "riza",
        "gender": "f",
        "genitive": "Ризы",
        "variants": [
            "риза"
        ]
    },
    "Ризида": {
        "translit": "rizida",
        "gender": "f",
        "genitive": "Ризиды",
        "variants": [
            "ризида"
        ]
    },
    "Рима": {
        "translit": "rima",
        "gender": "f",
        "genitive": "Римы",
        "variants": [
            "рима"
        ]
    },
    "Римма": {
        "translit": "rimma",
        "gender": "f",
        "genitive": "Риммы",
        "variants": [
            "римма",
            "риммочка"
        ]
    },
    "Рина": {
        "translit": "rina",
        "gender": "f",
        "genitive": "Рины",
        "variants": [
            "рина"
        ]
    },
    "Ринат": {
        "translit": "rinat",
        "gender": "m",
        "genitive": "Рината",
        "variants": [
            "ринат"
        ]
    },
    "Рината": {
        "translit": "rinata",
        "gender": "f",
        "genitive": "Ринаты",
        "variants": [
            "рината"
        ]
    },
    "Рита": {
        "translit": "rita",
        "gender": "f",
        "genitive": "Риты",
        "variants": [
            "рита"
        ]
    },
    "Ричард": {
        "translit": "richard",
        "gender": "m",
        "genitive": "Ричарда",
        "variants": [
            "ричард"
        ]
    },
    "Роберт": {
        "translit": "robert",
        "gender": "m",
        "genitive": "Роберта",
        "variants": [
            "роберт",
            "роб",
            "робертик",
            "робертушка",
            "робик",
            "робушка"
        ]
    },
    "Родион": {
        "translit": "rodion",
        "gender": "m",
        "genitive": "Родиона",
        "variants": [
            "родион",
            "родик",
            "родионушка",
            "родиончик",
            "родюшка",
            "родя"
        ]
    },
    "Роза": {
        "translit": "roza",
        "gender": "f",
        "genitive": "Розы",
        "variants": [
            "роза",
            "розалия",
            "розочка"
        ]
    },
    "Розита": {
        "translit": "rozita",
        "gender": "f",
        "genitive": "Розиты",
        "variants": [
            "розита"
        ]
    },
    "Роксана": {
        "translit": "roksana",
        "gender": "f",
        "genitive": "Роксаны",
        "variants": [
            "роксана"
        ]
    },
    "Ролан": {
        "translit": "rolan",
        "gender": "m",
        "genitive": "Ролана",
        "variants": [
            "ролан",
            "роланушка",
            "роланчик"
        ]
    },
    "Роланд": {
        "translit": "roland",
        "gender": "m",
        "genitive": "Роланда",
        "variants": [
            "роланд"
        ]
    },
    "Рома": {
        "translit": "roma",
        "gender": "m",
        "genitive": "Ромы",
        "variants": [
            "рома",
            "роман",
            "ромаша",
            "ромашка",
            "ромочка",
            "ромуля"
        ]
    },
    "Рони": {
        "translit": "roni",
        "gender": "m",
        "genitive": "Рони",
        "variants": [
            "рони"
        ]
    },
    "Ростислав": {
        "translit": "rostislav",
        "gender": "m",
        "genitive": "Ростислава",
        "variants": [
            "ростислав",
            "ростик",
            "ростиславчик",
            "ростя",
            "слава",
            "славик"
        ]
    },
    "Ростислава": {
        "translit": "rostislava",
        "gender": "f",
        "genitive": "Ростиславы",
        "variants": [
            "ростислава",
            "слава"
        ]
    },
    "Рошни": {
        "translit": "roshni",
        "gender": "f",
        "genitive": "Рошни",
        "variants": [
            "рошни"
        ]
    },
    "Рубен": {
        "translit": "ruben",
        "gender": "m",
        "genitive": "Рубена",
        "variants": [
            "рубен",
            "рубенушка",
            "рубенчик",
            "рубик",
            "рубя"
        ]
    },
    "Рубина": {
        "translit": "rubina",
        "gender": "f",
        "genitive": "Рубины",
        "variants": [
            "рубина"
        ]
    },
    "Рузалия": {
        "translit": "ruzaliya",
        "gender": "f",
        "genitive": "Рузалии",
        "variants": [
            "рузалия"
        ]
    },
    "Рузана": {
        "translit": "ruzana",
        "gender": "f",
        "genitive": "Рузаны",
        "variants": [
            "рузана"
        ]
    },
    "Рузанна": {
        "translit": "ruzanna",
        "gender": "f",
        "genitive": "Рузанны",
        "variants": [
            "рузанна"
        ]
    },
    "Рузида": {
        "translit": "ruzida",
        "gender": "f",
        "genitive": "Рузиды",
        "variants": [
            "рузида"
        ]
    },
    "Рузиля": {
        "translit": "ruzilya",
        "gender": "f",
        "genitive": "Рузили",
        "variants": [
            "рузиля"
        ]
    },
    "Румада": {
        "translit": "rumada",
        "gender": "f",
        "genitive": "Румады",
        "variants": [
            "румада"
        ]
    },
    "Румия": {
        "translit": "rumiya",
        "gender": "f",
        "genitive": "Румии",
        "variants": [
            "румия"
        ]
    },
    "Русалина": {
        "translit": "rusalina",
        "gender": "f",
        "genitive": "Русалины",
        "variants": [
            "русалина"
        ]
    },
    "Руслан": {
        "translit": "ruslan",
        "gender": "m",
        "genitive": "Руслана",
        "variants": [
            "руслан",
            "русечка",
            "русик",
            "русланчик",
            "руся"
        ]
    },
    "Руслана": {
        "translit": "ruslana",
        "gender": "f",
        "genitive": "Русланы",
        "variants": [
            "руслана",
            "русланочка"
        ]
    },
    "Рустам": {
        "translit": "rustam",
        "gender": "m",
        "genitive": "Рустама",
        "variants": [
            "рустам",
            "рустамушка",
            "рустамчик",
            "рустик",
            "рустя"
        ]
    },
    "Руфат": {
        "translit": "rufat",
        "gender": "m",
        "genitive": "Руфата",
        "variants": [
            "руфат"
        ]
    },
    "Руфина": {
        "translit": "rufina",
        "gender": "f",
        "genitive": "Руфины",
        "variants": [
            "руфина"
        ]
    },
    "Руфия": {
        "translit": "rufiya",
        "gender": "f",
        "genitive": "Руфии",
        "variants": [
            "руфия"
        ]
    },
    "Рухсанам": {
        "translit": "ruhsanam",
        "gender": "f",
        "genitive": "Рухсанам",
        "variants": [
            "рухсанам"
        ]
    },
    "Рушана": {
        "translit": "rushana",
        "gender": "f",
        "genitive": "Рушаны",
        "variants": [
            "рушана"
        ]
    },
    "Рушания": {
        "translit": "rushaniya",
        "gender": "f",
        "genitive": "Рушании",
        "variants": [
            "рушания"
        ]
    },
    "Рэм": {
        "translit": "rem",
        "gender": "m",
        "genitive": "Рэма",
        "variants": [
            "рэм"
        ]
    },
    "Сабина": {
        "translit": "sabina",
        "gender": "f",
        "genitive": "Сабины",
        "variants": [
            "сабина",
            "сабиночка"
        ]
    },
    "Сабира": {
        "translit": "sabira",
        "gender": "f",
        "genitive": "Сабиры",
        "variants": [
            "сабира"
        ]
    },
    "Сабрина": {
        "translit": "sabrina",
        "gender": "f",
        "genitive": "Сабрины",
        "variants": [
            "сабрина"
        ]
    },
    "Сабуха": {
        "translit": "sabuha",
        "gender": "f",
        "genitive": "Сабухи",
        "variants": [
            "сабуха"
        ]
    },
    "Савва": {
        "translit": "savva",
        "gender": "m",
        "genitive": "Саввы",
        "variants": [
            "савва",
            "сава",
            "саввонька",
            "савелий",
            "савочка",
            "савушка"
        ]
    },
    "Савелий": {
        "translit": "savelij",
        "gender": "m",
        "genitive": "Савелия",
        "variants": [
            "савелий",
            "сава",
            "савва",
            "савонька",
            "савушка"
        ]
    },
    "Савия": {
        "translit": "saviya",
        "gender": "f",
        "genitive": "Савии",
        "variants": [
            "савия"
        ]
    },
    "Сагдиана": {
        "translit": "sagdiana",
        "gender": "f",
        "genitive": "Сагдианы",
        "variants": [
            "сагдиана"
        ]
    },
    "Саги": {
        "translit": "sagi",
        "gender": "f",
        "genitive": "Саги",
        "variants": [
            "саги"
        ]
    },
    "Сагират": {
        "translit": "sagirat",
        "gender": "f",
        "genitive": "Сагират",
        "variants": [
            "сагират"
        ]
    },
    "Саид": {
        "translit": "said",
        "gender": "m",
        "genitive": "Саида",
        "variants": [
            "саид"
        ]
    },
    "Саида": {
        "translit": "saida",
        "gender": "f",
        "genitive": "Саиды",
        "variants": [
            "саида"
        ]
    },
    "Саира": {
        "translit": "saira",
        "gender": "f",
        "genitive": "Саиры",
        "variants": [
            "саира"
        ]
    },
    "Сайдам": {
        "translit": "sajdam",
        "gender": "f",
        "genitive": "Сайдам",
        "variants": [
            "сайдам"
        ]
    },
    "Сакинат": {
        "translit": "sakinat",
        "gender": "f",
        "genitive": "Сакинат",
        "variants": [
            "сакинат"
        ]
    },
    "Салават": {
        "translit": "salavat",
        "gender": "m",
        "genitive": "Салавата",
        "variants": [
            "салават"
        ]
    },
    "Салим": {
        "translit": "salim",
        "gender": "m",
        "genitive": "Салима",
        "variants": [
            "салим"
        ]
    },
    "Салима": {
        "translit": "salima",
        "gender": "f",
        "genitive": "Салимы",
        "variants": [
            "салима"
        ]
    },
    "Саломия": {
        "translit": "salomia",
        "gender": "m",
        "genitive": "Саломия",
        "variants": [
            "саломия"
        ]
    },
    "Салтанат": {
        "translit": "saltanat",
        "gender": "f",
        "genitive": "Салтанат",
        "variants": [
            "салтанат"
        ]
    },
    "Сальвадор": {
        "translit": "salvador",
        "gender": "m",
        "genitive": "Сальвадора",
        "variants": [
            "сальвадор"
        ]
    },
    "Саля": {
        "translit": "salya",
        "gender": "f",
        "genitive": "Сали",
        "variants": [
            "саля"
        ]
    },
    "Самал": {
        "translit": "samal",
        "gender": "f",
        "genitive": "Самал",
        "variants": [
            "самал"
        ]
    },
    "Самат": {
        "translit": "samat",
        "gender": "m",
        "genitive": "Самата",
        "variants": [
            "самат"
        ]
    },
    "Самина": {
        "translit": "samina",
        "gender": "f",
        "genitive": "Самины",
        "variants": [
            "самина"
        ]
    },
    "Самир": {
        "translit": "samir",
        "gender": "m",
        "genitive": "Самира",
        "variants": [
            "самир"
        ]
    },
    "Самира": {
        "translit": "samira",
        "gender": "f",
        "genitive": "Самиры",
        "variants": [
            "самира",
            "самирочка"
        ]
    },
    "Самсон": {
        "translit": "samson",
        "gender": "m",
        "genitive": "Самсона",
        "variants": [
            "самсон"
        ]
    },
    "Самуил": {
        "translit": "samuil",
        "gender": "m",
        "genitive": "Самуила",
        "variants": [
            "самуил"
        ]
    },
    "Самуэль": {
        "translit": "samuel",
        "gender": "m",
        "genitive": "Самуэля",
        "variants": [
            "самуэль"
        ]
    },
    "Санал": {
        "translit": "sanal",
        "gender": "m",
        "genitive": "Санала",
        "variants": [
            "санал"
        ]
    },
    "Санам": {
        "translit": "sanam",
        "gender": "f",
        "genitive": "Санам",
        "variants": [
            "санам"
        ]
    },
    "Санда": {
        "translit": "sanda",
        "gender": "f",
        "genitive": "Санды",
        "variants": [
            "санда"
        ]
    },
    "Санди": {
        "translit": "sandi",
        "gender": "f",
        "genitive": "Санди",
        "variants": [
            "санди"
        ]
    },
    "Сандра": {
        "translit": "sandra",
        "gender": "f",
        "genitive": "Сандры",
        "variants": [
            "сандра"
        ]
    },
    "Сандро": {
        "translit": "sandro",
        "gender": "m",
        "genitive": "Сандро",
        "variants": [
            "сандро",
            "сандрочка",
            "сандрушка"
        ]
    },
    "Сандугаш": {
        "translit": "sandugash",
        "gender": "f",
        "genitive": "Сандугаш",
        "variants": [
            "сандугаш"
        ]
    },
    "Санжар": {
        "translit": "sanzhar",
        "gender": "m",
        "genitive": "Санжар",
        "variants": [
            "санжар"
        ]
    },
    "Сания": {
        "translit": "saniya",
        "gender": "f",
        "genitive": "Сании",
        "variants": [
            "сания"
        ]
    },
    "Санталят": {
        "translit": "santalyat",
        "gender": "f",
        "genitive": "Санталят",
        "variants": [
            "санталят"
        ]
    },
    "Саодат": {
        "translit": "saodat",
        "gender": "f",
        "genitive": "Саодат",
        "variants": [
            "саодат"
        ]
    },
    "Сапият": {
        "translit": "sapiyat",
        "gender": "f",
        "genitive": "Сапият",
        "variants": [
            "сапият"
        ]
    },
    "Сара": {
        "translit": "sara",
        "gender": "f",
        "genitive": "Сары",
        "variants": [
            "сара"
        ]
    },
    "Саргылана": {
        "translit": "sargylana",
        "gender": "f",
        "genitive": "Саргыланы",
        "variants": [
            "саргылана"
        ]
    },
    "Сардана": {
        "translit": "sardana",
        "gender": "f",
        "genitive": "Сарданы",
        "variants": [
            "сардана"
        ]
    },
    "Саркис": {
        "translit": "sarkis",
        "gender": "m",
        "genitive": "Саркиса",
        "variants": [
            "саркис"
        ]
    },
    "Сармат": {
        "translit": "sarmat",
        "gender": "m",
        "genitive": "Сармата",
        "variants": [
            "сармат"
        ]
    },
    "Сатеник": {
        "translit": "satenik",
        "gender": "f",
        "genitive": "Сатеник",
        "variants": [
            "сатеник"
        ]
    },
    "Сати": {
        "translit": "sati",
        "gender": "f",
        "genitive": "Сати",
        "variants": [
            "сати"
        ]
    },
    "Сатори": {
        "translit": "satori",
        "gender": "f",
        "genitive": "Сатори",
        "variants": [
            "сатори"
        ]
    },
    "Саулеш": {
        "translit": "saulesh",
        "gender": "f",
        "genitive": "Саулеш",
        "variants": [
            "саулеш"
        ]
    },
    "Сафи": {
        "translit": "safi",
        "gender": "f",
        "genitive": "Сафи",
        "variants": [
            "сафи"
        ]
    },
    "Сафина": {
        "translit": "safina",
        "gender": "f",
        "genitive": "Сафины",
        "variants": [
            "сафина"
        ]
    },
    "Сафия": {
        "translit": "safya",
        "gender": "f",
        "genitive": "Сафии",
        "variants": [
            "сафия"
        ]
    },
    "Саяжан": {
        "translit": "sayazhan",
        "gender": "f",
        "genitive": "Саяжаны",
        "variants": [
            "саяжан"
        ]
    },
    "Саян": {
        "translit": "sayan",
        "gender": "m",
        "genitive": "Саяна",
        "variants": [
            "саян"
        ]
    },
    "Саяна": {
        "translit": "sayana",
        "gender": "f",
        "genitive": "Саяны",
        "variants": [
            "саяна"
        ]
    },
    "Света": {
        "translit": "sveta",
        "gender": "f",
        "genitive": "Светы",
        "variants": [
            "света",
            "светик",
            "светлана",
            "светочка"
        ]
    },
    "Светара": {
        "translit": "svetara",
        "gender": "f",
        "genitive": "Светары",
        "variants": [
            "светара"
        ]
    },
    "Светлана": {
        "translit": "svetlana",
        "gender": "f",
        "genitive": "Светланы",
        "variants": [
            "светлана"
        ]
    },
    "Святослав": {
        "translit": "svyatoslav",
        "gender": "m",
        "genitive": "Святослава",
        "variants": [
            "святослав",
            "святославушка",
            "святославчик",
            "слава",
            "славик",
            "славочка"
        ]
    },
    "Сеадет": {
        "translit": "seadet",
        "gender": "f",
        "genitive": "Сеадет",
        "variants": [
            "сеадет"
        ]
    },
    "Себастьян": {
        "translit": "sebastian",
        "gender": "m",
        "genitive": "Себастьяна",
        "variants": [
            "себастьян"
        ]
    },
    "Сева": {
        "translit": "seva",
        "gender": "m",
        "genitive": "Севы",
        "variants": [
            "сева"
        ]
    },
    "Севара": {
        "translit": "sevara",
        "gender": "f",
        "genitive": "Севары",
        "variants": [
            "севара"
        ]
    },
    "Севастиан": {
        "translit": "sevastian",
        "gender": "m",
        "genitive": "Севастиана",
        "variants": [
            "севастиан"
        ]
    },
    "Севастьян": {
        "translit": "sevastyan",
        "gender": "m",
        "genitive": "Севастьяна",
        "variants": [
            "севастьян",
            "сева",
            "севастьянушка",
            "севастьянчик",
            "севочка",
            "севушка"
        ]
    },
    "Севда": {
        "translit": "sevda",
        "gender": "f",
        "genitive": "Севды",
        "variants": [
            "севда"
        ]
    },
    "Северин": {
        "translit": "severin",
        "gender": "m",
        "genitive": "Северина",
        "variants": [
            "северин"
        ]
    },
    "Северина": {
        "translit": "severina",
        "gender": "f",
        "genitive": "Северины",
        "variants": [
            "северина"
        ]
    },
    "Севиль": {
        "translit": "sevil",
        "gender": "f",
        "genitive": "Севиль",
        "variants": [
            "севиль"
        ]
    },
    "Севиндж": {
        "translit": "sevindzh",
        "gender": "f",
        "genitive": "Севиндж",
        "variants": [
            "севиндж"
        ]
    },
    "Седа": {
        "translit": "seda",
        "gender": "f",
        "genitive": "Седы",
        "variants": [
            "седа"
        ]
    },
    "Седагет": {
        "translit": "sedaget",
        "gender": "f",
        "genitive": "Седагет",
        "variants": [
            "седагет"
        ]
    },
    "Сезим": {
        "translit": "sezim",
        "gender": "f",
        "genitive": "Сезим",
        "variants": [
            "сезим"
        ]
    },
    "Селевна": {
        "translit": "selevna",
        "gender": "f",
        "genitive": "Селевны",
        "variants": [
            "селевна"
        ]
    },
    "Селена": {
        "translit": "selena",
        "gender": "f",
        "genitive": "Селены",
        "variants": [
            "селена"
        ]
    },
    "Семён": {
        "translit": "semyon",
        "gender": "m",
        "genitive": "Семёна",
        "variants": [
            "семён",
            "сема",
            "сенечка",
            "сеня"
        ]
    },
    "Серафим": {
        "translit": "serafim",
        "gender": "m",
        "genitive": "Серафима",
        "variants": [
            "серафим",
            "серафимушка",
            "серафимчик",
            "сима",
            "симочка",
            "симушка"
        ]
    },
    "Серафима": {
        "translit": "serafima",
        "gender": "f",
        "genitive": "Серафимы",
        "variants": [
            "серафима",
            "серафимушка",
            "сима",
            "симочка",
            "симушка"
        ]
    },
    "Сергей": {
        "translit": "sergej",
        "gender": "m",
        "genitive": "Сергея",
        "variants": [
            "сергей",
            "сережа",
            "сереженька",
            "серж"
        ]
    },
    "Сержан": {
        "translit": "serzhan",
        "gender": "f",
        "genitive": "Сержан",
        "variants": [
            "сержан"
        ]
    },
    "Сиадат": {
        "translit": "siadat",
        "gender": "f",
        "genitive": "Сиадат",
        "variants": [
            "сиадат"
        ]
    },
    "Силвия": {
        "translit": "silviyaa",
        "gender": "f",
        "genitive": "Силвии",
        "variants": [
            "силвия"
        ]
    },
    "Сильва": {
        "translit": "silva",
        "gender": "f",
        "genitive": "Сильвы",
        "variants": [
            "сильва"
        ]
    },
    "Сильвия": {
        "translit": "silviya",
        "gender": "f",
        "genitive": "Сильвии",
        "variants": [
            "сильвия"
        ]
    },
    "Симон": {
        "translit": "simon",
        "gender": "m",
        "genitive": "Симона",
        "variants": [
            "симон"
        ]
    },
    "Симона": {
        "translit": "simona",
        "gender": "f",
        "genitive": "Симоны",
        "variants": [
            "симона"
        ]
    },
    "Сирамарг": {
        "translit": "siramarg",
        "gender": "f",
        "genitive": "Сирамарг",
        "variants": [
            "сирамарг"
        ]
    },
    "Слава": {
        "translit": "slava",
        "gender": "m",
        "genitive": "Славы",
        "variants": [
            "слава",
            "славочка",
            "славушка"
        ]
    },
    "Смадар": {
        "translit": "smadar",
        "gender": "f",
        "genitive": "Смадар",
        "variants": [
            "смадар"
        ]
    },
    "Снежана": {
        "translit": "snezhana",
        "gender": "f",
        "genitive": "Снежаны",
        "variants": [
            "снежана",
            "снежаночка"
        ]
    },
    "Снежанна": {
        "translit": "snezhanna",
        "gender": "f",
        "genitive": "Снежанны",
        "variants": [
            "снежанна"
        ]
    },
    "Собира": {
        "translit": "sobira",
        "gender": "f",
        "genitive": "Собиры",
        "variants": [
            "собира"
        ]
    },
    "Согдиана": {
        "translit": "sogdiana",
        "gender": "f",
        "genitive": "Согдианы",
        "variants": [
            "согдиана"
        ]
    },
    "Солмаз": {
        "translit": "solmaz",
        "gender": "m",
        "genitive": "Солмаза",
        "variants": [
            "солмаз"
        ]
    },
    "Соломон": {
        "translit": "solomon",
        "gender": "m",
        "genitive": "Соломона",
        "variants": [
            "соломон",
            "соломонушка",
            "соломончик"
        ]
    },
    "Сона": {
        "translit": "sona",
        "gender": "f",
        "genitive": "Соны",
        "variants": [
            "сона"
        ]
    },
    "Сония": {
        "translit": "soniya",
        "gender": "f",
        "genitive": "Сонии",
        "variants": [
            "сония"
        ]
    },
    "Сонун": {
        "translit": "sonun",
        "gender": "f",
        "genitive": "Сонун",
        "variants": [
            "сонун"
        ]
    },
    "Соня": {
        "translit": "sonya",
        "gender": "f",
        "genitive": "Сони",
        "variants": [
            "соня"
        ]
    },
    "Софико": {
        "translit": "sofiko",
        "gender": "f",
        "genitive": "Софико",
        "variants": [
            "софико"
        ]
    },
    "София": {
        "translit": "sofiya",
        "gender": "f",
        "genitive": "Софии",
        "variants": [
            "софия",
            "сонечка",
            "соня",
            "софа",
            "софушка"
        ]
    },
    "София-Изабель": {
        "translit": "sofia-izabel",
        "gender": "f",
        "genitive": "Софии-Изабель",
        "variants": [
            "софия-изабель"
        ]
    },
    "Софья": {
        "translit": "sofya",
        "gender": "f",
        "genitive": "Софьи",
        "variants": [
            "софья",
            "сонечка",
            "соня",
            "софа",
            "софушка"
        ]
    },
    "Спиридон": {
        "translit": "spiridon",
        "gender": "m",
        "genitive": "Спиридона",
        "variants": [
            "спиридон"
        ]
    },
    "Станислава": {
        "translit": "stanislava",
        "gender": "f",
        "genitive": "Станиславы",
        "variants": [
            "станислава"
        ]
    },
    "Стас": {
        "translit": "stas",
        "gender": "m",
        "genitive": "Стаса",
        "variants": [
            "стас",
            "слава",
            "станислав",
            "станя",
            "стасик"
        ]
    },
    "Стелла": {
        "translit": "steella",
        "gender": "f",
        "genitive": "Стеллы",
        "variants": [
            "стелла"
        ]
    },
    "Стефан": {
        "translit": "stefan",
        "gender": "m",
        "genitive": "Стефана",
        "variants": [
            "стефан"
        ]
    },
    "Стефани": {
        "translit": "stefani",
        "gender": "f",
        "genitive": "Стефани",
        "variants": [
            "стефани"
        ]
    },
    "Стефания": {
        "translit": "stefaniya",
        "gender": "f",
        "genitive": "Стефании",
        "variants": [
            "стефания",
            "стефа"
        ]
    },
    "Стэлла": {
        "translit": "stella",
        "gender": "f",
        "genitive": "Стэллы",
        "variants": [
            "стэлла"
        ]
    },
    "Стёпа": {
        "translit": "styopa",
        "gender": "m",
        "genitive": "Стёпы",
        "variants": [
            "стёпа",
            "степан",
            "степаша",
            "степочка",
            "степушка"
        ]
    },
    "Суджана": {
        "translit": "sudzhana",
        "gender": "f",
        "genitive": "Суджаны",
        "variants": [
            "суджана"
        ]
    },
    "Сузанна": {
        "translit": "suzanna",
        "gender": "f",
        "genitive": "Сузанны",
        "variants": [
            "сузанна"
        ]
    },
    "Сулейман": {
        "translit": "sulejman",
        "gender": "m",
        "genitive": "Сулеймана",
        "variants": [
            "сулейман"
        ]
    },
    "Султан": {
        "translit": "sultan",
        "gender": "m",
        "genitive": "Султана",
        "variants": [
            "султан",
            "султанушка",
            "султанчик"
        ]
    },
    "Сулхия": {
        "translit": "sulhiya",
        "gender": "f",
        "genitive": "Сулхии",
        "variants": [
            "сулхия"
        ]
    },
    "Сурен": {
        "translit": "suren",
        "gender": "m",
        "genitive": "Сурена",
        "variants": [
            "сурен"
        ]
    },
    "Суркура": {
        "translit": "surkura",
        "gender": "f",
        "genitive": "Суркуры",
        "variants": [
            "суркура"
        ]
    },
    "Сурэна": {
        "translit": "surena",
        "gender": "f",
        "genitive": "Сурэны",
        "variants": [
            "сурэна"
        ]
    },
    "Сусанна": {
        "translit": "susanna",
        "gender": "f",
        "genitive": "Сусанны",
        "variants": [
            "сусанна",
            "суссаночка"
        ]
    },
    "Сымбат": {
        "translit": "symbat",
        "gender": "f",
        "genitive": "Сымбат",
        "variants": [
            "сымбат"
        ]
    },
    "Сынару": {
        "translit": "synaru",
        "gender": "f",
        "genitive": "Сынару",
        "variants": [
            "сынару"
        ]
    },
    "Сюзанна": {
        "translit": "syuzanna",
        "gender": "f",
        "genitive": "Сюзанны",
        "variants": [
            "сюзанна"
        ]
    },
    "Сюмбель": {
        "translit": "syumbel",
        "gender": "f",
        "genitive": "Сюмбель",
        "variants": [
            "сюмбель"
        ]
    },
    "Тагир": {
        "translit": "tagir",
        "gender": "m",
        "genitive": "Тагира",
        "variants": [
            "тагир"
        ]
    },
    "Таир": {
        "translit": "tair",
        "gender": "m",
        "genitive": "Таира",
        "variants": [
            "таир"
        ]
    },
    "Таисия": {
        "translit": "taisiya",
        "gender": "f",
        "genitive": "Таисии",
        "variants": [
            "таисия"
        ]
    },
    "Таита": {
        "translit": "taita",
        "gender": "f",
        "genitive": "Таиты",
        "variants": [
            "таита"
        ]
    },
    "Таифа": {
        "translit": "taifa",
        "gender": "f",
        "genitive": "Таифы",
        "variants": [
            "таифа"
        ]
    },
    "Тай": {
        "translit": "tay",
        "gender": "f",
        "genitive": "Тайи",
        "variants": [
            "тай"
        ]
    },
    "Талиб": {
        "translit": "talib",
        "gender": "m",
        "genitive": "Талиба",
        "variants": [
            "талиб"
        ]
    },
    "Талия": {
        "translit": "taliya",
        "gender": "f",
        "genitive": "Талии",
        "variants": [
            "талия"
        ]
    },
    "Тамара": {
        "translit": "tamara",
        "gender": "f",
        "genitive": "Тамары",
        "variants": [
            "тамара"
        ]
    },
    "Тамерлан": {
        "translit": "tamerlan",
        "gender": "m",
        "genitive": "Тамерлана",
        "variants": [
            "тамерлан"
        ]
    },
    "Тамерлана": {
        "translit": "tamerlana",
        "gender": "f",
        "genitive": "Тамерланы",
        "variants": [
            "тамерлана"
        ]
    },
    "Тамила": {
        "translit": "tamila",
        "gender": "f",
        "genitive": "Тамилы",
        "variants": [
            "тамила",
            "тамилочка"
        ]
    },
    "Тамилла": {
        "translit": "tamilla",
        "gender": "f",
        "genitive": "Тамиллы",
        "variants": [
            "тамилла"
        ]
    },
    "Тамир": {
        "translit": "tamir",
        "gender": "m",
        "genitive": "Тамира",
        "variants": [
            "тамир"
        ]
    },
    "Тамо": {
        "translit": "tamo",
        "gender": "f",
        "genitive": "Тамо",
        "variants": [
            "тамо"
        ]
    },
    "Тамука": {
        "translit": "tamuka",
        "gender": "m",
        "genitive": "Тамука",
        "variants": [
            "тамука"
        ]
    },
    "Танзиля": {
        "translit": "tanzilya",
        "gender": "f",
        "genitive": "Танзили",
        "variants": [
            "танзиля"
        ]
    },
    "Танхылу": {
        "translit": "tanhylu",
        "gender": "f",
        "genitive": "Танхылу",
        "variants": [
            "танхылу"
        ]
    },
    "Таня": {
        "translit": "tanya",
        "gender": "f",
        "genitive": "Тани",
        "variants": [
            "таня",
            "танечка",
            "таточка",
            "татоша",
            "татьяна",
            "таша",
            "ташенька"
        ]
    },
    "Тара": {
        "translit": "tara",
        "gender": "f",
        "genitive": "Тары",
        "variants": [
            "тара"
        ]
    },
    "Тарас": {
        "translit": "taras",
        "gender": "m",
        "genitive": "Тараса",
        "variants": [
            "тарас",
            "тараска",
            "тарасочка",
            "тарасушка",
            "тараша"
        ]
    },
    "Тариэл": {
        "translit": "tariel",
        "gender": "m",
        "genitive": "Тариэла",
        "variants": [
            "тариэл"
        ]
    },
    "Тариэль": {
        "translit": "tariel",
        "gender": "m",
        "genitive": "Тариэля",
        "variants": [
            "тариэль"
        ]
    },
    "Таслима": {
        "translit": "taslima",
        "gender": "f",
        "genitive": "Таслимы",
        "variants": [
            "таслима"
        ]
    },
    "Тася": {
        "translit": "tasya",
        "gender": "f",
        "genitive": "Таси",
        "variants": [
            "тася"
        ]
    },
    "Татевик": {
        "translit": "tatevik",
        "gender": "f",
        "genitive": "Татевик",
        "variants": [
            "татевик"
        ]
    },
    "Татьяна": {
        "translit": "tatyana",
        "gender": "f",
        "genitive": "Татьяны",
        "variants": [
            "татьяна"
        ]
    },
    "Тахир": {
        "translit": "tahir",
        "gender": "m",
        "genitive": "Тахира",
        "variants": [
            "тахир"
        ]
    },
    "Тахмина": {
        "translit": "tahmina",
        "gender": "f",
        "genitive": "Тахмины",
        "variants": [
            "тахмина"
        ]
    },
    "Таша": {
        "translit": "tasha",
        "gender": "f",
        "genitive": "Таши",
        "variants": [
            "таша"
        ]
    },
    "Тая": {
        "translit": "taya",
        "gender": "f",
        "genitive": "Таи",
        "variants": [
            "тая"
        ]
    },
    "Теа": {
        "translit": "tea",
        "gender": "f",
        "genitive": "Теи",
        "variants": [
            "теа"
        ]
    },
    "Теймур": {
        "translit": "tejmur",
        "gender": "m",
        "genitive": "Теймура",
        "variants": [
            "теймур"
        ]
    },
    "Темирлан": {
        "translit": "temirlan",
        "gender": "m",
        "genitive": "Темирлана",
        "variants": [
            "темирлан"
        ]
    },
    "Теодора": {
        "translit": "teodora",
        "gender": "f",
        "genitive": "Теодоры",
        "variants": [
            "теодора"
        ]
    },
    "Теона": {
        "translit": "teona",
        "gender": "f",
        "genitive": "Теоны",
        "variants": [
            "теона",
            "теоночка"
        ]
    },
    "Тереза": {
        "translit": "tereza",
        "gender": "f",
        "genitive": "Терезы",
        "variants": [
            "тереза"
        ]
    },
    "Тея": {
        "translit": "teya",
        "gender": "f",
        "genitive": "Теи",
        "variants": [
            "тея"
        ]
    },
    "Тигран": {
        "translit": "tigran",
        "gender": "m",
        "genitive": "Тиграна",
        "variants": [
            "тигран"
        ]
    },
    "Тимофей": {
        "translit": "timofej",
        "gender": "m",
        "genitive": "Тимофея",
        "variants": [
            "тимофей",
            "тима",
            "тимофейка",
            "тимочка",
            "тимоша"
        ]
    },
    "Тимур": {
        "translit": "timur",
        "gender": "m",
        "genitive": "Тимура",
        "variants": [
            "тимур",
            "тима",
            "тимурка",
            "тимурчик",
            "тимуша"
        ]
    },
    "Тина": {
        "translit": "tina",
        "gender": "f",
        "genitive": "Тины",
        "variants": [
            "тина"
        ]
    },
    "Тихон": {
        "translit": "tihon",
        "gender": "m",
        "genitive": "Тихона",
        "variants": [
            "тихон",
            "тихонка",
            "тиша",
            "тишенька",
            "тишечка"
        ]
    },
    "Тишкен": {
        "translit": "tishken",
        "gender": "f",
        "genitive": "Тишкен",
        "variants": [
            "тишкен"
        ]
    },
    "Товшан": {
        "translit": "tovshan",
        "gender": "f",
        "genitive": "Товшан",
        "variants": [
            "товшан"
        ]
    },
    "Тогжан": {
        "translit": "togzhan",
        "gender": "f",
        "genitive": "Тогжан",
        "variants": [
            "тогжан"
        ]
    },
    "Токжан": {
        "translit": "tokzhan",
        "gender": "f",
        "genitive": "Токжан",
        "variants": [
            "токжан"
        ]
    },
    "Толганай": {
        "translit": "tolganaj",
        "gender": "f",
        "genitive": "Толганай",
        "variants": [
            "толганай"
        ]
    },
    "Толкун": {
        "translit": "tolkun",
        "gender": "f",
        "genitive": "Толкун",
        "variants": [
            "толкун"
        ]
    },
    "Толя": {
        "translit": "tolya",
        "gender": "m",
        "genitive": "Толи",
        "variants": [
            "толя",
            "анатолий",
            "толечка",
            "толик",
            "тольчик"
        ]
    },
    "Тома": {
        "translit": "toma",
        "gender": "f",
        "genitive": "Томы",
        "variants": [
            "тома",
            "тамара",
            "томочка"
        ]
    },
    "Томас": {
        "translit": "tomas",
        "gender": "m",
        "genitive": "Томаса",
        "variants": [
            "томас"
        ]
    },
    "Томилана": {
        "translit": "tomilana",
        "gender": "f",
        "genitive": "Томиланы",
        "variants": [
            "томилана"
        ]
    },
    "Томирис": {
        "translit": "tomiris",
        "gender": "f",
        "genitive": "Томирис",
        "variants": [
            "томирис"
        ]
    },
    "Трофим": {
        "translit": "trofim",
        "gender": "m",
        "genitive": "Трофима",
        "variants": [
            "трофим",
            "трофимка",
            "фима"
        ]
    },
    "Туйгууна": {
        "translit": "tujguuna",
        "gender": "f",
        "genitive": "Туйгууны",
        "variants": [
            "туйгууна"
        ]
    },
    "Туяна": {
        "translit": "tuyana",
        "gender": "f",
        "genitive": "Туяны",
        "variants": [
            "туяна"
        ]
    },
    "Тэрри": {
        "translit": "terri",
        "gender": "m",
        "genitive": "Тэрри",
        "variants": [
            "тэрри"
        ]
    },
    "Узишка": {
        "translit": "uzishka",
        "gender": "f",
        "genitive": "Узишки",
        "variants": [
            "узишка"
        ]
    },
    "Улжан": {
        "translit": "ulzhan",
        "gender": "f",
        "genitive": "Улжан",
        "variants": [
            "улжан"
        ]
    },
    "Улпан": {
        "translit": "ulpan",
        "gender": "f",
        "genitive": "Улпан",
        "variants": [
            "улпан"
        ]
    },
    "Ульяна": {
        "translit": "ulyana",
        "gender": "f",
        "genitive": "Ульяны",
        "variants": [
            "ульяна",
            "ульяночка",
            "уля"
        ]
    },
    "Ума": {
        "translit": "uma",
        "gender": "f",
        "genitive": "Умы",
        "variants": [
            "ума"
        ]
    },
    "Умар": {
        "translit": "umar",
        "gender": "m",
        "genitive": "Умара",
        "variants": [
            "умар"
        ]
    },
    "Умеда": {
        "translit": "umeda",
        "gender": "f",
        "genitive": "Умеда",
        "variants": [
            "умеда"
        ]
    },
    "Умит": {
        "translit": "umit",
        "gender": "f",
        "genitive": "Умит",
        "variants": [
            "умит"
        ]
    },
    "Устина": {
        "translit": "ustina",
        "gender": "f",
        "genitive": "Устины",
        "variants": [
            "устина"
        ]
    },
    "Уюта": {
        "translit": "uyuta",
        "gender": "f",
        "genitive": "Уюты",
        "variants": [
            "уюта"
        ]
    },
    "Фагиля": {
        "translit": "fagilya",
        "gender": "f",
        "genitive": "Фагили",
        "variants": [
            "фагиля"
        ]
    },
    "Фаддей": {
        "translit": "faddey",
        "gender": "m",
        "genitive": "Фаддея",
        "variants": [
            "фаддей"
        ]
    },
    "Фадей": {
        "translit": "fadey",
        "gender": "m",
        "genitive": "Фадея",
        "variants": [
            "фадей"
        ]
    },
    "Фазолат": {
        "translit": "fazolat",
        "gender": "f",
        "genitive": "Фазолат",
        "variants": [
            "фазолат"
        ]
    },
    "Фаина": {
        "translit": "faina",
        "gender": "f",
        "genitive": "Фаины",
        "variants": [
            "фаина",
            "фаиночка"
        ]
    },
    "Файха": {
        "translit": "fajha",
        "gender": "f",
        "genitive": "Файхи",
        "variants": [
            "файха"
        ]
    },
    "Фанзиля": {
        "translit": "fanzilya",
        "gender": "f",
        "genitive": "Фанзили",
        "variants": [
            "фанзиля"
        ]
    },
    "Фанзия": {
        "translit": "fanziya",
        "gender": "f",
        "genitive": "Фанзии",
        "variants": [
            "фанзия"
        ]
    },
    "Фаниса": {
        "translit": "fanisa",
        "gender": "f",
        "genitive": "Фанисы",
        "variants": [
            "фаниса"
        ]
    },
    "Фания": {
        "translit": "faniya",
        "gender": "f",
        "genitive": "Фании",
        "variants": [
            "фания"
        ]
    },
    "Фарда": {
        "translit": "farda",
        "gender": "f",
        "genitive": "Фарды",
        "variants": [
            "фарда"
        ]
    },
    "Фарзона": {
        "translit": "farzona",
        "gender": "f",
        "genitive": "Фарзоны",
        "variants": [
            "фарзона"
        ]
    },
    "Фарид": {
        "translit": "farid",
        "gender": "m",
        "genitive": "Фарида",
        "variants": [
            "фарид"
        ]
    },
    "Фарида": {
        "translit": "farida",
        "gender": "f",
        "genitive": "Фариды",
        "variants": [
            "фарида"
        ]
    },
    "Фариза": {
        "translit": "fariza",
        "gender": "f",
        "genitive": "Фаризы",
        "variants": [
            "фариза"
        ]
    },
    "Фархат": {
        "translit": "farhat",
        "gender": "m",
        "genitive": "Фархата",
        "variants": [
            "фархат"
        ]
    },
    "Фатима": {
        "translit": "fatima",
        "gender": "f",
        "genitive": "Фатимы",
        "variants": [
            "фатима",
            "Фатимушка"
        ]
    },
    "Фахд": {
        "translit": "fahd",
        "gender": "m",
        "genitive": "Фахда",
        "variants": [
            "фахд"
        ]
    },
    "Февзие": {
        "translit": "fevzie",
        "gender": "f",
        "genitive": "Февзии",
        "variants": [
            "февзие"
        ]
    },
    "Федора": {
        "translit": "fedora",
        "gender": "f",
        "genitive": "Федоры",
        "variants": [
            "федора"
        ]
    },
    "Федя": {
        "translit": "fedya",
        "gender": "m",
        "genitive": "Феди",
        "variants": [
            "федя",
            "феденька",
            "федечка",
            "федор",
            "федюня",
            "федяня"
        ]
    },
    "Феликс": {
        "translit": "feliks",
        "gender": "m",
        "genitive": "Феликса",
        "variants": [
            "феликс",
            "феленька",
            "фелик",
            "фелька",
            "феля"
        ]
    },
    "Фелина": {
        "translit": "felina",
        "gender": "f",
        "genitive": "Фелины",
        "variants": [
            "фелина"
        ]
    },
    "Феодосия": {
        "translit": "feodosiya",
        "gender": "f",
        "genitive": "Феодосии",
        "variants": [
            "феодосия"
        ]
    },
    "Феония": {
        "translit": "feoniya",
        "gender": "f",
        "genitive": "Феонии",
        "variants": [
            "феония"
        ]
    },
    "Феофания": {
        "translit": "feofaniya",
        "gender": "f",
        "genitive": "Феофании",
        "variants": [
            "феофания"
        ]
    },
    "Фергане": {
        "translit": "fergane",
        "gender": "f",
        "genitive": "Фергане",
        "variants": [
            "фергане"
        ]
    },
    "Фердос": {
        "translit": "ferdos",
        "gender": "f",
        "genitive": "Фердос",
        "variants": [
            "фердос"
        ]
    },
    "Феруза": {
        "translit": "feruza",
        "gender": "f",
        "genitive": "Ферузы",
        "variants": [
            "феруза"
        ]
    },
    "Физа": {
        "translit": "fiza",
        "gender": "f",
        "genitive": "Физа",
        "variants": [
            "физа"
        ]
    },
    "Филипп": {
        "translit": "filipp",
        "gender": "m",
        "genitive": "Филиппа",
        "variants": [
            "филипп",
            "филечка",
            "филиппушка",
            "филька",
            "филюша",
            "филя"
        ]
    },
    "Филлипид": {
        "translit": "fillipid",
        "gender": "m",
        "genitive": "Филлипида",
        "variants": [
            "филлипид"
        ]
    },
    "Фируза": {
        "translit": "firuza",
        "gender": "f",
        "genitive": "Фирузы",
        "variants": [
            "фируза"
        ]
    },
    "Фирюза": {
        "translit": "firyuza",
        "gender": "f",
        "genitive": "Фирюзы",
        "variants": [
            "фирюза"
        ]
    },
    "Флера": {
        "translit": "flera",
        "gender": "f",
        "genitive": "Флеры",
        "variants": [
            "флера"
        ]
    },
    "Флида": {
        "translit": "flida",
        "gender": "f",
        "genitive": "Флиды",
        "variants": [
            "флида"
        ]
    },
    "Флора": {
        "translit": "flora",
        "gender": "f",
        "genitive": "Флоры",
        "variants": [
            "флора"
        ]
    },
    "Флорида": {
        "translit": "florida",
        "gender": "f",
        "genitive": "Флориды",
        "variants": [
            "флорида"
        ]
    },
    "Флюра": {
        "translit": "flyura",
        "gender": "f",
        "genitive": "Флюры",
        "variants": [
            "флюра"
        ]
    },
    "Фома": {
        "translit": "foma",
        "gender": "m",
        "genitive": "Фомы",
        "variants": [
            "фома",
            "фомка",
            "фомочка"
        ]
    },
    "Франческа": {
        "translit": "franczeska",
        "gender": "f",
        "genitive": "Франчески",
        "variants": [
            "франческа"
        ]
    },
    "Фэрис": {
        "translit": "feris",
        "gender": "m",
        "genitive": "Фэриса",
        "variants": [
            "фэрис"
        ]
    },
    "Хабиба": {
        "translit": "habiba",
        "gender": "f",
        "genitive": "Хабибы",
        "variants": [
            "хабиба"
        ]
    },
    "Хадижа": {
        "translit": "hadizha",
        "gender": "f",
        "genitive": "Хадижи",
        "variants": [
            "хадижа"
        ]
    },
    "Хадижат": {
        "translit": "hadizhat",
        "gender": "f",
        "genitive": "Хадижат",
        "variants": [
            "хадижат"
        ]
    },
    "Хазал": {
        "translit": "hazal",
        "gender": "f",
        "genitive": "Хазал",
        "variants": [
            "хазал"
        ]
    },
    "Хайни": {
        "translit": "hajni",
        "gender": "m",
        "genitive": "Хайни",
        "variants": [
            "хайни"
        ]
    },
    "Хаким": {
        "translit": "hakim",
        "gender": "m",
        "genitive": "Хакима",
        "variants": [
            "хаким"
        ]
    },
    "Халжат": {
        "translit": "halzhat",
        "gender": "f",
        "genitive": "Халжат",
        "variants": [
            "халжат"
        ]
    },
    "Халид": {
        "translit": "halid",
        "gender": "m",
        "genitive": "Халида",
        "variants": [
            "халид"
        ]
    },
    "Халида": {
        "translit": "halida",
        "gender": "f",
        "genitive": "Халиды",
        "variants": [
            "халида"
        ]
    },
    "Халима": {
        "translit": "halima",
        "gender": "f",
        "genitive": "Халимы",
        "variants": [
            "халима"
        ]
    },
    "Халимат": {
        "translit": "halimat",
        "gender": "f",
        "genitive": "Халимат",
        "variants": [
            "халимат"
        ]
    },
    "Халиса": {
        "translit": "halisa",
        "gender": "f",
        "genitive": "Халисы",
        "variants": [
            "халиса"
        ]
    },
    "Халися": {
        "translit": "halisya",
        "gender": "f",
        "genitive": "Халисы",
        "variants": [
            "халися"
        ]
    },
    "Хамза": {
        "translit": "hamza",
        "gender": "f",
        "genitive": "Хамзы",
        "variants": [
            "хамза"
        ]
    },
    "Хамсият": {
        "translit": "hamsiyat",
        "gender": "f",
        "genitive": "Хамсият",
        "variants": [
            "хамсият"
        ]
    },
    "Хамшут": {
        "translit": "hamshut",
        "gender": "f",
        "genitive": "Хамшут",
        "variants": [
            "хамшут"
        ]
    },
    "Хана": {
        "translit": "hana",
        "gender": "f",
        "genitive": "Ханы",
        "variants": [
            "хана",
            "Ханна"
        ]
    },
    "Хания": {
        "translit": "haniya",
        "gender": "f",
        "genitive": "Хании",
        "variants": [
            "хания"
        ]
    },
    "Ханна": {
        "translit": "hanna",
        "gender": "f",
        "genitive": "Ханны",
        "variants": [
            "ханна"
        ]
    },
    "Ханум": {
        "translit": "hanum",
        "gender": "f",
        "genitive": "Ханум",
        "variants": [
            "ханум"
        ]
    },
    "Харитон": {
        "translit": "hariton",
        "gender": "m",
        "genitive": "Харитона",
        "variants": [
            "харитон",
            "харитонка",
            "харитонушка",
            "харитоша"
        ]
    },
    "Хатира": {
        "translit": "hatira",
        "gender": "f",
        "genitive": "Хатиры",
        "variants": [
            "хатира"
        ]
    },
    "Хеда": {
        "translit": "heda",
        "gender": "f",
        "genitive": "Хеды",
        "variants": [
            "хеда"
        ]
    },
    "Хидая": {
        "translit": "hidaya",
        "gender": "f",
        "genitive": "Хидаи",
        "variants": [
            "хидая"
        ]
    },
    "Хилола": {
        "translit": "hilola",
        "gender": "f",
        "genitive": "Хилолы",
        "variants": [
            "хилола"
        ]
    },
    "Хорагай": {
        "translit": "horagaj",
        "gender": "f",
        "genitive": "Хорагайи",
        "variants": [
            "хорагай"
        ]
    },
    "Христина": {
        "translit": "hristina",
        "gender": "f",
        "genitive": "Христины",
        "variants": [
            "христина"
        ]
    },
    "Хумора": {
        "translit": "humora",
        "gender": "f",
        "genitive": "Хуморы",
        "variants": [
            "хумора"
        ]
    },
    "Хусноро": {
        "translit": "husnoro",
        "gender": "f",
        "genitive": "Хусноро",
        "variants": [
            "хусноро"
        ]
    },
    "Цвитана": {
        "translit": "tzvitana",
        "gender": "f",
        "genitive": "Цвитаны",
        "variants": [
            "цвитана"
        ]
    },
    "Цезарь": {
        "translit": "czezar",
        "gender": "m",
        "genitive": "Цезаря",
        "variants": [
            "цезарь",
            "зарик",
            "цезарчик"
        ]
    },
    "Цыцыгма": {
        "translit": "cycygma",
        "gender": "f",
        "genitive": "Цыцыгма",
        "variants": [
            "цыцыгма"
        ]
    },
    "Чарли": {
        "translit": "charli",
        "gender": "m",
        "genitive": "Чарли",
        "variants": [
            "чарли"
        ]
    },
    "Чесик": {
        "translit": "chesik",
        "gender": "f",
        "genitive": "Чесик",
        "variants": [
            "чесик"
        ]
    },
    "Чимита": {
        "translit": "chimita",
        "gender": "f",
        "genitive": "Чимиты",
        "variants": [
            "чимита"
        ]
    },
    "Чинара": {
        "translit": "chinara",
        "gender": "f",
        "genitive": "Чинары",
        "variants": [
            "чинара"
        ]
    },
    "Чинчи": {
        "translit": "chinchi",
        "gender": "f",
        "genitive": "Чинчи",
        "variants": [
            "чинчи"
        ]
    },
    "Чичак": {
        "translit": "chichak",
        "gender": "f",
        "genitive": "Чичак",
        "variants": [
            "чичак"
        ]
    },
    "Чолпон": {
        "translit": "cholpon",
        "gender": "f",
        "genitive": "Чолпон",
        "variants": [
            "чолпон"
        ]
    },
    "Чолпонай": {
        "translit": "cholponaj",
        "gender": "f",
        "genitive": "Чолпонай",
        "variants": [
            "чолпонай"
        ]
    },
    "Чулпан": {
        "translit": "chulpan",
        "gender": "f",
        "genitive": "Чулпан",
        "variants": [
            "чулпан"
        ]
    },
    "Шабнам": {
        "translit": "shabnam",
        "gender": "f",
        "genitive": "Шабнам",
        "variants": [
            "шабнам"
        ]
    },
    "Шазие": {
        "translit": "shazie",
        "gender": "f",
        "genitive": "Шазии",
        "variants": [
            "шазие"
        ]
    },
    "Шаира": {
        "translit": "shaira",
        "gender": "f",
        "genitive": "Шаиры",
        "variants": [
            "шаира"
        ]
    },
    "Шайыргул": {
        "translit": "shajyrgul",
        "gender": "f",
        "genitive": "Шайыргул",
        "variants": [
            "шайыргул"
        ]
    },
    "Шамиль": {
        "translit": "shamil",
        "gender": "m",
        "genitive": "Шамиля",
        "variants": [
            "шамиль"
        ]
    },
    "Шамсет": {
        "translit": "shamset",
        "gender": "f",
        "genitive": "Шамсет",
        "variants": [
            "шамсет"
        ]
    },
    "Шария": {
        "translit": "shariya",
        "gender": "f",
        "genitive": "Шарии",
        "variants": [
            "шария"
        ]
    },
    "Шафика": {
        "translit": "shafika",
        "gender": "f",
        "genitive": "Шафики",
        "variants": [
            "шафика"
        ]
    },
    "Шахинура": {
        "translit": "shahinura",
        "gender": "f",
        "genitive": "Шахинуры",
        "variants": [
            "шахинура"
        ]
    },
    "Шахиста": {
        "translit": "shahista",
        "gender": "f",
        "genitive": "Шахисты",
        "variants": [
            "шахиста"
        ]
    },
    "Шахло": {
        "translit": "shahlo",
        "gender": "f",
        "genitive": "Шахло",
        "variants": [
            "шахло"
        ]
    },
    "Шахноза": {
        "translit": "shahnoza",
        "gender": "f",
        "genitive": "Шахнозы",
        "variants": [
            "шахноза"
        ]
    },
    "Шахруза": {
        "translit": "shahruza",
        "gender": "f",
        "genitive": "Шахрузы",
        "variants": [
            "шахруза"
        ]
    },
    "Шергазы": {
        "translit": "shergazy",
        "gender": "f",
        "genitive": "Шергазы",
        "variants": [
            "шергазы"
        ]
    },
    "Шеризат": {
        "translit": "sherizat",
        "gender": "f",
        "genitive": "Шеризат",
        "variants": [
            "шеризат"
        ]
    },
    "Шимон": {
        "translit": "shimon",
        "gender": "m",
        "genitive": "Шимона",
        "variants": [
            "шимон"
        ]
    },
    "Ширин": {
        "translit": "shirin",
        "gender": "f",
        "genitive": "Ширин",
        "variants": [
            "ширин"
        ]
    },
    "Шолпан": {
        "translit": "sholpan",
        "gender": "f",
        "genitive": "Шолпан",
        "variants": [
            "шолпан"
        ]
    },
    "Шон": {
        "translit": "shon",
        "gender": "m",
        "genitive": "Шона",
        "variants": [
            "шон"
        ]
    },
    "Шончалай": {
        "translit": "shonchalaj",
        "gender": "f",
        "genitive": "Шончалай",
        "variants": [
            "шончалай"
        ]
    },
    "Шохина": {
        "translit": "shohina",
        "gender": "f",
        "genitive": "Шохины",
        "variants": [
            "шохина"
        ]
    },
    "Шушан": {
        "translit": "shushan",
        "gender": "f",
        "genitive": "Шушан",
        "variants": [
            "шушан"
        ]
    },
    "Шушанна": {
        "translit": "shushanna",
        "gender": "f",
        "genitive": "Шушанны",
        "variants": [
            "шушанна"
        ]
    },
    "Шынара": {
        "translit": "shynara",
        "gender": "f",
        "genitive": "Шынары",
        "variants": [
            "шынара"
        ]
    },
    "Эвелина": {
        "translit": "evelina",
        "gender": "f",
        "genitive": "Эвелины",
        "variants": [
            "эвелина",
            "эвелиночка"
        ]
    },
    "Эвридика": {
        "translit": "evridika",
        "gender": "f",
        "genitive": "Эвридики",
        "variants": [
            "эвридика"
        ]
    },
    "Эдгар": {
        "translit": "edgar",
        "gender": "m",
        "genitive": "Эдгара",
        "variants": [
            "эдгар",
            "одгер",
            "эдгарка",
            "эдгарчик",
            "эдик"
        ]
    },
    "Эдем": {
        "translit": "edem",
        "gender": "m",
        "genitive": "Эдема",
        "variants": [
            "эдем"
        ]
    },
    "Эдита": {
        "translit": "edita",
        "gender": "f",
        "genitive": "Эдиты",
        "variants": [
            "эдита"
        ]
    },
    "Эдуард": {
        "translit": "eduard",
        "gender": "m",
        "genitive": "Эдуарда",
        "variants": [
            "эдуард",
            "эдечка",
            "эдик",
            "эдюша"
        ]
    },
    "Элана": {
        "translit": "elana",
        "gender": "f",
        "genitive": "Эланы",
        "variants": [
            "элана"
        ]
    },
    "Элен": {
        "translit": "elen",
        "gender": "f",
        "genitive": "Элен",
        "variants": [
            "элен"
        ]
    },
    "Элена": {
        "translit": "elena",
        "gender": "f",
        "genitive": "Элены",
        "variants": [
            "элена"
        ]
    },
    "Элеонора": {
        "translit": "eleonora",
        "gender": "f",
        "genitive": "Элеоноры",
        "variants": [
            "элеонора",
            "элеонорочка"
        ]
    },
    "Элефтереос ": {
        "translit": "elefterreos",
        "gender": "m",
        "genitive": "Элефтереоса",
        "variants": [
            "элефтереос "
        ]
    },
    "Элиаз": {
        "translit": "eliaz",
        "gender": "f",
        "genitive": "Элиаз",
        "variants": [
            "элиаз"
        ]
    },
    "Элиза": {
        "translit": "eliza",
        "gender": "f",
        "genitive": "Элизы",
        "variants": [
            "элиза",
            "Элизонька"
        ]
    },
    "Элизабетт": {
        "translit": "elizabett",
        "gender": "f",
        "genitive": "Элизабетт",
        "variants": [
            "элизабетт",
            "Элизабет"
        ]
    },
    "Элина": {
        "translit": "elina",
        "gender": "f",
        "genitive": "Элины",
        "variants": [
            "элина",
            "Элиночка"
        ]
    },
    "Элисия": {
        "translit": "elisia",
        "gender": "f",
        "genitive": "Элисии",
        "variants": [
            "элисия"
        ]
    },
    "Элита": {
        "translit": "elita",
        "gender": "f",
        "genitive": "Элиты",
        "variants": [
            "элита"
        ]
    },
    "Элиф": {
        "translit": "elif",
        "gender": "f",
        "genitive": "Элифа",
        "variants": [
            "элиф"
        ]
    },
    "Элияна": {
        "translit": "eliyana",
        "gender": "f",
        "genitive": "Элияны",
        "variants": [
            "элияна"
        ]
    },
    "Элла": {
        "translit": "ella",
        "gender": "f",
        "genitive": "Эллы",
        "variants": [
            "элла"
        ]
    },
    "Эллеонора": {
        "translit": "elleonora",
        "gender": "f",
        "genitive": "Эллеоноры",
        "variants": [
            "эллеонора"
        ]
    },
    "Элли": {
        "translit": "elli",
        "gender": "f",
        "genitive": "Элли",
        "variants": [
            "элли"
        ]
    },
    "Эллина": {
        "translit": "ellina",
        "gender": "f",
        "genitive": "Эллины",
        "variants": [
            "эллина"
        ]
    },
    "Эллис": {
        "translit": "ellis",
        "gender": "f",
        "genitive": "Эллис",
        "variants": [
            "эллис"
        ]
    },
    "Элля": {
        "translit": "ellya",
        "gender": "f",
        "genitive": "Элли",
        "variants": [
            "элля"
        ]
    },
    "Элмира": {
        "translit": "elmira",
        "gender": "f",
        "genitive": "Элмиры",
        "variants": [
            "элмира"
        ]
    },
    "Элона": {
        "translit": "elona",
        "gender": "f",
        "genitive": "Элоны",
        "variants": [
            "элона"
        ]
    },
    "Эльбрус": {
        "translit": "elbrus",
        "gender": "m",
        "genitive": "Эльбруса",
        "variants": [
            "эльбрус"
        ]
    },
    "Эльвиза": {
        "translit": "elviza",
        "gender": "f",
        "genitive": "Эльвизы",
        "variants": [
            "эльвиза"
        ]
    },
    "Эльвина": {
        "translit": "elvina",
        "gender": "f",
        "genitive": "Эльвины",
        "variants": [
            "эльвина"
        ]
    },
    "Эльвира": {
        "translit": "elvira",
        "gender": "f",
        "genitive": "Эльвиры",
        "variants": [
            "эльвира",
            "элика",
            "эльвирочка"
        ]
    },
    "Эльдар": {
        "translit": "eldar",
        "gender": "m",
        "genitive": "Эльдара",
        "variants": [
            "эльдар",
            "эик",
            "эльдарик",
            "эльдарчик"
        ]
    },
    "Эльза": {
        "translit": "elza",
        "gender": "f",
        "genitive": "Эльзы",
        "variants": [
            "эльза"
        ]
    },
    "Эльзина": {
        "translit": "elzina",
        "gender": "f",
        "genitive": "Эльзины",
        "variants": [
            "эльзина"
        ]
    },
    "Эльмас": {
        "translit": "elmas",
        "gender": "f",
        "genitive": "Эльмас",
        "variants": [
            "эльмас"
        ]
    },
    "Эльмир": {
        "translit": "elmir",
        "gender": "m",
        "genitive": "Эльмира",
        "variants": [
            "эльмир"
        ]
    },
    "Эльмира": {
        "translit": "elmirra",
        "gender": "f",
        "genitive": "Эльмиры",
        "variants": [
            "эльмира",
            "эльмирочка"
        ]
    },
    "Эльнара": {
        "translit": "elnara",
        "gender": "f",
        "genitive": "Эльнары",
        "variants": [
            "эльнара"
        ]
    },
    "Эмили": {
        "translit": "emili",
        "gender": "f",
        "genitive": "Эмилии",
        "variants": [
            "эмили"
        ]
    },
    "Эмилия": {
        "translit": "emiliya",
        "gender": "f",
        "genitive": "Эмилии",
        "variants": [
            "эмилия"
        ]
    },
    "Эмиль": {
        "translit": "emil",
        "gender": "m",
        "genitive": "Эмиля",
        "variants": [
            "эмиль",
            "миля",
            "эмилик",
            "эмилюша",
            "эмиля"
        ]
    },
    "Эмин": {
        "translit": "emin",
        "gender": "m",
        "genitive": "Эмина",
        "variants": [
            "эмин"
        ]
    },
    "Эмине": {
        "translit": "emine",
        "gender": "f",
        "genitive": "Эмине",
        "variants": [
            "эмине"
        ]
    },
    "Эмир": {
        "translit": "emir",
        "gender": "m",
        "genitive": "Эмира",
        "variants": [
            "эмир"
        ]
    },
    "Эмма": {
        "translit": "emma",
        "gender": "f",
        "genitive": "Эммы",
        "variants": [
            "эмма",
            "эммочка"
        ]
    },
    "Эммануил": {
        "translit": "emmanuil",
        "gender": "m",
        "genitive": "Эммануила",
        "variants": [
            "эммануил",
            "ила",
            "има",
            "моня",
            "эма"
        ]
    },
    "Эммануэлла": {
        "translit": "emmanuella",
        "gender": "f",
        "genitive": "Эммануэллы",
        "variants": [
            "эммануэлла"
        ]
    },
    "Эмран": {
        "translit": "emran",
        "gender": "m",
        "genitive": "Эмрана",
        "variants": [
            "эмран"
        ]
    },
    "Эндже": {
        "translit": "endzhe",
        "gender": "f",
        "genitive": "Эндже",
        "variants": [
            "эндже"
        ]
    },
    "Эндимион": {
        "translit": "endimion",
        "gender": "m",
        "genitive": "Эндимиона",
        "variants": [
            "эндимион"
        ]
    },
    "Эра": {
        "translit": "era",
        "gender": "f",
        "genitive": "Эры",
        "variants": [
            "эра"
        ]
    },
    "Эрдэм": {
        "translit": "erdem",
        "gender": "m",
        "genitive": "Эрдема",
        "variants": [
            "эрдэм"
        ]
    },
    "Эренест": {
        "translit": "erenest",
        "gender": "m",
        "genitive": "Эренеста",
        "variants": [
            "эренест",
            "эник",
            "эня",
            "эря"
        ]
    },
    "Эржебет": {
        "translit": "erzhebet",
        "gender": "f",
        "genitive": "Эржебет",
        "variants": [
            "эржебет"
        ]
    },
    "Эрик": {
        "translit": "erik",
        "gender": "m",
        "genitive": "Эрика",
        "variants": [
            "эрик"
        ]
    },
    "Эрика": {
        "translit": "erika",
        "gender": "f",
        "genitive": "Эрики",
        "variants": [
            "эрика"
        ]
    },
    "Эрмине": {
        "translit": "ermine",
        "gender": "f",
        "genitive": "Эрмине",
        "variants": [
            "эрмине"
        ]
    },
    "Эрна": {
        "translit": "erna",
        "gender": "f",
        "genitive": "Эрны",
        "variants": [
            "эрна"
        ]
    },
    "Эрнест": {
        "translit": "ernest",
        "gender": "m",
        "genitive": "Эрнеста",
        "variants": [
            "эрнест",
            "эник",
            "эня",
            "эря"
        ]
    },
    "Эрнст": {
        "translit": "ernst",
        "gender": "m",
        "genitive": "Эрнста",
        "variants": [
            "эрнст"
        ]
    },
    "Эсма": {
        "translit": "esma",
        "gender": "f",
        "genitive": "Эсмы",
        "variants": [
            "эсма"
        ]
    },
    "Эсмеральда": {
        "translit": "esmeralda",
        "gender": "f",
        "genitive": "Эсмеральды",
        "variants": [
            "эсмеральда"
        ]
    },
    "Эсмира": {
        "translit": "esmira",
        "gender": "f",
        "genitive": "Эсмиры",
        "variants": [
            "эсмира"
        ]
    },
    "Эстель": {
        "translit": "estel",
        "gender": "f",
        "genitive": "Эстель",
        "variants": [
            "эстель"
        ]
    },
    "Эстер": {
        "translit": "ester",
        "gender": "f",
        "genitive": "Эстер",
        "variants": [
            "эстер"
        ]
    },
    "Юдит": {
        "translit": "yudit",
        "gender": "f",
        "genitive": "Юдит",
        "variants": [
            "юдит"
        ]
    },
    "Юлиана": {
        "translit": "yuliana",
        "gender": "f",
        "genitive": "Юлианы",
        "variants": [
            "юлиана",
            "юлианочка"
        ]
    },
    "Юлиса": {
        "translit": "yulisa",
        "gender": "f",
        "genitive": "Юлисы",
        "variants": [
            "юлиса"
        ]
    },
    "Юлия": {
        "translit": "yuliya",
        "gender": "f",
        "genitive": "Юлии",
        "variants": [
            "юлия"
        ]
    },
    "Юля": {
        "translit": "yulya",
        "gender": "f",
        "genitive": "Юли",
        "variants": [
            "юля",
            "юленька",
            "юлия",
            "юльчик"
        ]
    },
    "Юна": {
        "translit": "yuna",
        "gender": "f",
        "genitive": "Юны",
        "variants": [
            "юна",
            "юночка",
            "юня"
        ]
    },
    "Юнис": {
        "translit": "yunis",
        "gender": "m",
        "genitive": "Юниса",
        "variants": [
            "юнис"
        ]
    },
    "Юния": {
        "translit": "yunia",
        "gender": "f",
        "genitive": "Юнии",
        "variants": [
            "юния"
        ]
    },
    "Юнна": {
        "translit": "yunna",
        "gender": "f",
        "genitive": "Юнны",
        "variants": [
            "юнна"
        ]
    },
    "Юнона": {
        "translit": "yunona",
        "gender": "f",
        "genitive": "Юноны",
        "variants": [
            "юнона",
            "юноночка"
        ]
    },
    "Юра": {
        "translit": "yura",
        "gender": "m",
        "genitive": "Юры",
        "variants": [
            "юра",
            "юраня",
            "юрий",
            "юрик",
            "юронька",
            "юрочка"
        ]
    },
    "Юсак": {
        "translit": "yusak",
        "gender": "f",
        "genitive": "Юсак",
        "variants": [
            "юсак"
        ]
    },
    "Юсуф": {
        "translit": "yusuf",
        "gender": "m",
        "genitive": "Юсуфа",
        "variants": [
            "юсуф"
        ]
    },
    "Ягут": {
        "translit": "yagut",
        "gender": "f",
        "genitive": "Ягут",
        "variants": [
            "ягут"
        ]
    },
    "Ядвига": {
        "translit": "yadviga",
        "gender": "f",
        "genitive": "Ядвиги",
        "variants": [
            "ядвига"
        ]
    },
    "Яков": {
        "translit": "yakov",
        "gender": "m",
        "genitive": "Якова",
        "variants": [
            "яков",
            "якуша",
            "яша",
            "яшенька"
        ]
    },
    "Ян": {
        "translit": "yan",
        "gender": "m",
        "genitive": "Яна",
        "variants": [
            "ян",
            "янечка",
            "яник",
            "янчик"
        ]
    },
    "Яна": {
        "translit": "yana",
        "gender": "f",
        "genitive": "Яны",
        "variants": [
            "яна",
            "яночка"
        ]
    },
    "Янина": {
        "translit": "yanina",
        "gender": "f",
        "genitive": "Янины",
        "variants": [
            "янина"
        ]
    },
    "Янис": {
        "translit": "yanis",
        "gender": "m",
        "genitive": "Яниса",
        "variants": [
            "янис"
        ]
    },
    "Януш": {
        "translit": "yanush",
        "gender": "m",
        "genitive": "Януша",
        "variants": [
            "януш"
        ]
    },
    "Ярмила": {
        "translit": "yarmila",
        "gender": "f",
        "genitive": "Ярмилы",
        "variants": [
            "ярмила"
        ]
    },
    "Яромир": {
        "translit": "yaromir",
        "gender": "m",
        "genitive": "Яромира",
        "variants": [
            "яромир",
            "ярик",
            "ярочка"
        ]
    },
    "Ярослав": {
        "translit": "yaroslav",
        "gender": "m",
        "genitive": "Ярослава",
        "variants": [
            "ярослав",
            "слава",
            "славик",
            "яречка",
            "ярославка"
        ]
    },
    "Ярослава": {
        "translit": "yaroslava",
        "gender": "f",
        "genitive": "Ярославы",
        "variants": [
            "ярослава",
            "слава"
        ]
    },
    "Ярославна": {
        "translit": "yaroslavna",
        "gender": "f",
        "genitive": "Ярославны",
        "variants": [
            "ярославна"
        ]
    },
    "Ясин": {
        "translit": "yasin",
        "gender": "m",
        "genitive": "Ясина",
        "variants": [
            "ясин"
        ]
    },
    "Ясира": {
        "translit": "yasira",
        "gender": "f",
        "genitive": "Ясиры",
        "variants": [
            "ясира"
        ]
    },
    "Ясмин": {
        "translit": "yasmin",
        "gender": "f",
        "genitive": "Ясмины",
        "variants": [
            "ясмин"
        ]
    },
    "Ясмина": {
        "translit": "yasmina",
        "gender": "f",
        "genitive": "Ясмины",
        "variants": [
            "ясмина"
        ]
    },
    "Яссер": {
        "translit": "yasser",
        "gender": "m",
        "genitive": "Яссера",
        "variants": [
            "яссер"
        ]
    },
    "Яцек": {
        "translit": "yatsek",
        "gender": "m",
        "genitive": "Яцека",
        "variants": [
            "яцек"
        ]
    },
    "Яша": {
        "translit": "yasha",
        "gender": "f",
        "genitive": "Яши",
        "variants": [
            "яша",
            "якуша",
            "яшенька",
            "яшуня",
            "яшута"
        ]
    },
    "Яэль": {
        "translit": "yael",
        "gender": "f",
        "genitive": "Яэль",
        "variants": [
            "яэль"
        ]
    }
}//# sourceURL=https://img.imgsmail.ru/promopage/newyear2021.202012071408/newyear2021/js/names.js?1607434488251